{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# Data Science with Python and Neo4j\n",
    "\n",
    "## Packages You'll Need\n",
    "\n",
    "```\n",
    "pip install py2neo\n",
    "pip install ipython-cypher\n",
    "pip install pandas\n",
    "pip install networkx\n",
    "pip install python-igraph\n",
    "```\n",
    "\n",
    "## Contents\n",
    "\n",
    "* py2neo\n",
    "* ipython-cypher\n",
    "  - pandas\n",
    "  - NetworkX\n",
    "* igraph\n",
    "* graph3d"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# py2neo\n",
    "\n",
    "`py2neo` is one of Neo4j's Python drivers. It offers a fully-featured interface for interacting with your data in Neo4j. Install `py2neo` with `pip install py2neo`.\n",
    "\n",
    "## Connect\n",
    "\n",
    "Connect to Neo4j with the `Graph` class."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "from scripts.vis import draw\n",
    "\n",
    "graph = Graph()\n",
    "\n",
    "graph.delete_all()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Nodes\n",
    "\n",
    "Create nodes with the `Node` class. The first argument is the node's label. The remaining arguments are an arbitrary amount of node properties or key-value pairs."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"500\"\n",
       "            height=\"300\"\n",
       "            src=\"figure/graph-01e12d90-69bc-4bea-ac29-e6ef504007cf.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x103d25bd0>"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Node\n",
    "\n",
    "nicole = Node(\"Person\", name=\"Nicole\", age=24)\n",
    "drew = Node(\"Person\", name=\"Drew\", age=20)\n",
    "\n",
    "mtdew = Node(\"Drink\", name=\"Mountain Dew\", calories=9000)\n",
    "cokezero = Node(\"Drink\", name=\"Coke Zero\", calories=0)\n",
    "\n",
    "coke = Node(\"Manufacturer\", name=\"Coca Cola\")\n",
    "pepsi = Node(\"Manufacturer\", name=\"Pepsi\")\n",
    "\n",
    "graph.create(nicole, drew, mtdew, cokezero, coke, pepsi)\n",
    "\n",
    "options = {\"Person\": \"name\", \"Drink\": \"name\", \"Manufacturer\": \"name\"}\n",
    "\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Relationships\n",
    "\n",
    "Create relationships between nodes with the `Relationship` class."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"500\"\n",
       "            height=\"300\"\n",
       "            src=\"figure/graph-b3cdeed6-eedc-4006-805b-302375a985eb.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x1058036d0>"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Relationship\n",
    "\n",
    "graph.create(Relationship(nicole, \"LIKES\", cokezero))\n",
    "graph.create(Relationship(nicole, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(drew, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(coke, \"MAKES\", cokezero))\n",
    "graph.create(Relationship(pepsi, \"MAKES\", mtdew))\n",
    "\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Cypher\n",
    "\n",
    "Retrieve Cypher query results with `Graph.cypher.execute`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   | name   | drink       \n",
       "---+--------+--------------\n",
       " 1 | Nicole | Mountain Dew\n",
       " 2 | Nicole | Coke Zero   \n",
       " 3 | Drew   | Mountain Dew"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name AS name, drink.name AS drink\n",
    "\"\"\"\n",
    "\n",
    "data = graph.cypher.execute(query)\n",
    "\n",
    "data"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "source": [
    "Rows can be accessed by index."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       " name   | drink       \n",
       "--------+--------------\n",
       " Nicole | Mountain Dew"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "data[0]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "source": [
    "Columns can be accessed by key or attribute."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Nicole likes to drink Mountain Dew.\n",
      "Nicole likes to drink Coke Zero.\n",
      "Drew likes to drink Mountain Dew.\n"
     ]
    }
   ],
   "source": [
    "for row in data:\n",
    "    print \"{0} likes to drink {1}.\".format(row[\"name\"], row.drink)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Parameterized Cypher\n",
    "\n",
    "Pass parameters to Cypher queries by passing additional key-value arguments to `Graph.cypher.execute.` Parameters in Cypher are named and are wrapped in curly braces."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   | name   | avg_calories\n",
       "---+--------+--------------\n",
       " 1 | Nicole |       4500.0"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p:Person)-[:LIKES]->(drink:Drink)\n",
    "WHERE p.name = {name}\n",
    "RETURN p.name AS name, AVG(drink.calories) AS avg_calories\n",
    "\"\"\"\n",
    "\n",
    "data = graph.cypher.execute(query, name=\"Nicole\")\n",
    "\n",
    "data"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# ipython-cypher\n",
    "\n",
    "`ipython-cypher` exposes `%cypher` magic in Jupyter. Install `ipython-cypher` with `pip install ipython-cypher`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": true,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Cypher\n",
    "\n",
    "`%cypher` is intended for one-line Cypher queries and `%%cypher` is intended for multi-line Cypher queries. Placing `%%cypher` above a Cypher query will display that query's results."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>person.name</th>\n",
       "        <th>drink.name</th>\n",
       "        <th>drink.calories</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Coke Zero</td>\n",
       "        <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Drew</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[u'Nicole', u'Mountain Dew', 9000],\n",
       " [u'Nicole', u'Coke Zero', 0],\n",
       " [u'Drew', u'Mountain Dew', 9000]]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name, drink.name, drink.calories"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Pandas Data Frames\n",
    "\n",
    "Cypher query results can be coerced to `pandas` data frames with the `get_dataframe` method. To assign Cypher query results to a variable, you need to use `%cypher` and separate lines with \\\\. You'll first need to install `pandas` with `pip install pandas`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Drew</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Coke Zero</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name         drink\n",
       "0    Drew  Mountain Dew\n",
       "1  Nicole  Mountain Dew\n",
       "2  Nicole     Coke Zero"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = %cypher MATCH (person)-[:LIKES]->(drink:Drink) \\\n",
    "                  RETURN person.name AS name, drink.name AS drink\n",
    "    \n",
    "df = results.get_dataframe()\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Int64Index([0, 1, 2], dtype='int64')"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.index"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name         drink\n",
       "1  Nicole  Mountain Dew"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.iloc[[1]]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0      Drew\n",
       "1    Nicole\n",
       "2    Nicole\n",
       "Name: name, dtype: object"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df[\"name\"]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# NetworkX Graphs\n",
    "\n",
    "Cypher query results can be coerced to `NetworkX` MultiDiGraphs, graphs that permit multiple edges between nodes, with the `get_graph` method. You'll first need to install `NetworkX` with `pip install networkx`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAd8AAAFBCAYAAAA2bKVrAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAIABJREFUeJzt3Xd8VHX+7/H3pDdCJCjVKBEWI4sFZSGAgkpRIgiLSIBQ\nwgyroIsFE937+D28brmWARFduyeEIhsUAUNVaigJEVHKCgssShFEAwSyqSRM5v6x+2NVDKSeMzN5\nPf/MnDl8Bh/mxfecM+fY3G63WwAAwDR+Vg8AAEBjQ3wBADAZ8QUAwGTEFwAAkxFfAABMRnwBADAZ\n8QUAwGTEFwAAkxFfAABMRnwBADAZ8QUAwGTEFwAAkxFfAABMRnwBADAZ8QUAwGTEFwAAkxFfAABM\nRnwBADAZ8QUAwGTEFwAAkxFfAABMRnwBADAZ8QUAwGTEFwAAkxFfAABMRnwBADAZ8QUAwGTEFwAA\nkxFfAABMRnwBADAZ8QUAwGTEFwAAkxFfAABMRnwBADAZ8QUAwGTEFwAAkxFfAABMRnwBADAZ8QUA\nwGTEFwAAkxFfAABMRnwBADAZ8QUAwGTEFwAAkxFfAABMRnwBADAZ8QUAwGTEFwAAkxFfAABMFmD1\nAN7on//8p/bv36/CwkJFRESoffv2iouLs3osAICXIL7VVFFRoczMTL350kvau2ePbg0KUkRlpYr9\n/LSzokLXtm+vyU8/rWHDhik4ONjqcQEAHszmdrvdVg/h6Q4cOKD77rpLrf71L00uLNRQSUE/ev28\npOWS3mzSRPtDQrR0zRrddNNN1gwLAPB4xPcy9uzZo7t79ND/KyyUvRp/VR9I+n1EhFasX6+uXbs2\n/IAAAK9DfC/h1KlTujUuTs+fPq3RNfhrWirp4aZN9dnf/66rr7664QYEAHglrna+hLffeEN9i4pq\nFF5JGixpZEmJXp02rWEGAwB4NVa+VTh//rzatWihZfn5urkW7/9GUreICB3Ny1NoaGh9jwcA8GKs\nfKuwfPlyxVRU1Cq8khQr6TeSFixYUI9TAQB8AfGtQnZWlgYVFtZpH4OKipS9Zk09TQQA8BXEtwpn\nfvhBzeq4j2aSzp46VR/jAAB8CPGtQlBIiMrruI9ySUHccAMA8DPEtwotr7lGhwLqdgOwQ35+ahET\nU08TAQB8BVc7V2H//v264+abdbSsTLVZu7oktQ8N1QdZWfrNb35T3+MBALwYK98qdOzYUZ1vvFGL\navn+TyWdOXdOb7zxhr766qv6HA0A4OWI7yU88swzejE8XMU1fF+5pL+Eh+svr76q66+/Xv369VNC\nQoI2btwoDjQAADjsfAlut1vjR4xQ/vLlWlhaqpBqvKdC0riQEJX17q2FK1bI399fZWVlmjdvnqZP\nn66oqCilpqZqyJAh8vf3b+iPAADwQMT3MsrLy5U0bJhOrF+vd0pKdMMltj0o6dGwMPl17aqPVq5U\nWFjYT153uVxaunSpnE6nTp06palTp2rcuHHcAQsAGhkOO19GUFCQFmRmKuGZZ3R306a6MyJCCyV9\nK6lA0jFJmZLuiYhQfESEfvP732vp2rUXhVeS/P39NXToUOXk5Cg9PV0rV65Uu3bt9Je//EX5+fnm\nfjAAgGVY+dZAeXm5lixZonenT9f+gwdVUFqqyNBQXXfNNZo4daqGDx+ukJDqHJz+r3/84x+aPn26\nlixZojFjxuiJJ57Qtdde2zAfAADgEYivh/juu+/06quvyjAM3XPPPUpJSdHNN9f2ztIAAE/GYWcP\n0bp1a7300ks6dOiQbrnlFt13333q37+/1q5dyxXSAOBjWPl6qPLycv3tb3/TtGnTFBQUpNTUVA0f\nPlwBdbzrFgDAesTXw1VWVmrVqlVyOp06evSonnzySU2YMEHh4eFWjwYAqCXi60U+++wzTZs2TZs2\nbdLDDz+sRx99VFdddZXVYwEAaohzvl6kW7du+uijj5Sdna28vDx17NhRkydP1sGDB60eDQBQA8TX\nC3Xo0EFvv/229u3bp2bNmik+Pl7Dhw/X559/bvVoAIBq4LCzDygqKlJaWppmzJih2NhYpaam6p57\n7pHNZrN6NADALyC+PqSiokILFy6U0+mUy+VSSkqKEhMTFRQUZPVoAIAfIb4+yO12a82aNXI6ndq/\nf78ef/xxTZw4UZGRkVaPBgAQ53x9ks1mu3CDjszMTG3fvl2xsbH6wx/+oBMnTlg9HgA0esTXx3Xp\n0kUZGRn6/PPPVVRUpE6dOsnhcGjfvn1WjwYAjRbxbSTatWunv/71rzpw4IBiYmLUu3dvDRkyRDk5\nOVaPBgCNDud8G6mSkhLNnj1bL7/8slq1aqWUlBQNGjRIfn78ewwAGhrxbeRcLpcWL16sl156SUVF\nRUpJSVFSUpKCg4OtHg0AfBbxhaR/XyGdlZUlp9OpXbt2acqUKXr44YcVFRVl9WgA4HM4xghJ/75C\n+s4779SqVav0ySefaO/evbruuuv01FNP6dixY1aPBwA+hfjiIjfeeKPmzp2rHTt2qLKyUjfeeKPG\njRunr776yurRAMAnEF9UKSYmRjNmzNDXX3+t66+/Xv369VNCQoKysrLE2QoAqD3O+aLaysrK9P77\n72vatGlq2rSpUlNTNXToUPn7+1s9GgB4FeKLGqusrNTSpUvldDqVl5enqVOnavz48QoNDbV6NADw\nCsQXdZKdnS2n06nc3Fw9+uijmjx5sqKjo60eCwA8Gud8USc9e/ZUZmamsrKydPjwYXXo0EFTpkzR\n4cOHrR4NADwW8UW9iIuLU1pamr766iuFhYXp1ltv1ahRo7Rjxw6rRwMAj0N8Ua9at26tF198UYcO\nHVKXLl00aNAg9evXT2vWrOEKaQD4D875okGVl5crIyNDTqdTQUFBSk1N1fDhwxUQEGD1aABgGeIL\nU1RWVmrVqlVyOp06cuSInnzySdntdoWHh1s9GgCYjsPOMIWfn58SEhK0ceNGffDBB9q0aZOuvfZa\nPfvss8rLy7N6PAAwFfGF6bp166aPPvpIOTk5ysvLU8eOHTVp0iQdPHjQ6tEAwBTEF5bp0KGD3n77\nbe3bt0/NmzdXfHy8hg8frm3btlk9GgA0KM75wmMUFRUpLS1NM2bMULt27ZSamqp7771XNpvN6tEA\noF4RX3iciooKLVy4UE6nUy6XSykpKUpMTFRQUJDVowFAvSC+8Fhut1tr1qzRtGnTtG/fPj3++OOa\nOHGiIiMjrR4NAOqEc77wWDabTf3799eaNWuUmZmp7du3KzY2Vs8884xOnDhh9XgAUGvEF16hS5cu\nysjI0Oeff66SkhJ16tRJDodD+/bts3o0AKgx4guv0q5dO7322ms6cOCAYmJi1Lt3b91///3Kzs62\nejQAqDbO+cKrlZSUaM6cOZo+fbpatmyp1NRUDRo0SH5+/LsSgOcivvAJLpdLixcvltPpVGFhoZ56\n6iklJSUpJCTE6tEA4CLEFz7F7XZr48aNcjqd2rlzp6ZMmaKHH35YUVFRVo8GABdwbA4+xWazqU+f\nPlq5cqU++eQT7d27V7GxsZo6daq+/fZbSdKUKVM0b948VVRUWDwtgMaKlS983rfffquZM2cqPT1d\nPXr00IoVKyRJV199tZ544gk5HA41adLE4ikBNCbEF43GmTNndNddd2nnzp0/+XlUVJQmTZqkKVOm\nqGXLlhZNB6AxIb5oNPLz89WqVSuVl5f/4utBQUEaN26cpk6dqo4dO5o8HYDGhHO+aDSaNWumvXv3\navLkyQoNDb3o9fLycr333nuKi4vT0KFDtXXrVgumBNAYsPJFo3Ty5Em98cYbev3113X69Okqt+vV\nq5dSU1OVkJDAd4cB1Bvii0atuLhY6enpevnll3X48OEqt7v++uuVkpKi0aNHKzg42LwBAfgk4gtI\nOn/+vBYtWiSn06kvv/yyyu1atWqlxx9/XA899JCaNm1q4oQAfAnxBX7E7XZr/fr1cjqdWr16dZXb\nNWnSRA899JAee+wxtW3b1sQJAfgC4gtUYefOnZo+fboWLFggl8v1i9sEBgZq9OjReuqpp9SpU6dq\n7/v48eNau3at8vPz5efnp+joaA0YMEBXXnllfY0PwIMRX+Ayjhw5oldeeUXvvfeeSkpKqtwuISFB\nqampuv3222Wz2S563e12a8OGDXpz2jStz8pS/4AAtSgvl1vSd0FBWltRofsGDtQjKSnq3r37L+4D\ngG8gvkA15efn66233tJrr72mvLy8Krfr1q2bUlJSNGTIEPn7+0uSSktLNWbYMO3ZtEm/Ly5WkqTI\nn+9f0mybTa+HhuquoUP1Vnq6AgMDG+zzALAO8QVqqLS0VHPnztX06dN18ODBKrdr3769nnrqKY0Y\nMULD7rlHV+7apTllZbrctdJFkh4MC1PoHXfow+XLLwQcgO8gvkAtuVwuZWZm6qWXXtK2bduq3C4q\nOFi9Kiv1cUWFqpvRc5LuCQtT94ce0gszZtTLvAA8B/EF6sjtdmvz5s1yOp0XHtrwY6GSfpBU00c3\nfC8pLiREh06c4JGIgI/hlj1AHdlsNt1xxx1avny5vvrqK40fP/7CuVp/SUmqeXglqaWke/38NGf2\n7PobFoBHYOULNIBjx45pxowZevuVV/SFpLha7meLJHvr1tp37BhXPwM+hPgCDeTIkSPqdcMN+vYS\nX0+6HLek8IAAnTx7VuHh4fU3HABLcdgZaCAFBQWKCgio0z5skpoGBurs2bP1MxQAj0B8gQYSEhKi\n0srKOu+n5Pz5X3wEIgDvRXyBBtKiRQvllZersA77OCGprKJCDzzwgDIyMlRWVlZf4wGwEPEFGkjT\npk3V78479X4d9vG2/n3oecOGDRo1apRat26txx57TLt3766nKQFYgQuugAa0bt06PT5kiHYXFamm\n1yqfl3SVpDNVvN61a1c5HA4lJiYqMvLnN6sE4MmIL9CA3G63ft2unZ4+elRja/i/2nSbTdNCQ5V3\nmaulw8LCNGLECDkcDsXHx/OVJMALEF+gge3Zs0d3du+u9KIiJVTzPfMlpV5xhbK//FJFRUVKS0vT\n3LlzlZ+ff8n3xcXFyeFwaMyYMTyeEPBgxBcwQW5uroYMGKDfFxVpUmWlmlWx3Q+SZvr7a35UlFZs\n2KDOnTtfeO3cuXP6+OOPZRiG1q5de8k/LzAwUPfff78cDof69u3LwxkAD0N8AZN8/fXXei41VctX\nrtRQm00jS0t1lf59I40TkuaFhWlVZaWG/fa3+qPTqTZt2lS5r0OHDik9PV2zZs3S8ePHL/nnxsTE\nKDk5WcnJybrmmmvq9TMBqB3iC5gsLy9Ps957T6sWLlT+mTPys9kUHR2twaNHa1xysq644opq78vl\ncunTTz+VYRhatmyZzp8/X+W2NptN/fv3l8Ph0ODBgxUUFFQfHwdALRBfwEf88MMPmjt3rgzD0IED\nBy65bfPmzTV27FjZ7XbdcMMNJk0I4H8RX8DHuN1ubdmyRYZhaOHChSotLb3k9j169JDD4dCDDz7I\n/aMBkxBfwIcVFBQoIyNDhmHoiy++uOS2TZo00ciRI2W329W1a1e+sgQ0IOILNBI7duxQWlqa5s+f\nf9kHNXTu3FkOh0NJSUlq1qyqa7MB1BbxBRqZ0tJSLV68WIZhKCsr65LbXnvttfrmm29YBQP1jHs7\nA41MaGioRo8erQ0bNujAgQN65pln1LJly1/c9rrrrrvsjT0A1BzxBRqxDh066IUXXtDRo0eVmZmp\nQYMGyc/vv78WQkNDdd1112nkyJFat26dKuvhEYkAOOwM4GeOHz+uOXPm6MCBA5o9e7by8/M1f/58\nGYahwsJC2e12jR8//pI3AQFwacQXQLW43W598cUXMgxDH3744YWvKCUkJCgwMNDq8QCvQnwB1Fhx\ncbEWLlyotLQ0HTx4UOPGjZPdbleHDh2sHg3wCpzzBVBj4eHhGj9+vDZv3qwNGzbI5XKpV69e6t27\nt+bNm6eSyzwGEWjsWPkCqBfl5eVatmyZDMPQtm3blJiYKLvdri5dulg9GuBxiC+Aenf06FHNnj1b\naWlpio6OlsPh0KhRoxQVFWX1aIBHIL4AGozL5dK6detkGIZWr16twYMHy26364477uDGHWjUiC8A\nU5w8eVLvv/++DMNQRUWF7Ha7xo0bV+UNPgBfRnwBmMrtdis3N1eGYWjx4sXq06ePHA6HBgwYoICA\nAKvHA0xBfAFYprCwUB988IEMw9C3336r5ORkTZgwQbGxsVaPBjQo4gvAI/z973+/8NSlm266SQ6H\nQ0OGDFFISIjVowH1jvgC8ChlZWXKzMyUYRjasWOHRo8eLYfDoc6dO1s9GlBviC8Aj3Xo0CHNmjVL\n6enpatOmjex2uxITExUZGWn1aECdEF8AHs/lcunTTz+VYRhav369fvvb38rhcCg+Pp6vLMErEV8A\nXuX777/X3LlzlZaWJn9/fzkcDo0ZM0ZXXnml1aMB1UZ8AXglt9utLVu2yDAMZWZmql+/fnI4HOrb\nt6/8/f2tHg+4JOILwOudPXtWGRkZMgxDp06d0oQJE5ScnKyYmBirRwN+EfEF4FN27NihtLQ0ZWRk\nqGvXrnI4HBo8eLCCgoKsHg24gPgC8EmlpaVatGiRDMPQ3r17NXbsWNntdsXFxVk9GsDzfAH4ptDQ\nUCUlJSkrK0vZ2dkKDAzUXXfdpZ49eyo9PV3FxcVWj4hGjJUvgEajoqJCK1euVFpamrZs2aLhw4fL\nbrera9eufGUJpiK+ABql48ePa86cOUpLS1N4eLgcDoeSkpLUrFkzq0dDI0B8ATRqlZWVysrKkmEY\nWrlypQYOHCiHw6E+ffrIz48zc2gYxBcA/iM/P1/z58/Xe++9p6KiItntdo0fP15t2rSxejT4GOIL\nAD/jdru1fft2GYahDz/8UL169ZLD4dDAgQMVGBho9XjwAcQXAC6huLhYCxculGEY+vrrrzVu3DjZ\n7XZ16NDB6tHgxTihAQCXEB4ervHjx2vLli1av369zp8/r549e6pPnz56//33VVpaavWI8EKsfAGg\nhsrLy7Vs2TIZhqFt27YpMTFRDodDt9xyi9WjwUsQXwCog6NHjyo9PV2zZs1S8+bN5XA4NHLkSEVF\nRVk9GjwY8QWAeuByubRu3ToZhqHVq1dr8ODBcjgcuv3227mBBy5CfAGgnp08eVLz5s2TYRhyuVyy\n2+0aO3asWrZsafVo8BDEFwAaiNvtVm5urgzD0KJFi3TnnXfK4XBowIABCggIsHo8WIj4AoAJ/vWv\nf+mDDz6QYRg6fvy4kpOTNWHCBLVr187q0WABvmoEACaIjIzUxIkT9dlnn2nVqlUqLCxU165d1bdv\nXy1YsEBlZWVWjwgTsfIFAIuUlZXp448/lmEY2rlzp5KSkmS329W5c2erR0MDI74A4AG++eYbpaen\nKz09XW3atJHD4VBiYqKaNGlSr39OWVmZiouLFRkZya0yLcRhZwDwALGxsfrzn/+sw4cP69lnn9XK\nlSsVExMju92unJwc1WWddOTIEf2flBS1bNpUTSMi1L5NG4UGB+v6tm01c8YMnTlzph4/CaqDlS8A\neKjvv/9ec+fOlWEYCggIkMPh0JgxY3TllVdW6/2nT5/W70aP1saNGzW2slIPlZfrV5JsktySciS9\nGRamlZWVmjBhgl6cOZPVsEmILwB4OLfbrc2bN8swDC1dulT9+/eXw+FQ3759q3zm8LFjx3R3fLwG\n5+Xpj+XlCrvE/n+QNCEsTJW33qolq1crJCSkQT4H/ov4AoAXOXv2rDIyMmQYhk6fPq3k5GQlJycr\nJibmwjYFBQW6vUsXjTpyRM+4XNXa73lJo0JDZbv7bmVkZlYZddQP/nYBwItERUVp0qRJ+uKLL7R4\n8WLl5eXp5ptv1r333qtFixapvLxcL7/4om46flxPVzO8khQgaW5pqfZt2KCVK1c23AeAJFa+AOD1\nSkpKtHjxYhmGob1796qioEDZ5eW6oRb7miPpw9tv14pNm+p7TPwI8QUAHzJz5kx9+PTTyikvr9X7\nSyXFhITosz17FBsbW7/D4QIOOwOAD/ls3To5ahleSQqVNMztVmZmZv0NhYsQXwDwIae+/15t67iP\nNufO6VReXr3Mg19GfAHAh7hcrjr/YveXVFmDi7VQc8QXAHxIs+bNVdc1a15goK5o3rxe5sEvI74A\n4EP6DxumD8PDa/3+85IWBQaqf//+9TcULsLVzgDgQ4qKihRz1VXaWVqqmMtvfpGPJU3r3FnZu3fX\n92j4EVa+AOBDIiIilDRmjF4NCKjxeyslzQwP1+Snn67/wfATrHwBwMd8/fXXuu2GG/RWebkSq/ke\nt6Sng4K0tVMnrcvNVVBQUEOO2OgRXwDwISdPntSQIUMUERGhXbm5+mNRkX5XWSnbJd5TIemJ4GBt\natNGG7ZtU3R0tFnjNlocdgYAH7F//37Fx8erT58+WrVqlTZv3643rr1WnSMi9KbNpn/9bPvjkv6v\nv7+uCQ3V0Z49tfnLLwmvSVj5AoAP2Lhxox588EG98MILmjBhwoWfu91uZWVl6c1p07Rm/Xq1CQpS\nuJ+fCiordfL8eY0cOVKTnnhCv/71ry2cvvEhvgDg5ebNm6epU6cqIyNDd999d5Xb5efn67vvvlNx\ncbEiIyMVExOj8Dp8LQm1R3wBwEu53W798Y9/1Jw5c7RixQrdcENtnmMEK9T8WnQAgOXOnTsnh8Oh\nAwcOKDc3Vy1atLB6JNQAF1wBgJfJz89X//79VVJSog0bNhBeL0R8AcCLHDx4UPHx8erWrZsWLlyo\nsLAwq0dCLRBfAPAS2dnZ6tWrl5588kk5nU75+fEr3FtxzhcAvEBGRoYee+wxzZs3TwMGDLB6HNQR\n8QUAD+Z2u/X888/r3Xff1bp169S5c2erR0I9IL4A4KHKy8v10EMPaffu3dq6datat25t9UioJ8QX\nADzQmTNnNGzYMDVp0kSbNm3iZhg+hrP1AOBhDh06pB49euimm27S4sWLCa8PIr4A4EFyc3PVs2dP\nPfLII3rllVfk7+9v9UhoABx2BgAP8dFHH2nSpEmaPXu2EhISrB4HDYj4AoDF3G63pk2bpr/+9a9a\nvXq1brnlFqtHQgMjvgBgoYqKCj3yyCPatm2btm7dqrZt21o9EkxAfAHAIgUFBRo+fLgCAwO1efNm\nNWnSxOqRYBIuuAIACxw5ckQ9e/ZUhw4dlJmZSXgbGeILACbbvn27evToIYfDoddff10BARyEbGz4\nLw4AJvr44481ceJEGYah+++/3+pxYBHiCwAmcLvdmjlzpqZPn65Vq1bptttus3okWIj4AkADO3/+\nvB577DFt2rRJOTk5uuaaa6weCRYjvgDQgAoLCzVixAi5XC5t2bJFTZs2tXokeAAuuAKABnLs2DHd\nfvvtatu2rZYvX054cQHxBYAGsGPHDsXHx2v06NF65513FBgYaPVI8CAcdgaAerZ8+XIlJyfrrbfe\n0gMPPGD1OPBAxBcA6tHrr7+u559/XsuXL1e3bt2sHgceivgCQD1wuVyaOnWqVq9erezsbLVr187q\nkeDBiC8A1FFRUZFGjRql4uJiZWdn64orrrB6JHg4LrgCgDr47rvv1Lt3bzVv3lyrVq0ivKgW4gsA\ntbR7927Fx8dr2LBhSktLU1BQkNUjwUtw2BkAauGTTz7R2LFj9dprrykxMdHqceBlWPkCQA298847\nSk5O1pIlSwgvaoWVLwBUU2VlpZ5++mktXbpUmzdvVvv27a0eCV6K+AJANZSUlGjMmDE6deqUcnJy\nFB0dbfVI8GIcdgaAKrjdbknS999/rz59+igsLEyrV68mvKgz4gsAv2DevHkaOnSodu3apfj4eCUk\nJGju3LkKDg62ejT4AJv7f/9pBwCQ2+3Wc889pz/96U+SpJCQEL377rsaM2aMxZPBl3DOFwD+49y5\nc7Lb7Zo/f/6Fn5WVlenUqVMWTgVfRHwBQNLp06c1dOhQbd68+Sc/Dw4OVqtWrSyaCr6K+AJo9A4e\nPKiBAwfqn//8509+Hh0drczMTPXs2dOiyeCruOAKQKO2ZcsWde/e/aLw/upXv1Jubi7hRYMgvgAa\nrYyMDN199906ffr0T35+xx13KCcnh5tooMFw2BmATzlw4IA+/fRTnT51SjabTc2vvFIDBw78yfN1\n3W63nn/+ef3P//zPRe9PSkqSYRh8pQgNiq8aAfB6LpdLy5Yt0xsvvqhdu3ZpqKQWZWWSzabjwcHK\nlNS9WzdNTk3VXXfdpUmTJmn27NkX7ee5557Ts88+K5vNZvZHQCNDfAF4tcLCQj143306+eWXeqKo\nSA9I+vmatUTSAkmvhIfrbHCwjuXn/+T1wMBAzZo1S0lJSSZNjcaO+ALwWqWlpbq7e3d12r9fb547\np8DLbH9O0oOS1urfQZakK664QkuWLFHv3r0bdFbgx4gvAK819oEHVLliheaVlam6B4pdkgZI2iKp\n7XXXacWKFerYsWPDDQn8AuILwCsdPnxYt8XF6WhZmcJq+N58SW1tNn2xZ4/i4uIaYjzgkviqEQCv\n9M7rr2tsZWWNwytJzSSNCAlR5uLF9T0WUC2sfAF4nYqKCrWNjtbmwkL9qpb72C7pgebNdSgvj6ub\nYTpWvgC8zokTJxRUWVnr8ErSbZJOFxSosLCwvsYCqo34AvA6BQUFivT3r/N+mgYGqqCgoB4mAmqG\n+ALwOmFhYSqprKzzfopdLoWF1easMVA3xBeA12nRooXyKyqUf/lNq3RMktvPT1FRUfU1FlBtxBeA\n14mIiNDghATNqcOFUu/5+ytp1Cj518Pha6CmuNoZgFfaunWrxvXrp33FxTVeRVRIuiY0VGs+/1yd\nOnVqiPGAS2LlC8Arde/eXU2vvlpv+tX815gzIEBxnTsTXliG+ALwSjabTR+sWKHnIyP1txq8712b\nTe9GRWnekiUNNhtwOcQXgNeKjY3Vp5s26ZnoaKUEBOjYJbY9LOnRwEA5W7bU2pwctW7d2qQpgYsR\nXwBerXPnzsrdvVtl48frxtBQDQsP10JJmyRt1L8fJTgoIkK3hYcr6He/09Zdu9ShQwdrh0ajxwVX\nAHxGYWGl6tm+AAABcUlEQVSh/jZ/vlYsWKD806dls9kU3by57h8zRiNGjOA7vfAYxBcAAJNx2BkA\nAJMRXwAATEZ8AQAwGfEFAMBkxBcAAJMRXwAATEZ8AQAwGfEFAMBkxBcAAJMRXwAATEZ8AQAwGfEF\nAMBkxBcAAJMRXwAATEZ8AQAwGfEFAMBkxBcAAJMRXwAATEZ8AQAwGfEFAMBkxBcAAJMRXwAATEZ8\nAQAwGfEFAMBkxBcAAJMRXwAATEZ8AQAwGfEFAMBkxBcAAJMRXwAATEZ8AQAwGfEFAMBkxBcAAJMR\nXwAATEZ8AQAwGfEFAMBkxBcAAJMRXwAATEZ8AQAwGfEFAMBkxBcAAJMRXwAATEZ8AQAwGfEFAMBk\nxBcAAJMRXwAATEZ8AQAwGfEFAMBkxBcAAJMRXwAATEZ8AQAwGfEFAMBkxBcAAJMRXwAATEZ8AQAw\nGfEFAMBkxBcAAJMRXwAATEZ8AQAwGfEFAMBkxBcAAJMRXwAATPb/Ac4DIxKa40GpAAAAAElFTkSu\nQmCC\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x105821f10>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import networkx as nx\n",
    "%matplotlib inline\n",
    "\n",
    "results = %cypher MATCH p = (:Person)-[:LIKES]->(:Drink) RETURN p\n",
    "\n",
    "g = results.get_graph()\n",
    "\n",
    "nx.draw(g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[(u'1', {u'age': 20, 'labels': [u'Person'], u'name': u'Drew'}),\n",
       " (u'0', {u'age': 24, 'labels': [u'Person'], u'name': u'Nicole'}),\n",
       " (u'3', {u'calories': 0, 'labels': [u'Drink'], u'name': u'Coke Zero'}),\n",
       " (u'2', {u'calories': 9000, 'labels': [u'Drink'], u'name': u'Mountain Dew'})]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.nodes(data=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{u'0': 2, u'1': 1, u'2': 2, u'3': 1}"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nx.degree(g)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# igraph\n",
    "\n",
    "Cypher query results can be imported into `igraph` with `py2neo`. You'll need to install `igraph` with `pip install python-igraph`. Query results should be returned as edgelists, as `igraph` has a method for building an `igraph` object from a list of tuples representing edges between nodes."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   | person.name | drink.name  \n",
       "---+-------------+--------------\n",
       " 1 | Nicole      | Mountain Dew\n",
       " 2 | Nicole      | Coke Zero   \n",
       " 3 | Drew        | Mountain Dew"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Graph as PGraph\n",
    "from igraph import Graph as IGraph\n",
    "\n",
    "neo4j = PGraph()\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name, drink.name\n",
    "\"\"\"\n",
    "\n",
    "data = neo4j.cypher.execute(query)\n",
    "data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<igraph.Graph at 0x107ad1a00>"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ig = IGraph.TupleList(data)\n",
    "\n",
    "ig"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[u'Nicole', u'Mountain Dew']"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "best = ig.vs.select(_degree = ig.maxdegree())[\"name\"]\n",
    "best"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true,
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## graph3d\n",
    "\n",
    "`graph3d`, originally named `igraph` but which I've renamed to avoid conflicts with the other `igraph`, will plot tuple lists as 3D graphs."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-a1a10255-8634-450d-bc16-200df763c9d9\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {igraph: ['nbextensions/igraph.min', 'https://rawgit.com/patrickfuller/igraph/master/js/build/igraph.min']}});\n",
       "           require(['igraph'], function () {\n",
       "               var $d = $('#graph-a1a10255-8634-450d-bc16-200df763c9d9');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.igraph = jQuery.extend({}, igraph);\n",
       "               $d.igraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true});\n",
       "               $d.igraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 1, \"target\": 2 },\n",
       "        { \"source\": 2, \"target\": 3 },\n",
       "        { \"source\": 3, \"target\": 4 },\n",
       "        { \"source\": 4, \"target\": 1 },\n",
       "        { \"source\": 4, \"target\": 5 },\n",
       "        { \"source\": 5, \"target\": 2 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"1\": { \"location\": [ -1.956, -2.000, -2.000 ] },\n",
       "        \"2\": { \"location\": [ -1.000, -1.175, -1.268 ] },\n",
       "        \"3\": { \"location\": [ 0.183, 0.231, 0.108 ] },\n",
       "        \"4\": { \"location\": [ 0.520, 1.019, 1.018 ] },\n",
       "        \"5\": { \"location\": [ 2.000, 2.000, 2.000 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.igraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import graph3d\n",
    "\n",
    "graph3d.draw([(1, 2), (2, 3), (3, 4), (4, 1), (4, 5), (5, 2)])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "We can visualize our Neo4j data by pulling out an edgelist with a Cypher query."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-39a43aee-6867-4bb0-bb03-b8982ad8a68e\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {igraph: ['nbextensions/igraph.min', 'https://rawgit.com/patrickfuller/igraph/master/js/build/igraph.min']}});\n",
       "           require(['igraph'], function () {\n",
       "               var $d = $('#graph-39a43aee-6867-4bb0-bb03-b8982ad8a68e');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.igraph = jQuery.extend({}, igraph);\n",
       "               $d.igraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true});\n",
       "               $d.igraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 0, \"target\": 2 },\n",
       "        { \"source\": 0, \"target\": 3 },\n",
       "        { \"source\": 1, \"target\": 2 },\n",
       "        { \"source\": 4, \"target\": 3 },\n",
       "        { \"source\": 5, \"target\": 2 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"0\": { \"location\": [ -2.000, -2.000, -2.000 ] },\n",
       "        \"1\": { \"location\": [ -1.884, -1.821, -1.799 ] },\n",
       "        \"2\": { \"location\": [ -0.470, 0.005, -0.249 ] },\n",
       "        \"3\": { \"location\": [ 0.581, 0.394, 0.854 ] },\n",
       "        \"4\": { \"location\": [ 2.000, 1.587, 1.677 ] },\n",
       "        \"5\": { \"location\": [ 2.000, 2.000, 2.000 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.igraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "from py2neo import Graph\n",
    "\n",
    "graph = Graph()\n",
    "\n",
    "data = graph.cypher.execute(\"MATCH (n)-->(m) RETURN ID(n), ID(m)\")\n",
    "data = [tuple(x) for x in data]\n",
    "\n",
    "graph3d.draw(data)"
   ]
  }
 ],
 "metadata": {
  "celltoolbar": "Slideshow",
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
