{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# Hello World\n",
    "\n",
    "This notebook walks through basic code examples for integrating various packages with Neo4j, including `py2neo`, `ipython-cypher`, `pandas`, `networkx`, `igraph`, and `graph3d`."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# py2neo\n",
    "\n",
    "`py2neo` is one of Neo4j's Python drivers. It offers a fully-featured interface for interacting with your data in Neo4j. Install `py2neo` with `pip install py2neo`.\n",
    "\n",
    "## Connect\n",
    "\n",
    "Connect to Neo4j with the `Graph` class."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "from scripts.vis import draw\n",
    "\n",
    "graph = Graph()\n",
    "\n",
    "graph.delete_all()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Nodes\n",
    "\n",
    "Create nodes with the `Node` class. The first argument is the node's label. The remaining arguments are an arbitrary amount of node properties or key-value pairs."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph-1232834e-3dbd-47e4-810a-07b8bb48d072.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x10d65bf90>"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Node\n",
    "\n",
    "nicole = Node(\"Person\", name=\"Nicole\", age=24)\n",
    "drew = Node(\"Person\", name=\"Drew\", age=20)\n",
    "\n",
    "mtdew = Node(\"Drink\", name=\"Mountain Dew\", calories=9000)\n",
    "cokezero = Node(\"Drink\", name=\"Coke Zero\", calories=0)\n",
    "\n",
    "coke = Node(\"Manufacturer\", name=\"Coca Cola\")\n",
    "pepsi = Node(\"Manufacturer\", name=\"Pepsi\")\n",
    "\n",
    "graph.create(nicole, drew, mtdew, cokezero, coke, pepsi)\n",
    "\n",
    "options = {\"Person\": \"name\", \"Drink\": \"name\", \"Manufacturer\": \"name\"}\n",
    "\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "skip"
    }
   },
   "source": [
    "P.S. - If you want to check out what's going on behind the scenes for the `draw()` function used above, take a look at [`scripts/vis.py`](https://github.com/nicolewhite/neo4j-jupyter/blob/master/scripts/vis.py)."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Relationships\n",
    "\n",
    "Create relationships between nodes with the `Relationship` class."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph-97db0d29-e22f-40d6-a75b-8cea9d0afbe7.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x10d5fd210>"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Relationship\n",
    "\n",
    "graph.create(Relationship(nicole, \"LIKES\", cokezero))\n",
    "graph.create(Relationship(nicole, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(drew, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(coke, \"MAKES\", cokezero))\n",
    "graph.create(Relationship(pepsi, \"MAKES\", mtdew))\n",
    "\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Cypher\n",
    "\n",
    "Retrieve Cypher query results with `Graph.cypher.execute`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   | name   | drink       \n",
       "---+--------+--------------\n",
       " 1 | Nicole | Mountain Dew\n",
       " 2 | Nicole | Coke Zero   \n",
       " 3 | Drew   | Mountain Dew"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name AS name, drink.name AS drink\n",
    "\"\"\"\n",
    "\n",
    "data = graph.cypher.execute(query)\n",
    "\n",
    "data"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "source": [
    "Rows can be accessed by index."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       " name   | drink       \n",
       "--------+--------------\n",
       " Nicole | Mountain Dew"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "data[0]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "source": [
    "Columns can be accessed by key or attribute."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Nicole likes to drink Mountain Dew.\n",
      "Nicole likes to drink Coke Zero.\n",
      "Drew likes to drink Mountain Dew.\n"
     ]
    }
   ],
   "source": [
    "for row in data:\n",
    "    print \"{0} likes to drink {1}.\".format(row[\"name\"], row.drink)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Parameterized Cypher\n",
    "\n",
    "Pass parameters to Cypher queries by passing additional key-value arguments to `Graph.cypher.execute.` Parameters in Cypher are named and are wrapped in curly braces."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   | name   | avg_calories\n",
       "---+--------+--------------\n",
       " 1 | Nicole |       4500.0"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p:Person)-[:LIKES]->(drink:Drink)\n",
    "WHERE p.name = {name}\n",
    "RETURN p.name AS name, AVG(drink.calories) AS avg_calories\n",
    "\"\"\"\n",
    "\n",
    "data = graph.cypher.execute(query, name=\"Nicole\")\n",
    "\n",
    "data"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# ipython-cypher\n",
    "\n",
    "`ipython-cypher` exposes `%cypher` magic in Jupyter. Install `ipython-cypher` with `pip install ipython-cypher`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "collapsed": true,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Cypher\n",
    "\n",
    "`%cypher` is intended for one-line Cypher queries and `%%cypher` is intended for multi-line Cypher queries. Placing `%%cypher` above a Cypher query will display that query's results."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>person.name</th>\n",
       "        <th>drink.name</th>\n",
       "        <th>drink.calories</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Coke Zero</td>\n",
       "        <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Drew</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[u'Nicole', u'Mountain Dew', 9000],\n",
       " [u'Nicole', u'Coke Zero', 0],\n",
       " [u'Drew', u'Mountain Dew', 9000]]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name, drink.name, drink.calories"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Pandas Data Frames\n",
    "\n",
    "Cypher query results can be coerced to `pandas` data frames with the `get_dataframe` method. To assign Cypher query results to a variable, you need to use `%cypher` and separate lines with \\\\. You'll first need to install `pandas` with `pip install pandas`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Coke Zero</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Drew</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name         drink\n",
       "0  Nicole  Mountain Dew\n",
       "1  Nicole     Coke Zero\n",
       "2    Drew  Mountain Dew"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = %cypher MATCH (person:Person)-[:LIKES]->(drink:Drink) \\\n",
    "                  RETURN person.name AS name, drink.name AS drink\n",
    "    \n",
    "df = results.get_dataframe()\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Int64Index([0, 1, 2], dtype='int64')"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.index"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Coke Zero</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name      drink\n",
       "1  Nicole  Coke Zero"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.iloc[[1]]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0    Nicole\n",
       "1    Nicole\n",
       "2      Drew\n",
       "Name: name, dtype: object"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df[\"name\"]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# NetworkX Graphs\n",
    "\n",
    "Cypher query results can be coerced to `NetworkX` MultiDiGraphs, graphs that permit multiple edges between nodes, with the `get_graph` method. You'll first need to install `NetworkX` with `pip install networkx`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAeAAAAFBCAYAAACvlHzeAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAIABJREFUeJzt3WtYlWXe/vETEJCNoCBmam4yN381ZecGBbS00qNmxjRZ\nK0Ets0CbajIL5zk6HBzLyXqmcptolIkJWGJustxPamkZkhVaapYmjkpYaGWAwv9F6aNhKrBY19p8\nP+/gXvdapy/q5Lrue/1uj8rKykoBAAC78jQdAAAAd0QBAwBgAAUMAIABFDAAAAZQwAAAGEABAwBg\nAAUMAIABFDAAAAZQwAAAGEABAwBgAAUMAIABFDAAAAZQwAAAGEABAwBgAAUMAIABFDAAAAZQwAAA\nGEABAwBgAAUMAIABFDAAAAZQwAAAGEABAwBgAAUMAIABFDAAAAZQwAAAGEABAwBgAAUMAIABFDAA\nAAZQwAAAGEABAwBgAAUMAIABFDAAAAZQwAAAGEABAwBgAAUMAIABFDAAAAZQwAAAGEABAwBgAAUM\nAIABFDAAAAbUMx3AFZWUlKi4uFiSFBoaquDgYMOJAACOhhWwjZSWliorK0tx4eFqHham/t26qX+3\nbmoeFqa48HBlZWWprKzMdEwAgIPwqKysrDQdwtnlZGfrkeRk3VhZqXGnTulP+r+thXJJKyXNCQzU\n556emp6eLovVai4sAMAhUMC1NOP55/W/Tz6pZadPK+oKr82TdKe/vyZMmaKHx4+3RzwAgIOigGsh\nJztbj48era2nT6vlVZ5zSFKsv7+ey8hgJQwAbowCrqHS0lK1atJEq0+eVGQ1z82TdHtQkA4VFcnH\nx6cu4gEAHBw3YdVQbm6uulRUVLt8JSlKUueKCuXm5to6FgDASbACrqG48HA9umuXhtTw/KWSpoeH\na3N+vi1jAQCcBAVcAyUlJWoeFqYfystr/EXqckmNvL1VWFTE94QBwA2xBV0DxcXFCvP1rdUUE29J\njX18dOLECVvFAgA4EQoYAAADKOAaCA0NVVFpqcpr8R7lkr4rK1NISIitYgEAnAgFXAPBwcGK6NRJ\nK2vxHiskRXbuzPVfAHBTFHANjUtN1ZzAwBqfP6dBA41LTbVhIgCAM+Eu6Bqq7SCOgQEBKjxxgkEc\nAOCmWAHXkK+vr6anp2uwn58OVeO8Q5L+7Ourci8vTZs2TWfPnq2riAAAB0YB14LFatWEp55SrJ+f\n8q7i9Xn6dQ506tSpKti9Wxs3btSAAQN05MiRuo4KAHAwFHAtPTx+vJ575RXdHhSkAYGBypV05oLj\n5fp16lWMl5duDwrScxkZenj8eDVv3lzr16/XzTffrMjISL399ttm/gEAACO4BmwjZWVlys3N1Zxp\n07SzoECNf7u2+11ZmSI6ddLnBw9q06ZNCg8Pr3Luli1blJiYqGHDhulf//oX14UBwA1QwHWgpKTk\n/ISrkJAQBQcH68knn9SpU6c0ffr0S55TXFys++67T4cPH1Z2drZuuOEGe0YGANgZBWwnBw8eVGRk\npL799lv5+/tf8jWVlZWaPXu2Jk+erOnTp2v48OF2TgkAsBcK2I7uuOMODR06VPfee+9lX/fJJ5/I\nYrGoT58+mjlzpgICAuyUEABgL9yEZUcpKSmaO3fuFV8XHh6uvLw8VVRUKCoqSrt27bJDOgCAPVHA\ndjRo0CD997//Vf5VPAM4MDBQCxYs0JNPPqkBAwZo9uzZYrMCAFwHW9B2NmXKFBUWFl7VSvicffv2\nyWq1qmXLlsrIyOABDgDgAlgB29l9992nnJwcnTp16qrPadeunT744AO1adNGERER2rp1ax0mBADY\ng1daWlqa6RDupEGDBvroo490+vRpRUdHX/V59erV02233ab27dsrKSlJv/zyi/r06SNPT/6GAgBn\nxBa0AWvXrtUTTzyh/Px8eXh4VPv8wsJCJSUlycPDQ4sWLVKzZs3qICUAoC6xfDJgwIABOnXqlD76\n6KManX9ujOVNN92kqKgorV692sYJAQB1jRWwIc8++6z27NmjV199tVbvwxhLAHBOFLAhx48fV/v2\n7fX111+rUaNGtXqvc2MsCwsLlZWVxRhLAHACbEEb0qRJEw0aNEiZmZm1fq/Q0FAtW7ZMo0aNUkxM\njBYvXmyDhACAusQK2KD33ntPY8eOVUFBQY1uxroUxlgCgHNgBWxQfHy8Kisrbfq9XsZYAoBz4HvA\nBnl4eOjMmTNasWKFhg4darP39fHx0eDBg9WwYUMlJiYqICBA3bt3t9kqGwBQe2xBG3bixAldf/31\n2r9/vxo3bmzz92eMJQA4JragDQsJCdHgwYO1YMGCOnn/c2MsW7duzRhLAHAgrIAdwLZt2zRy5Eh9\n+eWXdTpactWqVRozZoz++te/6u9//7u8vLzq7LMAAJfHCtgB9OrVS/7+/tq4cWOdfs4dd9yhvLw8\nrV+/XrfccouOHDlSp58HAPhjFLAD8PDwUEpKSrUeUVhTzZs314YNG9SvXz/GWAKAQWxBO4iTJ0+q\nVatW2r17t6699lq7fObmzZuVlJTEGEsAMIAVsIMICgrSsGHD9Morr9jtM+Pj45Wfn6/9+/erT58+\n2r9/v90+GwDcHQXsQJKTkzVv3jydPXvWbp8ZGhqqt956SyNHjlRMTIyysrLs9tkA4M4oYAcSFRWl\na665RmvWrLHr53p4eOihhx7S2rVrlZaWptGjR+unn36yawYAcDcUsINJTk62y81YlxIREXF+jGV0\ndDRjLAGgDnETloP56aefdN111+mTTz5Ry5YtjeVYtGiRHn30UU2ePFljx45ljCUA2BgF7IAeeugh\nNWrUSP/85z+N5jg3xrJVq1Z6+eWXGWMJADbEFrQDSk5OVkZGhsrLy43mODfGslWrVoqIiND7779v\nNA8AuBIK2AF16dJFbdq00apVq0xHka+vr1544QXNnj1bQ4cO1dNPP23Xu7QBwFWxBe2gFi1apMzM\nTLvfEX05hYWFSkxMlJeXlzIzM9WsWTPTkQDAabECdlB33XWXdu7cqQMHDpiOct65MZZ9+/ZVVFSU\n3nnnHdORAMBpsQJ2YI899pi8vb31zDPPmI5SxbkxlgkJCZo6dSpjLAGgmihgB/bll18qPj5ehw4d\nkq+vr+k4VRQXF2v06NE6cuSIsrOz1bZtW9ORAMBpsAXtwDp06KAuXbpo2bJlpqNc0oVjLHv16sUY\nSwCoBlbADu6NN97QnDlztGnTJtNRLis/P19Wq1V9+vTRzJkzFRAQYDoSADg0VsAO7i9/+Yv27Nmj\nL774wnSUy2KMJQBUj1daWlqa6RD4Y15eXjpx4oS2b9+ugQMHmo5zWT4+Pho8eLCCg4OVmJiowMBA\nRUdHM8YSAC6BLWgn8PXXX6t79+769ttv5efnZzrOVdm7d6+sVqtat27NGEsAuAS2oJ1AmzZt1L17\nd73xxhumo1y19u3ba9u2bYyxBIA/QAE7iZSUFGOPKaypc2MsZ82axRhLAPgdtqCdxJkzZ9S6dWut\nXr1aXbt2NR2n2g4fPqzExETVq1ePMZYAIFbATqNevXq6//77lZ6ebjpKjbRo0UIbN25UfHw8YywB\nQKyAncrhw4fVtWtXHTp0SIGBgabj1BhjLAGAFbBTadGiheLj451+4lR8fLzy8/O1b98+9enTR199\n9ZXpSABgdxSwk0lJSXHabegLXTjGMiYmxun/qACA6mIL2slUVFSobdu2euONNxQdHW06jk2cG2MZ\nGxurGTNmMMYSgFtgBexkPD099cADDzjdV5Iu59wYy7Nnzyo6Olqffvqp6UgAUOdYATuhY8eOqWPH\njvrmm28UHBxsOo5NZWZmavz48Zo8ebLGjh3LGEsALosCdlIWi0Xx8fF68MEHTUexuQvHWGZkZKhR\no0amIwGAzbEF7aSSk5M1d+5cueLfT4yxBOAOKGAnddNNN6msrEwffPCB6Sh14twYy5kzZ2ro0KGa\nOnUqYywBuBS2oJ3Y888/r08++UQLFy40HaVOXTjGctGiRbr22mtNRwKAWmMF7MRGjRqlFStWqLi4\n2HSUOnXhGMvIyEjGWAJwCV5paWlppkOgZvz9/VVQUKBjx44pJibGdJw65enpqX79+qlHjx4aPXq0\njhw5on79+snLy8t0NACoEVbATu7cZCx3uZJwbozll19+qdjYWB04cMB0JACoEQrYyfXu3Vs+Pj76\nz3/+YzqK3YSGhmr58uVKSkpSr169GGMJwClxE5YLmDVrlrZs2aKcnBzTUewuPz9fFotFcXFxjLEE\n4FRYAbuAESNGaO3atTp27JjpKHZ3bozlmTNnGGMJwKlwE5YLqF+/vvbv369Dhw4pNjbWdBy78/X1\n1Z133qmgoCAlJiYqMDBQ0dHRjLEE4NDYgnYRO3bsUEJCgr766it5errvxgZjLAE4C/f9P7WLiY6O\nVkhIiNauXWs6ilHnxli2bNmSMZYAHBpb0C7Cw8NDnp6eevnll/XZZ59Jktq2bWs4lRn16tXTwIED\n1bZtWyUlJamsrEy9e/d2650BAI6HLWgX8fHHH+uJJ57Qpk2bJEmDBg3S6tWrDacyjzGWABwVSwIX\n4eHhcb58Jendd9/VN998Yy6Qg2CMJQBHRQG7iKioKEVFRZ3/ubKyUvPnzzeYyHF4eXnpH//4h3Jy\ncpScnKzHH39cZWVlpmMBcHMUsAtJSUm56OeMjAyK5gKMsQTgSChgF2K1WhUUFHT+52PHjmn58uUG\nEzme34+xzM7ONh0JgJuigF1IYGCgkpKSLvpdenq6oTSOy8PDQw8//LDWrFmjSZMmacyYMfrpp59M\nxwLgZihgF5OcnHzRzxs2bNDevXsNpXFs58ZYlpeXq3v37ue/vgUA9kABu5iuXbuqd+/eF/1u3rx5\nhtI4vgYNGui1117TxIkTdfPNN+ull17S999/r2HDhnGNGECd4nvALmjhwoUaNWrU+Z9DQ0N1+PBh\n1a9f32Aqx7d3715ZLBYVFRWpsLBQQUFBmjdvniwWi+loAFwQK2AXNGzYsItmIBcXF2vp0qUGEzmH\n9u3ba8yYMSosLJQknTx5UlarVffff79+/vlnw+kAuBoK2AX5+fnpnnvuueh3c+fONRPGyWzdurXK\n715++WWuEQOwOQrYRf3+ZqytW7eqoKDAUBrnsXjxYs2YMUM+Pj4X/X737t3q0aOH0tPTxVUbALZA\nAbuoDh06qF+/fhf9jq8kXZmHh4ceeughbd++Xe3bt7/o2C+//KKUlBQNGzZMP/zwg6GEAFwFBezC\nfj8Za+HChVzLvErnvqJ04c1s5yxdulTh4eHatm2bgWQAXAUF7MLuvPNOhYWFnf+5pKREr776qg4c\nOKADBw6opKTEYDrHFxgYqAULFigzM1OBgYEXHTt48KDi4uL0zDPPqKKiwlBCAM6MryG5uIkTJ2ra\ntGmSpAaSyjw8dG1AgCSpqLRUEZ06aVxqqoYOHVrluif+z759+2S1WrVz584qxwYMGKDMzEw1bdrU\nQDIAzooVsItr1qyZ/CT1lPSapB8rK/X1jz/q6x9/1Pfl5Xp01y5lPPCAWoaFKYe5yH+oXbt2+uCD\nD/S3v/2tyrH169erW7duWrNmjYFkAJwVK2AXNuP55/W/Tz6pZadPK+oKr82TdKe/vyZMmaKHx4+3\nRzyntWrVKt1zzz0qLi6ucuyJJ57QU089JW9vbwPJADgTCthF5WRn6/HRo7X19Gm1vMpzDkmK9ffX\ncxkZslitdRnP6RUWFioxMVHvvfdelWM9e/ZUVlaW2rRpYyAZAGdBAbug0tJStWrSRKtPnlRkNc/N\nk3R7UJAOFRVxTfgKzp49q6efflqTJ0+uciNWUFCQ5s+fr4SEBEPpADg6rgG7oNzcXHWpqKh2+UpS\nlKTOFRXKzc21dSyX4+XlpUmTJmnTpk1q0aLFRcdOnjwpi8WiBx54gK9+AbgkVsAuKC48XI/u2qUh\nNTx/qaTp4eHanJ9vy1gurbi4WKNHj9aKFSuqHOvUqZNycnLUpUsXA8kAOCoK2MWUlJSoeViYfigv\nV70avke5pEbe3iosKlJwcLAt47m0yspKzZo1SxMmTFBZWdlFx+rXr68XX3xRDzzwgDw8PAwlBOBI\n2IJ2McXFxQrz9a1x+UqSt6TGPj46ceKErWK5hasZY5mQkMAYSwCSKGDA5i43xvLNN99UeHi4tm/f\nbiAZAEdCAbuY0NBQFZWWqrwW71Eu6buyMoWEhNgqlts5N8Zy4cKFCvht8tg5Bw8eVGxsrKZNm8YY\nS8CNUcAuJjg4WBGdOmllLd5jhaTIzp25/msDI0aM0M6dOxUREXHR78+ePauJEydq4MCBOnr06B+e\nX1JSwuxuwEVRwC5oXGqq5vzu4QHVMadBA41LTbVhIvfWvn17bdu27ZJjLNetW1dljGVpaamysrIU\nFx6u5mFh6t+tm/p366bmYWGKCw9XVlZWlZu8ADgf7oJ2QQzicFwrV67Uvffe+4djLLt27arHxo3T\njZWVGnfqlP4knb+hrlzSSklzAgP1uaenpqenM7EMcGIUsItiFKXjOnz4sBITE7V58+aLfu8lKcTT\nU+9UVDC7G3ADXmlpaWmmQ8D2unTpIi8/P43ZskXxZ86o2RVenyfptt/+h37f/ffbI6LbCgoK0siR\nI+Xl5aXNmzfr3N/AIZLyKiv1/67iPZpJGlperjFbt6pZ27YM+QCcECtgF5eTna1HkpPVpaJC4378\nUX/WxVuaK/TrNd8CDw+2NA3YvHmzhg8frhOFhdoqcckAcCPchOXiLFarDhUVacz8+XoxPFwNvb3V\nOiBArQMC1MjbW9PDw3X/vHk6VFRE+RoQHx+vSZMmKcLLi9ndgJthBexmSkpKzk+4CgkJ4atGDoDZ\n3YB7ooABg5jdDbgvtqABg5jdDbgvChgAAAMoYMAgZncD7osCBgxidjfgvihgwLDazu6eJql5x448\nWQlwMtwFDRhW29ndcZJOS7r11luVmZmpJk2a2D4kAJtjBQwY5uvrq+np6Rrs56dD1TjvkKTb9Gv5\nStLatWvVrVs3bdq0yfYhAdgcBQw4AIvVqglPPaVYPz/lXcXr8yTF+PqqzM/vot8fPXpU/fv3V1pa\nms6ePVsnWQHYBgUMOIiHx4/Xc6+8otuDgjQgMFC5ks5ccLxcv0696t+ggW4PCtLzCxZo9969io2N\nveh9KisrNXnyZA0YMEBHjhyx478AQHVwDRhwMGVlZcrNzdWcadO0s6BAjX97yMJ3ZWWK7NxZ41JT\nNWTIkPMPXzhz5ozS0tI0depU/f4/57CwMGVmZuq2226z+78DwOVRwIADq87s7nXr1ikpKUnHjx+v\nciw1NVVTpkyRt7d3nWUFUD0UMOBCjh49qqSkJG3YsKHKsZiYGGVnZ6tly5YGkgH4Pa4BAy6kadOm\nWrNmjaZMmSJPz4v/8962bZvCw8O1fPlyQ+kAXIgVMOCiNm/erLvvvvuSN2I98sgjmjZtmnx9fQ0k\nAyBRwIBLKyoq0qhRo/TOO+9UORYVFaWcnBy1bdvWQDIAbEEDLiwsLEyrVq3Sc889p3r1Ln7oYV5e\nniIiIrRkyRJD6QD3xgoYcBPbt2+X1WrVwYMHqxxLTk7WCy+8IL/fDfYAUHcoYMCNfP/997rvvvu0\nbNmyKsduvPFGLVmyRB07djSQDHA/bEEDbqRRo0ZaunSpZs6ceX6QxzmfffaZoqKitHDhQkPpAPfC\nChhwUzt37pTFYtH+/furHBs1apRmzZqlwFo8JhHA5VHAgBs7efKkkpOTlZ2dXeVYx44dlZOTo65d\nuxpIBrg+tqABNxYUFKTFixdr/vz5ql+//kXHvvjiC/Xs2VPz5s2rMmMaQO2xAgYgSfr888+VkJCg\nPXv2VDlmtVqVnp6uoKAgA8kA18QKGIAkqUuXLtqxY4fuvffeKseys7MVGRmpvLyreVoxgKtBAQM4\nLyAgQK+88ooWLlyogICAi4599dVXiomJ0YwZM9iSBmyALWgAl/Tll18qISFBn376aZVjgwcPVkZG\nhkJCQgwkA1wDK2AAl9ShQwdt375dY8eOrXJs06ZNKikpMZAKcB0UMIA/5Ofnpzlz5mjJkiUX3YAV\nGhqqiooKg8kA58cWNICrcuDAAVksFvXo0UMdOnTQlClTNHv2bCUkJJiOBjglChjAVSsrK1NlZaV8\nfX318ccfy2q16pZbbtHzzz/PgxyAamILGsBV8/Hxka+vryQpOjpaeXl5OnHihHr16qUvvvjCcDrA\nuVDAAGosODhY2dnZevDBBxUXF6fMzEzTkQCnwRY0AJv49NNPZbFY1KtXL82aNavK94gBXIwVMACb\n6Nq1q3bs2KHKykpFR0frs88+Mx0JcGgUMACbCQwM1IIFCzRx4kTdfPPNmj9/PlOzgD/AFjSAOvHF\nF18oISFBnTt35kEOwCWwAgZQJzp27KgPP/xQwcHBPMgBuAQKGECd8fPz09y5c/X0009r4MCBPMgB\nuABb0ADsYv/+/bJarbruuut4kAMgVsAA7OSGG27Q+++/r1atWikyMlLbt283HQkwihUwALt76623\nlJycrAkTJuixxx6TpydrAbgfChiAEQcPHtTdd9+thg0b6rXXXlNYWJjpSIBd8WcnACNatWql9957\nT127dlVkZKTee+8905EAu2IFDMC4d999V/fee6/GjRun//mf/5GXl5fpSECdo4ABOIQjR45o+PDh\n8vLy0qJFi3TttdeajgTUKbagATiEZs2aacOGDYqLi1NUVJTWrVtnOhJQp1gBA3A4Gzdu1IgRI3TP\nPfdo8uTJqlevnulIgM1RwAAc0vHjxzVixAj99NNPysrK0nXXXWc6EmBTbEEDcEhNmjTRO++8ozvu\nuEPR0dFauXKl6UiATbECBuDw3n//fd19992666679Mwzz8jHx8d0JKDWWAEDcHh9+vRRfn6+9u/f\nr9jYWH399demIwG1RgEDcAqhoaFavny5hg8frp49e+rNN980HQmoFbagATidHTt2yGKxaNCgQfr3\nv/+t+vXrm44EVBsrYABOp3v37srPz9fx48fVq1cv7d2713QkoNooYABOKTg4WEuWLFFKSor69Omj\n119/3XQkoFrYggbg9Hbt2qWEhATFxsZqxowZCggIMB0JuCJWwACcXrdu3ZSXl6eysjL16NFDBQUF\npiMBV0QBA3AJgYGBWrhwoR5//HH169dPGRkZYoMPjowtaAAuZ/fu3bJYLOratavmzp2rBg0amI4E\nVMEKGIDL6dSpkz788EMFBAQoKipK+fn5piMBVVDAAFySv7+/5s2bp8mTJ+vWW2/V7Nmz2ZKGQ2EL\nGoDL27dvnywWi9q0aaOMjAw1bNjQdCSAFTAA19euXTtt27ZNzZs3V0REhD788EPTkQBWwADcS25u\nrlJSUpSamqpHH31Unp6sQ2AGBQzA7XzzzTeyWq1q3LixFixYoMaNG5uOBDfEn34A3E7r1q21ZcsW\nderUSREREdqyZYvpSHBDrIABuLXVq1dr9OjReuihhzRx4kR5eXmZjgQ3QQEDcHuHDx/W8OHD5evr\nq8zMTDVt2tR0JLgBtqABuL0WLVpo48aNiomJUWRkpNavX286EtwAK2AAuMCGDRs0cuRIjR49Wv/4\nxz9Ur14905HgoihgAPidY8eOKSkpSaWlpVq8eLFatGhhOhJcEFvQAPA711xzjdasWaOBAwcqOjpa\nb7/9tulIcEGsgAHgMrZs2aLExERZLBZNnTpV3t7epiPBRbACBoDLiIuL086dO7Vnzx7FxcXpm2++\nMR0JLoICBoAraNy4sVauXKmEhAT16NFDubm5piPBBbAFDQDV8OGHH8pqteqOO+7Qc889p/r165uO\nBCfFChgAqqFnz57Kz8/XkSNH1Lt3b+3bt890JDgpChgAqqlhw4Z68803NWbMGPXu3VtZWVmmI8EJ\nsQUNALWQn58vi8Wivn37avr06fL39zcdCU6CFTAA1EJERITy8vL0888/q0ePHtq9e7fpSHASFDAA\n1FKDBg20aNEijR8/Xn379tWrr74qNhdxJWxBA4ANFRQUKCEhQZGRkZozZ44aNGhgOhIcFCtgALCh\nzp07a8eOHfL19VV0dLQ++eQT05HgoChgALAxf39/vfzyy5o0aZJuueUWvfTSS2xJowq2oAGgDu3d\nu1cWi0Xt2rXT/PnzFRwcbDoSHAQrYACoQ+3bt9e2bdvUpEkTRUZGaseOHaYjwUFQwABQx+rXr69Z\ns2bp2Wef1e23364XXniBLWmwBQ0A9nTgwAFZrVY1bdpUr776qkJDQ01HgiGsgAHAjq6//npt3bpV\n7dq1U0REhN5//33TkWAIK2AAMGTVqlUaM2aMHnnkEaWmpsrTkzWRO6GAAcCgb7/9VsOHD5e/v78W\nLlyoa665xnQk2Al/bgGAQdddd502bdqk7t27KzIyUhs3bjQdCXbCChgAHMS6des0atQo3X///Zo0\naZK8vLxMR0IdooABwIEcPXpUiYmJOnv2rF5//XU1b97cdCTUEbagAcCBNG3aVGvXrtWAAQMUFRWl\nd99913Qk1BFWwADgoDZv3qzExEQlJiZqypQp8vb2Nh0JNsQKGAAcVHx8vHbu3KlPP/1Uffv21cGD\nB01Hgg1RwADgwMLCwrRq1SoNGTJEPXr00PLly01Hgo2wBQ0ATmL79u2yWq0aPHiwpk2bJl9fX9OR\nUAusgAHASfTq1Uv5+fk6ePCgevfurf3791/xnJKSEh04cEAHDhxQSUmJHVLialHAAOBEGjVqpNzc\nXN1zzz2KiYlRTk5OldeUlpYqKytLceHhah4Wpv7duql/t25qHhamuPBwZWVlqayszEB6XIgtaABw\nUnl5ebJYLOrfv79efPFF+fn5KSc7W48kJ+vGykqNO3VKf5JU77fXl0taKWlOYKA+9/TU9PR0WaxW\nc/8AN0cBA4ATO3nypJKTk1VQUKA/DRqkzJkztez0aUVd4bw8SXf6+2vClCl6ePx4e0TF71DAAODk\nKisrlZKcrNz585UnqeVVnndIUqy/v57LyGAlbAAFDABOrrS0VK2aNNHqkycVWc1z8yTdHhSkQ0VF\n8vHxqYuY8wscAAACZklEQVR4+APchAUATi43N1ddKiqqXb6SFCWpc0WFcnNzbR0LV8AKGACcXFx4\nuB7dtUtDanj+UknTw8O1OT/flrFwBRQwADixkpISNQ8L0w/l5efvdq6uckmNvL1VWFSk4OBgW8bD\nZbAFDQBOrLi4WGG+vjUuX0nyltTYx0cnTpywVSxcBQoYAAADKGAAcGKhoaEqKi1VeS3eo1zSd2Vl\nCgkJsVUsXAUKGACcWHBwsCI6ddLKWrzHCkmRnTtz/dfOKGAAcHLjUlM1JzCwxufPadBA41JTbZgI\nV4O7oAHAyTGIwzmxAgYAJ+fr66vp6eka7OenQ9U475B+nQc9PT2d8jWAAgYAF2CxWjXhqacU6+en\nvKt4fZ5+nQM9YcoU5kAbwhY0ALiQc48j7FJRoXE//qg/6+LHEa7Qr9d8Czw8eByhYRQwALiYsrIy\n5ebmas60adpZUKDGv20vf1dWpsjOnTUuNVVDhgxh29kwChgAXFhJScn5CVchISF81ciBUMAAABjA\nTVgAABhAAQMAYAAFDACAARQwAAAGUMAAABhAAQMAYAAFDACAARQwAAAGUMAAABhAAQMAYAAFDACA\nARQwAAAGUMAAABhAAQMAYAAFDACAARQwAAAGUMAAABhAAQMAYAAFDACAARQwAAAGUMAAABhAAQMA\nYAAFDACAARQwAAAGUMAAABhAAQMAYAAFDACAARQwAAAGUMAAABhAAQMAYAAFDACAARQwAAAGUMAA\nABhAAQMAYAAFDACAARQwAAAGUMAAABhAAQMAYAAFDACAARQwAAAGUMAAABhAAQMAYAAFDACAAf8f\nv7Sen/BbfCcAAAAASUVORK5CYII=\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x1109739d0>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import networkx as nx\n",
    "%matplotlib inline\n",
    "\n",
    "results = %cypher MATCH p = (:Person)-[:LIKES]->(:Drink) RETURN p\n",
    "\n",
    "g = results.get_graph()\n",
    "\n",
    "nx.draw(g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[(u'19', {u'calories': 9000, 'labels': [u'Drink'], u'name': u'Mountain Dew'}),\n",
       " (u'18', {u'age': 20, 'labels': [u'Person'], u'name': u'Drew'}),\n",
       " (u'20', {u'calories': 0, 'labels': [u'Drink'], u'name': u'Coke Zero'}),\n",
       " (u'6', {u'age': 24, 'labels': [u'Person'], u'name': u'Nicole'})]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.nodes(data=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{u'18': 1, u'19': 2, u'20': 1, u'6': 2}"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nx.degree(g)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# igraph\n",
    "\n",
    "Cypher query results can be imported into `igraph` with `py2neo`. You'll need to install `igraph` with `pip install python-igraph`. Query results should be returned as edgelists, as `igraph` has a method for building an `igraph` object from a list of tuples representing edges between nodes."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   | person.name | drink.name  \n",
       "---+-------------+--------------\n",
       " 1 | Nicole      | Mountain Dew\n",
       " 2 | Nicole      | Coke Zero   \n",
       " 3 | Drew        | Mountain Dew"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Graph as PGraph\n",
    "from igraph import Graph as IGraph\n",
    "\n",
    "neo4j = PGraph()\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name, drink.name\n",
    "\"\"\"\n",
    "\n",
    "data = neo4j.cypher.execute(query)\n",
    "data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<igraph.Graph at 0x10fce7de0>"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ig = IGraph.TupleList(data)\n",
    "\n",
    "ig"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[u'Nicole', u'Mountain Dew']"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "best = ig.vs.select(_degree = ig.maxdegree())[\"name\"]\n",
    "best"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true,
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## graph3d\n",
    "\n",
    "`graph3d`, originally named [`igraph`](https://github.com/patrickfuller/igraph) but which I've renamed to avoid conflicts with the other `igraph`, will plot tuple lists as 3D graphs."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-c748517c-5a53-4f18-87b2-a7c3d9ddc52f\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {igraph: ['nbextensions/igraph.min', 'https://rawgit.com/patrickfuller/igraph/master/js/build/igraph.min']}});\n",
       "           require(['igraph'], function () {\n",
       "               var $d = $('#graph-c748517c-5a53-4f18-87b2-a7c3d9ddc52f');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.igraph = jQuery.extend({}, igraph);\n",
       "               $d.igraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true});\n",
       "               $d.igraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 1, \"target\": 2 },\n",
       "        { \"source\": 2, \"target\": 3 },\n",
       "        { \"source\": 3, \"target\": 4 },\n",
       "        { \"source\": 4, \"target\": 1 },\n",
       "        { \"source\": 4, \"target\": 5 },\n",
       "        { \"source\": 5, \"target\": 2 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"1\": { \"location\": [ -2.000, -2.000, -2.000 ] },\n",
       "        \"2\": { \"location\": [ -1.089, -1.285, -1.233 ] },\n",
       "        \"3\": { \"location\": [ 0.204, 0.216, 0.420 ] },\n",
       "        \"4\": { \"location\": [ 0.880, 1.142, 1.366 ] },\n",
       "        \"5\": { \"location\": [ 2.000, 2.000, 2.000 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.igraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import graph3d\n",
    "\n",
    "graph3d.draw([(1, 2), (2, 3), (3, 4), (4, 1), (4, 5), (5, 2)])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "We can visualize our Neo4j data by pulling out an edgelist with a Cypher query."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-91b2b0a0-340e-4cb1-b0ef-d07a4a028cbf\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {igraph: ['nbextensions/igraph.min', 'https://rawgit.com/patrickfuller/igraph/master/js/build/igraph.min']}});\n",
       "           require(['igraph'], function () {\n",
       "               var $d = $('#graph-91b2b0a0-340e-4cb1-b0ef-d07a4a028cbf');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.igraph = jQuery.extend({}, igraph);\n",
       "               $d.igraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true});\n",
       "               $d.igraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 6, \"target\": 19 },\n",
       "        { \"source\": 6, \"target\": 20 },\n",
       "        { \"source\": 18, \"target\": 19 },\n",
       "        { \"source\": 21, \"target\": 20 },\n",
       "        { \"source\": 28, \"target\": 19 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"6\": { \"location\": [ -2.000, -2.000, -2.000 ] },\n",
       "        \"18\": { \"location\": [ -1.714, -2.000, -2.000 ] },\n",
       "        \"19\": { \"location\": [ -0.020, -0.487, -0.533 ] },\n",
       "        \"20\": { \"location\": [ 0.486, 0.818, 0.234 ] },\n",
       "        \"21\": { \"location\": [ 1.467, 1.987, 1.625 ] },\n",
       "        \"28\": { \"location\": [ 2.000, 2.000, 2.000 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.igraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "data = graph.cypher.execute(\"MATCH (n)-->(m) RETURN ID(n), ID(m)\")\n",
    "data = [tuple(x) for x in data]\n",
    "\n",
    "graph3d.draw(data)"
   ]
  }
 ],
 "metadata": {
  "celltoolbar": "Slideshow",
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
