{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# py2neo\n",
    "\n",
    "`py2neo` is one of Neo4j's Python drivers. It offers a fully-featured interface for interacting with your data in Neo4j. Install `py2neo` with `pip install py2neo`.\n",
    "\n",
    "## Connect\n",
    "\n",
    "Connect to Neo4j with the `Graph` class."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "from scripts.vis import draw\n",
    "\n",
    "graph = Graph()\n",
    "\n",
    "graph.delete_all()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Nodes\n",
    "\n",
    "Create nodes with the `Node` class. The first argument is the node's label. The remaining arguments are an arbitrary amount of node properties or key-value pairs."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph-6117838e-0108-4ed2-9db4-236f784dddd1.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x1117c9350>"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Node\n",
    "\n",
    "nicole = Node(\"Person\", name=\"Nicole\", age=24)\n",
    "drew = Node(\"Person\", name=\"Drew\", age=20)\n",
    "\n",
    "mtdew = Node(\"Drink\", name=\"Mountain Dew\", calories=9000)\n",
    "cokezero = Node(\"Drink\", name=\"Coke Zero\", calories=0)\n",
    "\n",
    "coke = Node(\"Manufacturer\", name=\"Coca Cola\")\n",
    "pepsi = Node(\"Manufacturer\", name=\"Pepsi\")\n",
    "\n",
    "graph.create(nicole, drew, mtdew, cokezero, coke, pepsi)\n",
    "\n",
    "options = {\"Person\": \"name\", \"Drink\": \"name\", \"Manufacturer\": \"name\"}\n",
    "\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Relationships\n",
    "\n",
    "Create relationships between nodes with the `Relationship` class."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph-6f0d40e7-55d8-41d2-a0d2-22baff511bd9.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x10fdcbed0>"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Relationship\n",
    "\n",
    "graph.create(Relationship(nicole, \"LIKES\", cokezero))\n",
    "graph.create(Relationship(nicole, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(drew, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(coke, \"MAKES\", cokezero))\n",
    "graph.create(Relationship(pepsi, \"MAKES\", mtdew))\n",
    "\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Cypher\n",
    "\n",
    "Retrieve Cypher query results with `Graph.cypher.execute`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   | name   | drink       \n",
       "---+--------+--------------\n",
       " 1 | Nicole | Mountain Dew\n",
       " 2 | Nicole | Coke Zero   \n",
       " 3 | Drew   | Mountain Dew"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name AS name, drink.name AS drink\n",
    "\"\"\"\n",
    "\n",
    "data = graph.cypher.execute(query)\n",
    "\n",
    "data"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "source": [
    "Rows can be accessed by index."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       " name   | drink       \n",
       "--------+--------------\n",
       " Nicole | Mountain Dew"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "data[0]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "source": [
    "Columns can be accessed by key or attribute."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Nicole likes to drink Mountain Dew.\n",
      "Nicole likes to drink Coke Zero.\n",
      "Drew likes to drink Mountain Dew.\n"
     ]
    }
   ],
   "source": [
    "for row in data:\n",
    "    print \"{0} likes to drink {1}.\".format(row[\"name\"], row.drink)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Parameterized Cypher\n",
    "\n",
    "Pass parameters to Cypher queries by passing additional key-value arguments to `Graph.cypher.execute.` Parameters in Cypher are named and are wrapped in curly braces."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   | name   | avg_calories\n",
       "---+--------+--------------\n",
       " 1 | Nicole |       4500.0"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p:Person)-[:LIKES]->(drink:Drink)\n",
    "WHERE p.name = {name}\n",
    "RETURN p.name AS name, AVG(drink.calories) AS avg_calories\n",
    "\"\"\"\n",
    "\n",
    "data = graph.cypher.execute(query, name=\"Nicole\")\n",
    "\n",
    "data"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# ipython-cypher\n",
    "\n",
    "`ipython-cypher` exposes `%cypher` magic in Jupyter. Install `ipython-cypher` with `pip install ipython-cypher`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": true,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Cypher\n",
    "\n",
    "`%cypher` is intended for one-line Cypher queries and `%%cypher` is intended for multi-line Cypher queries. Placing `%%cypher` above a Cypher query will display that query's results."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>person.name</th>\n",
       "        <th>drink.name</th>\n",
       "        <th>drink.calories</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Coke Zero</td>\n",
       "        <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Drew</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[u'Nicole', u'Mountain Dew', 9000],\n",
       " [u'Nicole', u'Coke Zero', 0],\n",
       " [u'Drew', u'Mountain Dew', 9000]]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name, drink.name, drink.calories"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Pandas Data Frames\n",
    "\n",
    "Cypher query results can be coerced to `pandas` data frames with the `get_dataframe` method. To assign Cypher query results to a variable, you need to use `%cypher` and separate lines with \\\\. You'll first need to install `pandas` with `pip install pandas`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Drew</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Coke Zero</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name         drink\n",
       "0    Drew  Mountain Dew\n",
       "1  Nicole  Mountain Dew\n",
       "2  Nicole     Coke Zero"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = %cypher MATCH (person)-[:LIKES]->(drink:Drink) \\\n",
    "                  RETURN person.name AS name, drink.name AS drink\n",
    "    \n",
    "df = results.get_dataframe()\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Int64Index([0, 1, 2], dtype='int64')"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.index"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name         drink\n",
       "1  Nicole  Mountain Dew"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.iloc[[1]]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0      Drew\n",
       "1    Nicole\n",
       "2    Nicole\n",
       "Name: name, dtype: object"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df[\"name\"]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# NetworkX Graphs\n",
    "\n",
    "Cypher query results can be coerced to `NetworkX` MultiDiGraphs, graphs that permit multiple edges between nodes, with the `get_graph` method. You'll first need to install `NetworkX` with `pip install networkx`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAd8AAAFBCAYAAAA2bKVrAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAHXBJREFUeJzt3XtU1HX+x/EXkJig8gPEfpqWdkMYwQHTVkvblj1bu6ZH\n7aLVtqvtcgkR8FJ0sa1dy/IWSyotpnVs25AutGnZrlmWaeoqN3HAsmwxW8+KiCMaMgPM7w/TjR9s\nyu37ZWaej3M6p+N3vtObTvn085nvfL8+LpfLJQAAYBhfswcAAMDbEF8AAAxGfAEAMBjxBQDAYMQX\nAACDEV8AAAxGfAEAMBjxBQDAYMQXAACDEV8AAAxGfAEAMBjxBQDAYMQXAACDEV8AAAxGfAEAMBjx\nBQDAYMQXAACDEV8AAAxGfAEAMBjxBQDAYMQXAACDEV8AAAxGfAEAMBjxBQDAYMQXAACDEV8AAAxG\nfAEAMBjxBQDAYMQXAACDEV8AAAxGfAEAMBjxBQDAYMQXAACDEV8AAAxGfAEAMBjxBQDAYMQXAACD\nEV8AAAxGfAEAMBjxBQDAYMQXAACDEV8AAAxGfAEAMBjxBQDAYMQXAACDEV8AAAxGfAEAMBjxBQDA\nYMQXAACDEV8AAAxGfAEAMBjxBQDAYMQXAACDEV8AAAxGfAEAMBjxBQDAYMQXAACDEV8AAAxGfAEA\nMBjxBQDAYMQXAACDEV8AAAxGfAEAMBjxBQDAYMQXAACDEV8AAAxGfAEAMBjxBQDAYBeZPQAAoGuy\n2+2qqqqSJIWGhiooKMjkiTwHK18AwDl1dXXKzc3VGKtVl4aFKW7YMMUNG6ZLw8I0xmpVbm6uHA6H\n2WO6PR+Xy+UyewgAgPny1q5VWmKiolwuJdfUaLz+sz3qlLReUnbPntrr66usnBxNmTrVvGHdHPEF\nAOi5Z5/Vknnz9FZtrYaf57UFkiYFBGju/PlKnT3biPE8DvEFAC+Xt3atHrjvPm2trdVlF3jOQUk3\nBARo8erVrIDbgPgCgBerq6vT5X37asOJE4pt5bkFksb17q2DlZXy9/fvjPE8FhdcAYAXy8/P19DG\nxlaHV5KGS7I0Nio/P7+jx/J4rHwBwIuNsVo1q6REk9t4/puSsqxWbSkq6sixPB7xBQAvZbfbdWlY\nmI47nW2+6YNTUnC3bvqmspLvAbcC284A4KWqqqoU1r17u+621E1SH39/HTt2rKPG8grEFwAAgxFf\nAPBSoaGhqqyrk7Md7+GUdNThUEhISEeN5RWILwB4qaCgIMVERmp9O95jnaRYi4XPe1uJ+AKAF0vO\nyNDygIA2n5/dq5eSMzI6cCLvQHwBwEvV1NRo165d2llbq8I2nF8gyebjo8mT2/pFJe9FfAHAy7hc\nLuXm5ioiIkLHjh3Ts9nZmtijhw624j0O6sz9nbNycri7VRvwPF8A8CJ79+5VSkqK7Ha78vLydP31\n10uS6r79Vje04cEK3Ne5bVj5AoAXsNvtmjVrln7yk5/ozjvv1O7du8+FV5JSZ8/W4hdf1LjevfXT\nnj2VL6n+e+c7deZuVnG9emlc795avHo1TzRqB+ILAB7M5XLp5ZdfVkREhGpqamSz2ZScnCw/P79m\nr50ydaoOVlbqty+8oD9arfqfbt00KDBQgwIDFdytm7KsVsWvXKmDlZWseNuJ20sCgIcqLi5WSkqK\n6urqtGLFCo0cObJV59vt9nN3rgoJCeHrRB2I+AKAh6murtZjjz2m119/XU8++aTuu+++Fle6MA/b\nzgDgIRobG7V69WpFRESosbFRZWVlio+PJ7xdEFc7A4AH2L17t2bMmCFfX19t2LBBsbFteUIvjMLK\nFwDc2NGjR5WYmKjx48fr/vvv17Zt2wivGyC+AOCGGhoa9Kc//UmRkZG6+OKLVV5ermnTpsnXl9/W\n3QHbzgDgZrZv366UlBQFBgZq06ZNio6ONnsktBLxBQA3ceTIET300EP6+9//rkWLFunuu++Wj4+P\n2WOhDdifAIAurr6+XsuWLZPFYlFwcLDKy8t1zz33EF43xsoXALqwTz75RCkpKQoNDdVHH30ki8Vi\n9kjoAMQXALqgw4cP68EHH9RHH32kpUuX6o477mCl60HYdgaALsTpdOrZZ59VVFSUBgwYoPLyct15\n552E18Ow8gWALmLz5s1KSUnRgAEDtG3bNoWHh5s9EjoJ8QUAkx06dEhz587Vjh07lJmZqYkTJ7LS\n9XBsOwOASRwOhxYuXCir1aqrr75aZWVlmjRpEuH1Aqx8AcAEGzdu1MyZM3X11Vdrx44duuqqq8we\nCQYivgBgoIqKCs2ePVvFxcXKysrSrbfeavZIMAHbzgBggNOnT+vJJ5/U8OHDZbVaZbPZCK8XY+UL\nAJ3s3XffVVpamqKiorR7924NGjTI7JFgMuILAJ3kwIEDSk9P1759+7R8+XLdcsstZo+ELoJtZwDo\nYLW1tXr88cc1YsQIjRo1SqWlpYQXTbDyBYAO4nK59Pbbb2vWrFkaMWKEiouLNXDgQLPHQhdEfAGg\nA+zfv1+pqamqqKjQqlWrFBcXZ/ZI6MLYdgaAdjh16pQeeeQRjRo1SnFxcSouLia8OC/iCwBt4HK5\n9PrrrysiIkIVFRXas2eP5s6dK39/f7NHgxtg2xkAWqm8vFwzZ87UkSNH9Morr2js2LFmjwQ3w8oX\nAC5QTU2NHnjgAY0dO1YTJkxQYWEh4UWbEF8AOA+Xy6VXX31VERERqqys1N69e5WamqqLLmLzEG3D\nfzkA8ANKS0uVkpKimpoavfbaaxo9erTZI8EDsPIFgBbY7Xalp6crLi5OU6ZM0a5duwgvOgzxBYDv\naWxs1Jo1axQREaFvv/1WNptNycnJ8vPzM3s0eBC2nQHgO0VFRUpJSZHT6dRf//pXjRw50uyR4KFY\n+QLwetXV1ZoxY4ZuueUWTZs2TTt27CC86FTEF4DXamxs1KpVqxQRESGXy6Xy8nLFx8fL15ffGtG5\n2HYG4JV2796tGTNmyM/PTxs2bFBsbKzZI8GL8Mc7AF7l6NGjSkhI0Pjx43X//fdr69athBeGI74A\nvEJDQ4Oef/55RUZGqkePHiovL9e0adPYYoYp2HYG4PG2b9+ulJQUBQYGatOmTYqOjjZ7JHg54gvA\nYx05ckQZGRnauHGjFi1apLvvvls+Pj5mjwWw7QzA89TX1+u5556TxWJRaGioysvLdc899xBedBms\nfAF4lC1btiglJUVhYWH6+OOPFRkZafZIQDPEF4BHOHz4sB544AFt2bJFS5cu1e23385KF10W284A\n3JrT6dTSpUsVFRWlgQMHqqysTHfccQfhRZfGyheA2/rwww+VkpKigQMHatu2bQoPDzd7JOCCEF8A\nbufQoUOaM2eOdu7cqczMTE2cOJGVLtwK284A3IbD4dAzzzwjq9Wq8PBwlZWVadKkSYQXboeVLwC3\nsHHjRs2cOVPXXHONdu7cqSuvvNLskYA2I74AurSKigrNmjVLJSUlysrK0q233mr2SEC7se0MoMtw\nOp1yOp2SpNOnT2v+/PmKjY1VTEyMbDYb4YXHYOULoEvYvHmzZs6cqenTp2vIkCFKS0tTdHS0CgoK\nNGjQILPHAzqUj8vlcpk9BADvdejQIc2dO1d5eXmSJD8/P1122WV6/vnndfPNN5s8HdA52HYGYAqH\nw6FFixZpyJAh58IrnXn038iRIwkvPBrbzgAM9/7772vmzJn67LPPWjzeo0cPNTQ0yM/Pz+DJAGOw\n8gVgmIMHD+q2227Tz372sxbDGxMTo23btumll14ivPBoxBdApzt9+rSeeuopDRkyRPn5+c2OBwcH\nKzs7W7t27dLo0aNNmBAwFtvOADrVhg0blJqaqi+//LLZMR8fH/32t7/VggUL1KdPHxOmA8xBfAF0\nigMHDig9PV3r169v8fiIESO0fPlyjRw50uDJAPOx7QygQ9XW1uqJJ55QZGRki+ENDQ3VCy+8oB07\ndhBeeC1WvgA6hMvl0rp165Senq5//vOfzY77+voqKSlJ8+fPV0hIiPEDAl0I8QXQbvv371daWpre\ne++9Fo+PGjVKK1asUExMjMGTAV0T8QUgSbLb7aqqqpJ0Zms4KCjovOecOnVKCxYs0JIlS+RwOJod\n79u3rxYtWqR7771Xvr58ygWcxf8NgBerq6tTbm6uxlitujQsTHHDhilu2DBdGhamMVarcnNzW4yq\ny+XSG2+8oYiICC1YsKDZa/z8/JSWlqbPP/9cv/71rwkv8P9wb2fAS+WtXau0xERFuVxKrqnReP1n\nK8wpab2k7J49tdfXV1k5OZoydaokqby8XKmpqdq0aVOL7zt27FgtX75cUVFRRvwYgFsivoAXeu7Z\nZ7Vk3jy9VVur4ed5bYGkSQEBSnn0UR09flyZmZmqr69v9rp+/fppyZIluuuuu+Tj49MpcwOegvgC\nXiZv7Vo9cN992lpbq8su8JyDkoZLOtrCsYsuukjp6en63e9+p169enXcoIAHI76AF6mrq9Plfftq\nw4kTim3luQWSxkiq/d6vxcXFadmyZYqIiOi4IQEvwFUQgBfJz8/X0MbGVodXOrPyHfrd3w8YMECv\nvfaa3n//fcILtAErX8CLjLFaNaukRJPbeP6bkh7q21fFBw4oMDCwI0cDvArxBbyE3W7XpWFhOu50\ntvkL/k5Jwd266ZvKygv6HjCAlrHtDHiJqqoqhXXv3q4763ST1MffX8eOHeuosQCvRHwBADAY8QW8\nRGhoqCrr6uRsx3s4JR11OHgwAtBOxBfwEkFBQYqJiFDLT9e9MOskxVosfN4LtBPxBbzEZ599piqn\nUwvb8R7ZvXopOSOjw2YCvBXxBTxcXV2dfv/73ys6Olrl5eUqlVTYhvcpkGTz8dHkyW39ohKAs3ik\nIODBtmzZosTERO3bt+/cr9VK+pnOBLg1t5ecFBCgrJwc+fv7d/yggJdh5Qt4oOrqasXHx+vGG29s\nEt6z/jc8XNdffLEKLuC9CiTdEBCgufPnn3uyEYD2Ib6AB3G5XFq7dq2GDBmiVatWNTvet29fvfrq\nqyotL9eSl17SuN699dOePZUv6fvPKXLqzN2s4nr10rjevbV49Wqlzp5t0E8BeD7ucAV4iK+++krJ\nycn629/+1uLx3/zmN1q0aFGTrwk5HA7l5+cre+FCFdps6vPdlvJRh0OxFouSMzI0efJktpqBDkZ8\nATdXX1+vzMxMPf7446qtrW12PDw8XCtXrtTYsWN/8H3sdvu5O1eFhITwdSKgExFfwI3t2rVL8fHx\nKikpaXbM399fjzzyiB566CF1797dhOkA/Ddc7Qy4oZqaGs2bN0/Lli1TS39+Hjt2rHJycjRkyBAT\npgNwPsQXcDPr1q3TjBkzdOjQoWbHgoODtXjxYk2fPl2+vlxPCXRVxBdwE998841SU1OVn5/f4vG7\n7rpLmZmZuuSSSwyeDEBr8UdjoItraGjQihUrFBER0WJ4Bw8erPfee0+vvvoq4QXcBCtfoAvbs2eP\nEhIStHPnzmbH/Pz8NGfOHD3++OMKCAgwYToAbUV8gS6otrZWf/jDH7RkyRLV19c3Oz5ixAitXLlS\nVqvVhOkAtBfxBbqY999/X0lJSTpw4ECzYz179tSCBQuUnJwsPz8/E6YD0BGIL9BFVFZWavbs2Xrl\nlVdaPD5x4kQtW7ZMAwYMMHgyAB2N+AJdgM1m09ixY8/dYer7+vfvr+XLl2vSpEkmTAagM3C1M9AF\nhIeHq0+fPk1+zcfHRykpKSovLye8gIdh5QuYrLq6Wg8++KCqq6vl6+urxsZGRUVFaeXKlfrRj35k\n9ngAOgErX8AkZx//Z7FY5O/vr/379+vhhx/WM888o4KCAsILeDAerACY4Ozj/w4dOqSVK1dq1KhR\nZo8EwECsfAED1dfXa/HixRoxYoRuvPFGFRYWEl7AC/GZL2CQXbt2KSEhQX369NHOnTt15ZVXmj0S\nAJOw8gU6WU1NjdLS0jR+/HjNmTNHGzduJLyAlyO+QCdat26dLBaLTpw4IZvNpl/+8pfy8fExeywA\nJmPbGegEZx//V1paqjVr1uimm24yeyQAXQgrX6ADnX38n9VqlcVi0Z49ewgvgGZY+QIdpLS0VAkJ\nCfLz89PHH3+syMhIs0cC0EWx8gXaqba2Vg8//LDi4uI0ffp0bdmyhfAC+EGsfIF2OPv4v2uvvVYl\nJSXq16+f2SMBcAPEF2iDs4//++STT5Sdna1f/OIXZo8EwI2w7Qy0gsvl0ksvvaShQ4fqkksukc1m\nI7wAWo2VL3CBPv/8cyUlJenEiRN67733FBsba/ZIANwUK1/gPBwOh+bPn6/Ro0drwoQJ2rFjB+EF\n0C6sfIEfsHXrViUkJOjKK69UYWGhLrvsMrNHAuABiC/Qgurqaj300EN65513lJWVpdtuu43bQgLo\nMGw7A9/jcrmUl5cni8UiPz8/lZWV6fbbbye8ADoUK1/gOxUVFUpOTlZFRYXeeOMNjR492uyRAHgo\nVr7wevX19Vq6dKmGDx+u66+/XoWFhYQXQKdi5QuvVlBQoPj4eAUHB2v79u26+uqrzR4JgBdg5Quv\ndPLkSc2aNUvjxo1Tenq6Nm3aRHgBGIb4wuusX79eFotF1dXV2rt3r371q19xQRUAQ7HtDK9x+PBh\npaamqri4WC+++KLi4uLMHgmAl2LlC4/X2Nio559/XtHR0QoPD9eePXsILwBTsfKFR9u7d68SExMl\nSZs3b9bQoUNNnggAWPnCQ9XW1urRRx/VTTfdpHvvvVeffPIJ4QXQZbDyhcf54IMPlJSUpJiYGO3Z\ns4cH3APocogvPMbRo0c1Z84cffTRR1qxYoVuvfVWs0cCgBax7Qy353K5tGbNGlksFoWGhspmsxFe\nAF0aK1+4tf379yspKUnV1dXasGGDhg8fbvZIAHBerHzhlhwOh5566imNGjVK48aN0z/+8Q/CC8Bt\nsPKF2/n000+VkJCgyy+/XLt379agQYPMHgkAWoX4wm0cP35cDz/8sN5++2398Y9/1B133MFtIQG4\nJbad0eW5XC69/vrrslgscrlcKisr05133kl4AbgtVr7o0g4ePKgZM2bowIEDysvL0w033GD2SADQ\nbqx80SXV19crMzNTsbGxuu6661RUVER4AXgMVr7ocgoLCxUfH6+goCB9+umnuuaaa8weCQA6FCtf\ndBknT57UnDlz9POf/1wzZ87UBx98QHgBeCTiiy7h3Xff1dChQ1VZWam9e/dq2rRpXFAFwGOx7QxT\nHT58WGlpaSosLNSqVav005/+1OyRAKDTsfKFKRobG5WTk6Po6GhdddVVKi0tJbwAvAYrXxjOZrMp\nMTFRDQ0N+vDDDxUVFWX2SABgKFa+MMzp06f12GOP6cc//rHuvvtubdu2jfAC8EqsfGGIzZs3KzEx\nUdHR0SopKVH//v3NHgkATEN80amqqqo0d+5cffDBB1q+fLkmTJhg9kgAYDq2ndEpXC6X/vznP8ti\nsSgoKEg2m43wAsB3WPmiw3355ZdKSkrS0aNH9c477+jaa681eyQA6FJY+aLDOJ1OPf3007ruuut0\n8803a9euXYQXAFrAyhcdYvv27UpISNDAgQN5wD0AnAfxRbvY7XY98sgjeuutt5SZmclzdgHgArDt\njDZxuVx68803ZbFY5HQ6ZbPZNGXKFMILABeAla+XstvtqqqqkiSFhoYqKCjogs/9+uuvNWPGDH3x\nxRfKzc3VmDFjOmtMAPBIrHy9SF1d3ZlYWq26NCxMccOGKW7YMF0aFqYxVqtyc3PlcDj+6/kNDQ3K\nyspSTEyMrr32WhUVFRFeAGgDH5fL5TJ7CHS+vLVrlZaYqCiXS8k1NRqv/2x7OCWtl5Tds6f2+voq\nKydHU6ZObXJ+UVGREhISFBgYqJycHIWHhxv8EwCA5yC+XuC5Z5/Vknnz9FZtrYaf57UFkiYFBGju\n/PlKnT1bp06d0hNPPKGXX35ZTz/9tKZPn87nugDQTnzm6+Hy1q7VknnztLW2VpddwOuHS9r67be6\n4bHH9K8jR5SXl6frr79epaWl6tu3b2ePCwBegZWvB6urq9Plfftqw4kTim3luQWSbvTxUd769Ro3\nblxnjAcAXosLrjxYfn6+hjY2tjq80pkV8HWBgaqpqenosQDA67Hy9WBjrFbNKinR5Dae/6akLKtV\nW4qKOnIsAPB6xNdD2e12XRoWpuNOZ5s/2HdKCu7WTd9UVrbqe8AAgB/GtrOHqqqqUlj37u26oq6b\npD7+/jp27FhHjQUAEPEFAMBwbDt7qLPbztVOp7q18T2cknpKGhMXp5EjRyomJkaxsbEaPHiwfH35\ncxsAtBW/g3qooKAgxURGan073mOdpNjISKWmpqp79+76y1/+optuuknBwcG68cYblZ6erjVr1qi0\ntFROp7OjRgcAj8fK14Pl5uZqdUKCNp082abz43r1UvzKlZr6/241WVVVpaKionN/FRYW6uuvv1Zk\nZKRiYmLOrZCjoqIUEBDQET8KAHgU4uvB2nuTjXG9e+tgZaX8/f3P+/qTJ09qz549TYK8b98+DR48\nuEmQrVargoOD2/TzAICnIL4eLm/tWj1w330XfHtJSToo6YaAAC1evbrZAxZaw+FwqKysrEmQS0pK\n1KdPn3NBPhvlfv36cc9oAF6D+HqB9jxYoaM1Njbqiy++aLZt7evr2yzIV1xxBRd2AfBIxNdLnH2k\n4NDGRiWfPKkJavpIwXWSsnv1ks3Hp8VHCnYml8ulb775plmQjx8/rmHDhjUJckREhLp1a+v128ax\n2+2qqqqSJIWGhnKTEgBNEF8v4nA4lJ+fr+yFC1Vos6nPd5/lHnU4FGuxKDkjQ5MnT76gz3iNUFVV\npeLi4iZBrqioaHJhV0xMjKKjoxUYGGj2uKqrqzv377eorExh3btLkirr6hQTGankjAzddtttXebf\nLwDzEF8vZbfbz925KiQkxG1WZqdOnWpyYVdRUZHKyso0aNCgJkGOiYlRSEiIYXOd3VmIcrmUXFOj\n8Wq6s7BeUnbPntrr62v4zgKArof4wu05nc4mF3YVFRWpuLhYISEhzT5H7t+/f4sXdn399de66KKL\n1K9fv1b/87vSZ+oA3APxhUdqbGzUl19+2exzZEnNVshXXXWVkpKS9MILL+iSSy5pEuuYmBhdccUV\n//VKbDOvJgfgvogvvIbL5dK//vWvJkEuKipSVVWVXC6XTv6Xm5H07t1bVqu1SZAjIiLU0NBg2Peo\nAXgW4guv9+9//1sDBw5s1S0yu3fvrv79+6v/oUPa2sZba8b17Kn4F15odgcxAJ6PL1HC6zU2Niom\nJkYXX3zxBZ9TV1eno199pdntuKd18smTyl64sM3nA3BfrHyB79TX12vfvn3NtqXtdnuLr/eXdEpq\n8zOTnZKCu3XTN5WVbnO1OYCOQXyBH+ByufTVV181C/Lhw4fVR1JlO99/UGCgNpeWavDgwR0xLgA3\nQXyBNti5c6fu+PGPdfD06Xa9D/EFvBOf+QJtMGTIEB1raFB7nmLs1Jm7ixl5MxAAXQPxBdogKChI\nMZGRWt+O91gnKdZi4fNewAsRX6CNkjMylN2zZ5vPz+7VS8kZGR04EQB3wWe+QBvV1dVxkw0AbcLK\nF2ij7t27KysnRxN79NDBVpx3UGfu75yVk0N4AS9FfIF2mDJ1quY++aRu6NFDBRfw+gKdua/z3Pnz\nua8z4MXYdgY6wNlHCg5tbFTyyZOaoKaPFFynM5/x2nx8eKQgAOILdBSHw6H8/HxlL1yoQptNfb7b\nUj7qcCjWYlFyRoYmT57MVjMA4gt0BrvdrmPHjkmSQkJC+DoRgCaILwAABuOCKwAADEZ8AQAwGPEF\nAMBgxBcAAIMRXwAADEZ8AQAwGPEFAMBgxBcAAIMRXwAADEZ8AQAwGPEFAMBgxBcAAIMRXwAADEZ8\nAQAwGPEFAMBgxBcAAIMRXwAADEZ8AQAwGPEFAMBgxBcAAIMRXwAADEZ8AQAwGPEFAMBgxBcAAIMR\nXwAADEZ8AQAwGPEFAMBgxBcAAIMRXwAADEZ8AQAwGPEFAMBgxBcAAIMRXwAADEZ8AQAwGPEFAMBg\nxBcAAIMRXwAADEZ8AQAwGPEFAMBgxBcAAIMRXwAADEZ8AQAwGPEFAMBgxBcAAIMRXwAADEZ8AQAw\nGPEFAMBgxBcAAIMRXwAADEZ8AQAwGPEFAMBg/wemJH6rjsuDRQAAAABJRU5ErkJggg==\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x114b2f910>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import networkx as nx\n",
    "%matplotlib inline\n",
    "\n",
    "results = %cypher MATCH p = (:Person)-[:LIKES]->(:Drink) RETURN p\n",
    "\n",
    "g = results.get_graph()\n",
    "\n",
    "nx.draw(g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[(u'24', {u'calories': 9000, 'labels': [u'Drink'], u'name': u'Mountain Dew'}),\n",
       " (u'25', {u'calories': 0, 'labels': [u'Drink'], u'name': u'Coke Zero'}),\n",
       " (u'22', {u'age': 24, 'labels': [u'Person'], u'name': u'Nicole'}),\n",
       " (u'23', {u'age': 20, 'labels': [u'Person'], u'name': u'Drew'})]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.nodes(data=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{u'22': 2, u'23': 1, u'24': 2, u'25': 1}"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nx.degree(g)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# igraph\n",
    "\n",
    "Cypher query results can be imported into `igraph` with `py2neo`. You'll need to install `igraph` with `pip install python-igraph`. Query results should be returned as edgelists, as `igraph` has a method for building an `igraph` object from a list of tuples representing edges between nodes."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   | person.name | drink.name  \n",
       "---+-------------+--------------\n",
       " 1 | Nicole      | Mountain Dew\n",
       " 2 | Nicole      | Coke Zero   \n",
       " 3 | Drew        | Mountain Dew"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Graph as PGraph\n",
    "from igraph import Graph as IGraph\n",
    "\n",
    "neo4j = PGraph()\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name, drink.name\n",
    "\"\"\"\n",
    "\n",
    "data = neo4j.cypher.execute(query)\n",
    "data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<igraph.Graph at 0x1140ebce8>"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ig = IGraph.TupleList(data)\n",
    "\n",
    "ig"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[u'Nicole', u'Mountain Dew']"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "best = ig.vs.select(_degree = ig.maxdegree())[\"name\"]\n",
    "best"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true,
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## graph3d\n",
    "\n",
    "`graph3d`, originally named `igraph` but which I've renamed to avoid conflicts with the other `igraph`, will plot tuple lists as 3D graphs."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-d29f7708-75cb-45e0-a7f9-17f09be97157\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {igraph: ['nbextensions/igraph.min', 'https://rawgit.com/patrickfuller/igraph/master/js/build/igraph.min']}});\n",
       "           require(['igraph'], function () {\n",
       "               var $d = $('#graph-d29f7708-75cb-45e0-a7f9-17f09be97157');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.igraph = jQuery.extend({}, igraph);\n",
       "               $d.igraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true});\n",
       "               $d.igraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 1, \"target\": 2 },\n",
       "        { \"source\": 2, \"target\": 3 },\n",
       "        { \"source\": 3, \"target\": 4 },\n",
       "        { \"source\": 4, \"target\": 1 },\n",
       "        { \"source\": 4, \"target\": 5 },\n",
       "        { \"source\": 5, \"target\": 2 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"1\": { \"location\": [ -2.000, -2.000, -2.000 ] },\n",
       "        \"2\": { \"location\": [ -1.261, -0.890, -1.041 ] },\n",
       "        \"3\": { \"location\": [ 0.621, 0.321, 0.144 ] },\n",
       "        \"4\": { \"location\": [ 0.929, 1.010, 1.165 ] },\n",
       "        \"5\": { \"location\": [ 1.987, 1.929, 2.000 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.igraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import graph3d\n",
    "\n",
    "graph3d.draw([(1, 2), (2, 3), (3, 4), (4, 1), (4, 5), (5, 2)])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "We can visualize our Neo4j data by pulling out an edgelist with a Cypher query."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-90ec3de4-48f3-4598-9c82-f70a3aeb4b01\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {igraph: ['nbextensions/igraph.min', 'https://rawgit.com/patrickfuller/igraph/master/js/build/igraph.min']}});\n",
       "           require(['igraph'], function () {\n",
       "               var $d = $('#graph-90ec3de4-48f3-4598-9c82-f70a3aeb4b01');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.igraph = jQuery.extend({}, igraph);\n",
       "               $d.igraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true});\n",
       "               $d.igraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 22, \"target\": 24 },\n",
       "        { \"source\": 22, \"target\": 25 },\n",
       "        { \"source\": 23, \"target\": 24 },\n",
       "        { \"source\": 26, \"target\": 25 },\n",
       "        { \"source\": 27, \"target\": 24 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"22\": { \"location\": [ -2.000, -2.000, -2.000 ] },\n",
       "        \"23\": { \"location\": [ -1.484, -1.712, -1.885 ] },\n",
       "        \"24\": { \"location\": [ -0.532, -0.707, -0.353 ] },\n",
       "        \"25\": { \"location\": [ 0.654, 0.628, 1.104 ] },\n",
       "        \"26\": { \"location\": [ 1.387, 1.815, 1.426 ] },\n",
       "        \"27\": { \"location\": [ 2.000, 2.000, 2.000 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.igraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "data = graph.cypher.execute(\"MATCH (n)-->(m) RETURN ID(n), ID(m)\")\n",
    "data = [tuple(x) for x in data]\n",
    "\n",
    "graph3d.draw(data)"
   ]
  }
 ],
 "metadata": {
  "celltoolbar": "Slideshow",
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
