{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# Hello World\n",
    "\n",
    "This notebook walks through basic code examples for integrating various packages with Neo4j, including `py2neo`, `ipython-cypher`, `pandas`, `networkx`, `igraph`, and `jgraph`."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# py2neo\n",
    "\n",
    "`py2neo` is one of Neo4j's Python drivers. It offers a fully-featured interface for interacting with your data in Neo4j. Install `py2neo` with `pip install py2neo`."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Connect\n",
    "\n",
    "Connect to Neo4j with the `Graph` class."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "\n",
    "graph = Graph()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": true,
    "slideshow": {
     "slide_type": "skip"
    }
   },
   "outputs": [],
   "source": [
    "graph.delete_all()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Nodes\n",
    "\n",
    "Create nodes with the `Node` class. The first argument is the node's label. The remaining arguments are an arbitrary amount of node properties or key-value pairs."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [],
   "source": [
    "from py2neo import Node\n",
    "\n",
    "nicole = Node(\"Person\", name=\"Nicole\", age=24)\n",
    "drew = Node(\"Person\", name=\"Drew\", age=20)\n",
    "\n",
    "mtdew = Node(\"Drink\", name=\"Mountain Dew\", calories=9000)\n",
    "cokezero = Node(\"Drink\", name=\"Coke Zero\", calories=0)\n",
    "\n",
    "coke = Node(\"Manufacturer\", name=\"Coca Cola\")\n",
    "pepsi = Node(\"Manufacturer\", name=\"Pepsi\")\n",
    "\n",
    "graph.create(nicole, drew, mtdew, cokezero, coke, pepsi)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph-26860195-59b7-4fb3-804d-68ee437c1d5f.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x10dbd1dd0>"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from scripts.vis import draw\n",
    "\n",
    "options = {\"Person\": \"name\", \"Drink\": \"name\", \"Manufacturer\": \"name\"}\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "skip"
    }
   },
   "source": [
    "P.S. - If you want to check out what's going on behind the scenes for the `draw()` function used above, take a look at [`scripts/vis.py`](https://github.com/nicolewhite/neo4j-jupyter/blob/master/scripts/vis.py)."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Relationships\n",
    "\n",
    "Create relationships between nodes with the `Relationship` class."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph-74ebc1fd-abc6-42eb-b43f-2598589a9e60.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x10dbd1d90>"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Relationship\n",
    "\n",
    "graph.create(Relationship(nicole, \"LIKES\", cokezero))\n",
    "graph.create(Relationship(nicole, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(drew, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(coke, \"MAKES\", cokezero))\n",
    "graph.create(Relationship(pepsi, \"MAKES\", mtdew))\n",
    "\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Cypher\n",
    "\n",
    "Retrieve Cypher query results with `Graph.cypher.execute`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   | name   | drink       \n",
       "---+--------+--------------\n",
       " 1 | Nicole | Mountain Dew\n",
       " 2 | Nicole | Coke Zero   \n",
       " 3 | Drew   | Mountain Dew"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name AS name, drink.name AS drink\n",
    "\"\"\"\n",
    "\n",
    "data = graph.cypher.execute(query)\n",
    "\n",
    "data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       " name   | drink       \n",
       "--------+--------------\n",
       " Nicole | Mountain Dew"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "data[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Nicole likes to drink Mountain Dew.\n",
      "Nicole likes to drink Coke Zero.\n",
      "Drew likes to drink Mountain Dew.\n"
     ]
    }
   ],
   "source": [
    "for row in data:\n",
    "    print \"{0} likes to drink {1}.\".format(row[\"name\"], row.drink)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Parameterized Cypher\n",
    "\n",
    "Pass parameters to Cypher queries by passing additional key-value arguments to `Graph.cypher.execute.` Parameters in Cypher are named and are wrapped in curly braces."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   | name   | avg_calories\n",
       "---+--------+--------------\n",
       " 1 | Nicole |       4500.0"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p:Person)-[:LIKES]->(drink:Drink)\n",
    "WHERE p.name = {name}\n",
    "RETURN p.name AS name, AVG(drink.calories) AS avg_calories\n",
    "\"\"\"\n",
    "\n",
    "data = graph.cypher.execute(query, name=\"Nicole\")\n",
    "\n",
    "data"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# ipython-cypher\n",
    "\n",
    "`ipython-cypher` exposes `%cypher` magic in Jupyter. Install `ipython-cypher` with `pip install ipython-cypher`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "collapsed": true,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Cypher\n",
    "\n",
    "`%cypher` is intended for one-line Cypher queries and `%%cypher` is intended for multi-line Cypher queries. Placing `%%cypher` above a Cypher query will display that query's results."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>person.name</th>\n",
       "        <th>drink.name</th>\n",
       "        <th>drink.calories</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Coke Zero</td>\n",
       "        <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Drew</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[u'Nicole', u'Mountain Dew', 9000],\n",
       " [u'Nicole', u'Coke Zero', 0],\n",
       " [u'Drew', u'Mountain Dew', 9000]]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name, drink.name, drink.calories"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Pandas Data Frames\n",
    "\n",
    "Cypher query results can be coerced to `pandas` data frames with the `get_dataframe` method. To assign Cypher query results to a variable, you need to use `%cypher` and separate lines with \\\\. You'll first need to install `pandas` with `pip install pandas`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Coke Zero</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Drew</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name         drink\n",
       "0  Nicole  Mountain Dew\n",
       "1  Nicole     Coke Zero\n",
       "2    Drew  Mountain Dew"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = %cypher MATCH (person:Person)-[:LIKES]->(drink:Drink) \\\n",
    "                  RETURN person.name AS name, drink.name AS drink\n",
    "    \n",
    "df = results.get_dataframe()\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Int64Index([0, 1, 2], dtype='int64')"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.index"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Coke Zero</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name      drink\n",
       "1  Nicole  Coke Zero"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.iloc[[1]]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0    Nicole\n",
       "1    Nicole\n",
       "2      Drew\n",
       "Name: name, dtype: object"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df[\"name\"]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## NetworkX Graphs\n",
    "\n",
    "Cypher query results can be coerced to `NetworkX` MultiDiGraphs, graphs that permit multiple edges between nodes, with the `get_graph` method. You'll first need to install `NetworkX` with `pip install networkx`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAd8AAAFBCAYAAAA2bKVrAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAIABJREFUeJzt3XtYVWXi9vEbFRQSCRCt0aycsZmkXhjNZAtYRmlJHsIT\nWmhqapJZeBgaq5kcnVLLivx5rCzzAJ4oQPCUCSgHrwmrK720sdOYliOCghqwEfb7h44TYyWHzVp7\ns7+f/1p7rc1tV3G7nudZz3Kz2Ww2AQAAwzQzOwAAAK6G8gUAwGCULwAABqN8AQAwGOULAIDBKF8A\nAAxG+QIAYDDKFwAAg1G+AAAYjPIFAMBglC8AAAajfAEAMBjlCwCAwShfAAAMRvkCAGAwyhcAAINR\nvgAAGIzyBQDAYJQvAAAGo3wBADAY5QsAgMEoXwAADEb5AgBgMMoXAACDtTA7AACg9kpKSlRUVCRJ\n8vf3l4+Pj8mJUB/c+QKAg6uoqFBiYqLCg4PVISBAEUFBiggKUoeAAIUHBysxMVFWq9XsmKgDN5vN\nZjM7BADg561PStJTkybpdptNsWfPaoD+O2RZKSlN0pLWrXWgWTMlLF+uEdHR5oVFrVG+AOCg3nj1\nVb3y3HN6v6xM3a9yboGkh7y8NGPOHE2dNs2IeGgAyhcAHND6pCTNHDdOe8vK1KmW1xyVFOblpZff\nfps7YAdH+QKAg6moqNCN7dopo7RU3ep4bYGkyDZtdLSwUB4eHo0RD3bAgisAcDDJycm6rbq6zsUr\nSd0lBVZXKzk52d6xYEfc+QKAgwkPDlbcZ58pqp7Xb5aUEBys7E8+sWcs2BHlCwAOpKSkRB0CAnSm\nsrLeGzFUSvJ1d9fxwkKeA3ZQDDsDgAMpKipSQMuWDdoByV1SWw8PFRcX2ysW7IzyBQDAYJQvADgQ\nf39/FVZUqLIB31Ep6ZTVKj8/P3vFgp1RvgDgQHx8fPTHrl2V1oDvSJXULTCQ+V4HRvkCgIOJjY/X\nktat6339Em9vxcbH2zER7I3VzgDgYNhko+njzhcAHExxcbGu8fdX/+bNdbQO1x3Vxf2dE5Yvp3gd\nHOULAA7k888/V0hIiB4dO1Z/nj9fYZ6eKqjFdQW6uLvVgw8/zL7OTqAhj5IBAOxo27ZtGj16tBIS\nEjRy5EhJ0nUdOihy0iTdVl2t2HPnNFA1XymYqotzvAfd3PTktGla9H//p3ETJ+qOO+4w6U+B2mDO\nFwAcwNKlSzV79mxt3rxZoaGhNT6zWq1KTk7Wkvnztf/gQbW9NKR8ympVt8BAxcbHKyoqSh4eHkpJ\nSdHkyZOVlZWlLl26mPFHQS1QvgBgoqqqKs2cOVPp6elKT0/X7373u189v6Sk5PLOVX5+fj/7ONGK\nFSs0f/585eTk6LrrrmuU3GgYhp0BwCTnz5/XqFGjVFpaqry8vFptiuHj43PV53cnTpyoH374Qf37\n91dmZqbatGljr8iwExZcAYAJvv/+e/Xu3Vu+vr7avn273Xej+stf/qI777xTUVFRslqtdv1uNBzl\nCwAG++yzzxQSEqKoqCi98847jfJYkJubmxYvXixvb289+uijqq6utvvPQP0x5wsABsrIyNCYMWO0\naNEiRRvwSFBZWZn69u2rHj16aOHChXJzc2v0n4mr484XAAyyePFijR8/XikpKYYUryR5enoqNTVV\nO3bs0MKFCw35mbg6FlwBQCOrqqrS9OnTtX37duXk5Khz586G/nxfX19t27ZNoaGhat++vWJiYgz9\n+bgS5QsAjejcuXMaOXKkfvzxR+Xm5srX19eUHB07dtTWrVvVp08ftWvXTv369TMlBy5i2BkAGsnx\n48fVu3dvtWvXTlu3bjWteP+ja9euSk5OVkxMjD7++GNTs7g6yhcAGsGnn36qkJAQDRs2TG+99ZbD\nvOggNDRUb775pgYOHKgjR46YHcdlMewMAHa2ZcsWjR07VosXL9bw4cPNjnOFQYMG6eTJk7r//vvZ\nBcsklC8A2NEbb7yhefPmKS0tTSEhIWbH+UUTJkxgFywT8ZwvANhBVVWV4uLi9OGHHyo9PV0333yz\n2ZGuymazafLkyfryyy+VkZHhMEPjroDyBYAGOnv2rEaOHKny8nJt2rRJ1157rdmRaq2qqkpDhw6V\np6en1qxZo2bNWApkBP4tA0ADHDt2TOHh4br++uu1detWpypeSWrevLnWrVunY8eOafr06eJ+zBiU\nLwDU0/79+xUSEqJRo0ZpxYoVcnd3NztSvXh6eiolJUU7d+5kFyyDsOAKAOohNTVV48eP17JlyzRk\nyBCz4zQYu2AZi/IFgDqw2WxKSEjQggULtGXLFvXs2dPsSHbDLljGYcEVANTShQsX9NRTTykzM1Pp\n6em66aabzI7UKHJzczV48GClp6erR48eZsdpkihfAKiF0tJSRUdH68KFC9q4caN8fHzMjtSoUlNT\nNWnSJGVnZ6tLly5mx2lyWHAFAFfx3XffKSwsTJ06dVJ6enqTL15JGjhwoP72t7/p/vvv14kTJ1Re\nXq6TJ0+aHavJYM4XAH5FQUGBBg0apLi4OE2bNs2lXkb/n12w+vXrpzZt2qikpETZ2dlO9ziVI2LY\nGQB+wQcffKAJEyZoxYoVeuihh8yOY4rjx48rKChIRUVFkqS77rpL27ZtU6tWrS6fU1JScvlzf39/\nlxgZaCiGnQHgf9hsNi1cuFBPPPGEMjIyXLZ4JWnu3LmXi1WSsrKyFBMTox9//FGJiYkKDw5Wh4AA\nRQQFKSIoSB0CAhQeHKzExERZrVYTkzs27nwB4CcuXLigKVOmKCcnR+np6erUqZPZkUz1448/6r77\n7lNubm6N4z4eHurRsqViz57VAP13DrNSUpqkJa1b60CzZkpYvlwjoqMNTu34KF8AuKS0tPTyKwA3\nbNjAm34uKS4uVlhYmA4dOqTmkq6VtF1S96tcVyDpIS8vzZgzR1OnTWv0nM6EYWcAkPSvf/1LoaGh\n6ty5s7Zs2ULx/oSfn5+2bdsmX19fXStpv65evLp0zt4ff9Qrzz+v9UlJjRvSyXDnC8Dl/eMf/9Dg\nwYM1Y8YMPf300y61orm2KioqdEPbttp27py61fHaAkmRbdroaGEhry28hDtfAC4tOTlZ/fv315Il\nSxQXF0fx/oLk5GT9P6nOxStdvAMOrK5WcnKynVM5L+58Abik/6xofv3115WSkqLu3WszkOq6woOD\nFffZZ4qq5/WbJSUEByv7k0/sGctpUb4AXE5lZaWmTJmi/Px8bdmyRTfccIPZkRxaSUmJOgQE6Exl\nZb13ZqqU5OvuruOFhTwHLHa4AuBiSkpKNGzYMLVo0UJ79+6Vt7e32ZEcXlFRkQJatlSLysp6f4e7\npLYeHiouLqZ8xZwvABfy7bffqlevXrrllluUmppK8cI0lC8Al7Bv3z716tVLEydO1KJFi9SiBQN/\nteXv76/CigrV/7734rDzKatVfn5+9orl1ChfAE3epk2b9OCDD2r58uV66qmnWNFcRz4+Pvpj165K\na8B3pErqFhjIkPMllC+AJstms2n+/PmKi4vTjh07NGDAALMjOa3Y+Hgtad263tcv8fZWbHy8HRM5\nN1Y7A2iSKisrNXnyZBUUFCgtLU0dO3Y0O5JTq6io0I3t2imjtJRNNuyAO18ATc6ZM2f0wAMP6MSJ\nE9qzZw/FawctW7ZUwvLlGuzpqaN1uO6oLu7vnLB8OcX7E5QvgCblm2++Ua9evRQYGKiUlBS1bsBQ\nKWoaER2tGXPnKszTUwW1OL9AUtilFyvwZqOaGHYG0GTk5eUpKipKs2bN0pNPPml2nCZrfVKSnpo0\nSbdVVyv23DkNVM1XCqbq4hzvQTc3Xin4CyhfAE3Chg0b9MQTT+jdd99VZGSk2XGaPKvVquTkZC2Z\nP1/7Dx5U20tDyqesVnULDFRsfLyioqIYav4FlC8Ap2az2fTSSy9p2bJlSk1NVXBwsNmRXE5JSYmK\ni4slXXz9II8TXR3lC8BpWa1WPf744/r000+VlpamDh06mB0JqBW2eAHglE6fPq0hQ4aodevWys7O\nZmEVnAqrnQE4na+//lq9evVSUFCQ3n//fYoXTofyBeBUcnNzFRoaqieffFKvvfaamjdvbnYkoM4Y\ndgbgNJKSkjR16lStWrVKDzzwgNlxgHqjfAE4PJvNpr///e9asWKFdu7cqaCgILMjAQ1C+QJwaFar\nVRMnTtSBAwe0b98+XX/99WZHAhqMOV8ADqu4uFh9+/ZVSUmJsrKyKF40GZQvAIf05ZdfymKx6I47\n7tCmTZt0zTXXmB0JsBvKF4DD2bt3r8LCwhQXF6dXXnmFFc1ocpjzBeBQ1q1bp6efflqrV69Wv379\nzI4DNArKF4BDsNlsmjNnjlauXKldu3bp9ttvNzsS0GgoXwCmq6io0IQJE3To0CHl5+fruuuuMzsS\n0KiY8wVgqqKiIvXt21fnzp1TVlYWxQuXQPkCMM2RI0dksVjUs2dPbdq0SV5eXmZHAgxB+QIwRXZ2\ntsLDwzVz5kwtWLBAzZrx6wiugzlfAIZbs2aNpk2bprVr1+q+++4zOw5gOMoXgGFsNptmz56tVatW\naffu3QoMDDQ7EmAKyheAISoqKjR+/HgdOXJE+fn5at++vdmRANMwyQKg0Z06dUr33nuvysvLtXv3\nbooXLo/yBdCo/vnPf8pisSg0NFQbNmxgRTMgyhdAI8rKylJ4eLji4+M1b948VjQDlzDnC6BRvPfe\ne5oxY4YSExMVERFhdhzAoVC+AOzKZrPpL3/5i9auXavMzEx17drV7EiAw6F8AdhNeXm5xo4dq2+/\n/Vb5+flq166d2ZEAh8QEDAC7KCwsVEREhKqrq/XRRx9RvMCvoHwBNNjhw4dlsVh09913KzExUZ6e\nnmZHAhwaw84AGmT37t2Kjo7WvHnzNHbsWLPjAE6BO18A9fbuu+8qOjpaiYmJFC9QB5QvgForKirS\nlClTdPbsWT377LOaM2eOsrKydM8995gdDXAqbjabzWZ2CACO78iRI4qMjNSRI0fUoUMHderUSSkp\nKQoICDA7GuB0uPMFcFXZ2dkKCQnRkSNHJEnHjx9XSEgIxQvUE+UL4FetWbNG9957r4qLi2sc379/\nv6xWq0mpAOdG+QL4WTabTS+88IJiYmJUWVlZ47PRo0drx44d8vDwMCkd4Nx41AjAFcrLyzV+/Hit\nW7fuis/mzp2rWbNmyc3NzYRkQNNA+QKo4dSpUxo8eLBycnJqHG/ZsuXlR4sANAzlC+CyL774QpGR\nkfrqq69qHG/btq1SUlLUq1cvk5IBTQtzvgAkSZmZmbJYLFcU7+9//3vl5+dTvIAdUb4A9N5776lv\n3746ffp0jeN9+vRRXl6efvvb35qUDGiaKF/AhdlsNj3//PMaM2bMFSuax44dq23btsnX19ekdEDT\nxZwv4KL+8+7dpKSkKz578cUX9cwzz7CiGWgklC/gggoLCzV48GDl5ubWON6yZUutWrVKI0aMMCkZ\n4BooX8DFHD58WJGRkfr6669rHA8ICFBKSoosFotJyQDXwZwv4EI++ugjWSyWK4r31ltvVX5+PsUL\nGITyBVzEO++8o379+unMmTM1jkdERCg3N1edO3c2KRngeihfoImrrq7WrFmzNG7cOF24cKHGZ+PH\nj9fWrVt17bXXmpQOcE3M+QJNWFlZmR599FFt2LDhis/mzZunP/3pT6xoBkxA+QJN1MmTJzVo0CDl\n5+fXON6qVSutXr1aQ4cONSkZAMoXcDIlJSUqKiqSJPn7+8vHx+eKcw4dOqTIyEh98803NY63a9dO\nqamp6tmzpyFZAfw85nwBJ1BRUaHExESFBwerQ0CAIoKCFBEUpA4BAQoPDlZiYuLlF9vv2rVLFovl\niuLt2rWr9u3bR/ECDsDNZrPZzA4B4JetT0rSU5Mm6XabTbFnz2qA/jtkVSkpTdKS1q11oFkzDYqO\n1sqVK69YWHXvvfdq48aNLKwCHATlCziwN159Va8895zeLytT96ucWyCpn6Qzkqp+cnzChAlavHix\n3N3dGy0ngLqhfAEHtT4pSTPHjdPesjJ1quU1RyV1k1Qkyc3NTfPnz9eMGTNY0Qw4GMoXcEAVFRW6\nsV07ZZSWqlsdry2QFC7pnaQk9mgGHBQLrgAHlJycrNuqq+tcvJLUXdKdXl7i79WA4+LOF3BA4cHB\nivvsM0XV8/rNkhKCg5X9ySf2jAXATihfwMGUlJSoQ0CAzlRW1vtB/EpJvu7uOl5Y+LPPAQMwF8PO\ngIMpKipSQMuWDdoBx11SWw8PFRcX2ysWADuifAEAMBjlCzgYf39/FVZUqLIB31Ep6ZTVKj8/P3vF\nAmBHlC/gYHx8fPTHrl2V1oDvSJXULTCQ+V7AQVG+gAOKjY/XIk/Pel+/xNtbsfHxdkwEwJ4oX8AB\nlZWVaV9ZmfbX49oCSQfd3BQVVd8HlQA0NsoXcCA2m00vvPCCxo8frzJJfXVxy8jaOirpIS8vJSxf\nLg8Pj8YJCaDBKF/AQVitVo0ZM0azZ8++fOyMLu7VXFCL6wskhXl5acacORoRHd1IKQHYA+ULOIDT\np0+rX79+Wr16dY3jzT08NGrKFEW2aaN7W7dWsqSfviywUhd3s4rw9lZkmzZ6+e23NXXaNAOTA6gP\ndrgCTPb111+rf//++uKLL2oc9/f31wcffKCwsDBZrVYlJydryfz52n/woNpeGlI+ZbWqW2CgYuPj\nFRUVxVAz4CQoX8BE+fn5GjhwoAoLC2sc79Kli9LT09WlS5crrikpKbm8c5Wfnx+PEwFOiPIFTLJx\n40aNHj1a5eXlNY6HhYXpgw8+kL+/v0nJADQ25nwBg9lsNi1YsEDDhw+/onhHjhypnTt3UrxAE0f5\nAga6cOGCHn/8ccX/zAYYzz77rNasWaNWrVqZkAyAkRry4hQAdVBaWqrhw4dr+/btNY63aNFCK1as\n0NixY01KBsBolC9ggO+++06RkZH6/PPPaxz38fHR5s2bFRERYVIyAGagfIFGtn//fj344IP64Ycf\nahy/8cYblZGRoa5du5qUDIBZmPMFGtGWLVvUu3fvK4q3R48e2rdvH8ULuCjKF2gkixYt0qBBg3T+\n/Pkaxx966CFlZmaqffv2JiUDYDbKF7CzqqoqPf3005o6daqqq6trfDZt2jRt3LhRXl5eJqUD4AiY\n8wXs6Pz583r44YeVkpJS43izZs20aNEixcbGmpQMgCOhfAE7OXHihAYMGKCPP/64xvFrrrlG69ev\nV2RkpEnJADgayhewgwMHDigyMlJHj9Z8++5vfvMbpaenKzg42KRkABwRc75AA+3cuVOhoaFXFG9Q\nUJD27dtH8QK4AuULNMDbb7+t/v37q7S0tMbxBx54QHv27FHHjh1NSgbAkVG+QD1UV1dr1qxZeuyx\nx3ThwoUan02ePFmpqany9vY2KR0AR8crBYF6iI2N1dKlS2scc3Nz0yuvvKK4uDi5ubmZlAyAM+DO\nF6iHUaNGqXnz5pf/2dPTU5s2bdK0adMoXgBXRfkCdVRWVqbXX39dXbp0kSS1a9dOmZmZioqKMjkZ\nAGdB+QJ18O9//1t9+vRRq1at9Omnn+qtt95Sfn6+7rzzTrOjAXAizPkCtXTo0CFFRkYqJiZGL7zw\nAsPLAOqNTTaAWti9e7eio6O1YMECjRkzxuw4AJwc5QtcxapVqzRz5kytX79effr0MTsOgCaA8gV+\ngc1m01//+letWbNGWVlZuvXWW82OBKCJoHyBn1FRUaHx48fryJEjysvL4927AOyK1c7A/yguLlbf\nvn1VXl6u3bt3U7wA7I7yBX7iyy+/lMVi0Z133qkNGzbw0nsAjYLyBS7Jzc1VeHi44uLi9PLLL6tZ\nM/73ANA4mPMFJK1fv15PPvmk3nvvPd1///1mxwHQxFG+cGk2m03z5s3T0qVLtXPnTgUFBZkdCYAL\noHzhsiorKzV58mQVFBQoLy9PHTp0MDsSABdB+cIllZSUaNiwYXJ3d1d2djbv3gVgKFaUwOUcPXpU\nYWFhuuWWW5SSkkLxAjAc5QuXUlBQIIvFonHjxmnRokVq0YLBHwDG4zcPXEZKSooee+wxvfnmmxo8\neLDZcQC4MMoXLiEhIUELFixQRkaGevToYXYcAC6O8kWTVlVVpbi4OO3atUs5OTm66aabzI4EAJQv\nmq5z585p5MiRKisrU05Ojq699lqzIwGAJBZcoYn6/vvv1bt3bwUEBCgjI4PiBeBQKF80OZ9//rks\nFouGDh2qt99+Wx4eHmZHAoAaGHZGk7J9+3bFxMQoISFBI0eONDsOAPws7nzRZKxYsUJjxoxRcnIy\nxQvAoXHnC6dXXV2tP//5z3r//fe1Z88edenSxexIAPCrKF84tbKyMo0ePVonTpxQXl6e/P39zY4E\nAFfFsDOc1smTJ3XPPffI3d1dO3fupHgBOA3KF07p8OHDslgsioiI0Jo1a9SqVSuzIwFArTHsDKeT\nlZWl4cOHa968eRo7dqzZcQCgzihfOJXVq1dr+vTpSkxMVEREhNlxAKBeKF84BZvNptmzZ2vVqlXK\nzMxU165dzY4EAPVG+cLhVVRUaMKECTp8+LDy8/PVvn17syMBQIOw4AoOrbi4WP369dO5c+eUmZlJ\n8QJoEihfOKyvvvpKvXr1Uvfu3bVx40Z5eXmZHQkA7ILyhUPKy8tTWFiYpk6dqoULF6p58+ZmRwIA\nu2HOFw5n48aNio2N1bvvvqvIyEiz4wCA3VG+cBg2m00vv/yyFi1apJ07dyo4ONjsSADQKChfOITK\nykpNmTJF+/btU15enjp27Gh2JABoNJQvTFdaWqphw4apWbNm2rNnj7y9vc2OBACNigVXMNV3332n\nsLAwde7cWWlpaRQvAJdA+cI0BQUFslgsGjNmjJYsWaIWLRiIAeAa+G0HU6SlpWncuHFatmyZhgwZ\nYnYcADAU5QvDLVq0SC+99JK2bNminj17mh0HAAxH+cIwVVVVmj59unbs2KGcnBzdfPPNZkcCAFNQ\nvjDE+fPnNWrUKJ09e1Y5OTny9fU1OxIAmIYFV2h0P/zwg+666y75+vpq27ZtFC8Al0f5olEdOHBA\nFotFgwYN0jvvvCMPDw+zIwGA6Rh2RqPZsWOHHnnkEb322mt6+OGHzY4DAA6DO180irfeeksxMTHa\ntGkTxQsA/4M7X9hVdXW1nn32WW3cuFF79uzRLbfcYnYkAHA4lC/spry8XGPGjNGxY8eUn5+vtm3b\nmh0JABwSw86wi8LCQkVERMjNzU27du2ieAHgV1C+aLAvvvhCFotFd911l9atW6dWrVqZHQkAHBrl\niwbJzs5W79699cwzz+jFF19Us2b8JwUAV8OcL+pt7dq1iouL09q1a3XfffeZHQcAnAblizqz2Wya\nM2eOVq5cqY8++ki33Xab2ZEAwKlQvqgTq9WqiRMn6sCBA8rLy9P1119vdiQAcDqUL2rt9OnTGjJk\niNq0aaOsrCxdc801ZkcCAKfE6hjUyjfffKNevXopKChImzdvpngBoAEoX1zVvn37FBoaqieeeEKv\nvfaamjdvbnYkAHBqDDvjV23evFmPP/64Vq5cqQEDBpgdBwCaBMoXP8tms2nhwoV6/fXXtX37dnXr\n1s3sSADQZFC+uMKFCxc0ZcoU5ebmKi8vTzfccIPZkQCgSaF8UUNpaalGjBghm82mvXv3qk2bNmZH\nAoAmhwVXuOzYsWMKDw9Xp06dlJaWRvECQCOhfCFJ+uSTT2SxWPTII49o2bJlcnd3NzsSADRZDDtD\n6enpevTRR7V06VINHTrU7DgA0ORRvi5u8eLFmjt3rlJTU2WxWMyOAwAugfJ1UVVVVZo5c6YyMjKU\nk5Ojzp07mx0JAFwG5euCzp8/r0ceeUSnT59Wbm6u/Pz8zI4EAC6FBVcu5sSJE7r77rvl7e2tHTt2\nULwAYALK14UcPHhQISEhevDBB7Vq1Sp5eHiYHQkAXBLDzk6spKRERUVFkiR/f3/5+Pj84rkffvih\nRo0apYULFyomJsaoiACAn8Gdr5OpqKhQYmKiwoOD1SEgQBFBQYoIClKHgACFBwcrMTFRVqu1xjUr\nV67Uww8/rA0bNlC8AOAA3Gw2m83sEKid9UlJemrSJN1usyn27FkN0H+HLiolpUla0rq1DjRrpoTl\nyzVs+HA9//zzSkpKUnp6uv7whz+YFx4AcBnl6yTeePVVvfLcc3q/rEzdr3JugaSHPD3V/ve/V4tW\nrZSamqqAgAAjYgIAaoHydQLrk5I0c9w47S0rU6daXnNU0p3Nm+vllSsVM3p0Y8YDANQR5evgKioq\ndGO7dsooLVVd36hbICmyTRsdLSxkZTMAOBAWXDm45ORk3VZdXefilaTukgKrq5WcnGzvWACABuDO\n18GFBwcr7rPPFFXP6zdLSggOVvYnn9gzFgCgAShfB1ZSUqIOAQE6U1lZ7weyKyX5urvreGHhrz4H\nDAAwDsPODqyoqEgBLVs2aCcUd0ltPTxUXFxsr1gAgAaifAEAMBjl68D8/f1VWFGhygZ8R6WkU1Yr\nL1AAAAdC+TowHx8f/bFrV6U14DtSJXULDGS+FwAcCOXr4GLj47Wkdet6X7/E21ux8fF2TAQAaChW\nOzs4NtkAgKaHO18H17JlSyUsX67Bnp46Wofrjkp6yMtLCcuXU7wA4GAoXycwIjpaM+bOVZinpwpq\ncX6BpDAvL82YM0cjoqMbOx4AoI4YdnYi/3ml4G3V1Yo9d04DVfOVgqm6OMd70M1NCcuXU7wA4KAo\nXydjtVqVnJysJfPna//Bg2p7aUj5lNWqboGBio2PV1RUFEPNAODAKF8nVlJScnnnKj8/Px4nAgAn\nQfkCAGAwFlwBAGAwyhcAAINRvgAAGIzyBQDAYJQvAAAGo3wBADAY5QsAgMEoXwAADEb5AgBgMMoX\nAACDUb4AABiM8gUAwGCULwAABqN8AQAwGOULAIDBKF8AAAxG+QIAYDDKFwAAg1G+AAAYjPIFAMBg\nlC8AAAajfAEAMBjlCwCAwShfAAAMRvkCAGAwyhcAAINRvgAAGIzyBQDAYJQvAAAGo3wBADAY5QsA\ngMEoXwC1jQXuAAAAj0lEQVQADEb5AgBgMMoXAACDUb4AABiM8gUAwGCULwAABqN8AQAwGOULAIDB\nKF8AAAxG+QIAYDDKFwAAg1G+AAAYjPIFAMBglC8AAAajfAEAMBjlCwCAwShfAAAMRvkCAGAwyhcA\nAINRvgAAGIzyBQDAYJQvAAAGo3wBADAY5QsAgMEoXwAADEb5AgBgsP8PnGbJ/FCAOdIAAAAASUVO\nRK5CYII=\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x1112e2c10>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import networkx as nx\n",
    "%matplotlib inline\n",
    "\n",
    "results = %cypher MATCH p = (:Person)-[:LIKES]->(:Drink) RETURN p\n",
    "\n",
    "g = results.get_graph()\n",
    "\n",
    "nx.draw(g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[(u'1', {u'age': 20, 'labels': [u'Person'], u'name': u'Drew'}),\n",
       " (u'0', {u'age': 24, 'labels': [u'Person'], u'name': u'Nicole'}),\n",
       " (u'3', {u'calories': 0, 'labels': [u'Drink'], u'name': u'Coke Zero'}),\n",
       " (u'2', {u'calories': 9000, 'labels': [u'Drink'], u'name': u'Mountain Dew'})]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.nodes(data=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{u'0': 2, u'1': 1, u'2': 2, u'3': 1}"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nx.degree(g)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# igraph\n",
    "\n",
    "Cypher query results can be imported into `igraph` with `py2neo`. You'll need to install `igraph` with `pip install python-igraph`. Query results should be returned as edgelists, as `igraph` has a method for building an `igraph` object from a list of tuples representing edges between nodes."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   | person.name | drink.name  \n",
       "---+-------------+--------------\n",
       " 1 | Nicole      | Mountain Dew\n",
       " 2 | Nicole      | Coke Zero   \n",
       " 3 | Drew        | Mountain Dew"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Graph as PGraph\n",
    "from igraph import Graph as IGraph\n",
    "\n",
    "neo4j = PGraph()\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name, drink.name\n",
    "\"\"\"\n",
    "\n",
    "data = neo4j.cypher.execute(query)\n",
    "data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<igraph.Graph at 0x110591ed8>"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ig = IGraph.TupleList(data)\n",
    "\n",
    "ig"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[u'Nicole', u'Mountain Dew']"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "best = ig.vs.select(_degree = ig.maxdegree())[\"name\"]\n",
    "best"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true,
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# jgraph\n",
    "\n",
    "`jgraph` will plot tuple lists as 3D graphs."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-e5858112-6b1b-4a8b-a2d0-9fd12402e901\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {jgraph: ['nbextensions/jgraph.min', 'https://rawgit.com/patrickfuller/jgraph/master/js/build/jgraph.min']}});\n",
       "           require(['jgraph'], function () {\n",
       "               var $d = $('#graph-e5858112-6b1b-4a8b-a2d0-9fd12402e901');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.jgraph = jQuery.extend({}, jgraph);\n",
       "               $d.jgraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true,\n",
       "                                     showSave: false});\n",
       "               $d.jgraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 1, \"target\": 2 },\n",
       "        { \"source\": 2, \"target\": 3 },\n",
       "        { \"source\": 3, \"target\": 4 },\n",
       "        { \"source\": 4, \"target\": 1 },\n",
       "        { \"source\": 4, \"target\": 5 },\n",
       "        { \"source\": 5, \"target\": 2 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"1\": { \"location\": [ -2.000, -2.000, -2.000 ] },\n",
       "        \"2\": { \"location\": [ -0.937, -0.880, -0.880 ] },\n",
       "        \"3\": { \"location\": [ 0.097, -0.034, 0.072 ] },\n",
       "        \"4\": { \"location\": [ 0.833, 0.991, 0.975 ] },\n",
       "        \"5\": { \"location\": [ 2.000, 2.000, 1.911 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.jgraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import jgraph\n",
    "\n",
    "jgraph.draw([(1, 2), (2, 3), (3, 4), (4, 1), (4, 5), (5, 2)])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-05eda452-7c0b-43d4-be20-71cf749393a6\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {jgraph: ['nbextensions/jgraph.min', 'https://rawgit.com/patrickfuller/jgraph/master/js/build/jgraph.min']}});\n",
       "           require(['jgraph'], function () {\n",
       "               var $d = $('#graph-05eda452-7c0b-43d4-be20-71cf749393a6');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.jgraph = jQuery.extend({}, jgraph);\n",
       "               $d.jgraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true,\n",
       "                                     showSave: false});\n",
       "               $d.jgraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 0, \"target\": 2 },\n",
       "        { \"source\": 0, \"target\": 3 },\n",
       "        { \"source\": 1, \"target\": 2 },\n",
       "        { \"source\": 4, \"target\": 3 },\n",
       "        { \"source\": 5, \"target\": 2 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"0\": { \"location\": [ -2.000, -2.000, -2.000 ] },\n",
       "        \"1\": { \"location\": [ -2.000, -1.744, -1.586 ] },\n",
       "        \"2\": { \"location\": [ -0.308, -0.808, -0.318 ] },\n",
       "        \"3\": { \"location\": [ 1.437, 0.751, 0.794 ] },\n",
       "        \"4\": { \"location\": [ 1.186, 1.839, 1.368 ] },\n",
       "        \"5\": { \"location\": [ 2.000, 2.000, 2.000 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.jgraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "data = graph.cypher.execute(\"MATCH (n)-->(m) RETURN ID(n), ID(m)\")\n",
    "data = [tuple(x) for x in data]\n",
    "\n",
    "jgraph.draw(data)"
   ]
  }
 ],
 "metadata": {
  "celltoolbar": "Slideshow",
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
