{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# Hello World\n",
    "\n",
    "This notebook walks through basic code examples for integrating various packages with Neo4j, including `py2neo`, `ipython-cypher`, `pandas`, `networkx`, `igraph`, and `jgraph`."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# py2neo\n",
    "\n",
    "`py2neo` is one of Neo4j's Python drivers. It offers a fully-featured interface for interacting with your data in Neo4j. Install `py2neo` with `pip install py2neo`."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Connect\n",
    "\n",
    "Connect to Neo4j with the `Graph` class."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "\n",
    "graph = Graph()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": true,
    "slideshow": {
     "slide_type": "skip"
    }
   },
   "outputs": [],
   "source": [
    "graph.delete_all()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Nodes\n",
    "\n",
    "Create nodes with the `Node` class. The first argument is the node's label. The remaining arguments are an arbitrary amount of node properties or key-value pairs."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [],
   "source": [
    "from py2neo import Node\n",
    "\n",
    "nicole = Node(\"Person\", name=\"Nicole\", age=24)\n",
    "drew = Node(\"Person\", name=\"Drew\", age=20)\n",
    "\n",
    "mtdew = Node(\"Drink\", name=\"Mountain Dew\", calories=9000)\n",
    "cokezero = Node(\"Drink\", name=\"Coke Zero\", calories=0)\n",
    "\n",
    "coke = Node(\"Manufacturer\", name=\"Coca Cola\")\n",
    "pepsi = Node(\"Manufacturer\", name=\"Pepsi\")\n",
    "\n",
    "graph.create(nicole | drew | mtdew | cokezero | coke | pepsi)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph-60cae15e-5956-4f63-8b33-b5dd4df2a566.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x108166eb8>"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from scripts.vis import draw\n",
    "\n",
    "options = {\"Person\": \"name\", \"Drink\": \"name\", \"Manufacturer\": \"name\"}\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "skip"
    }
   },
   "source": [
    "P.S. - If you want to check out what's going on behind the scenes for the `draw()` function used above, take a look at [`scripts/vis.py`](https://github.com/nicolewhite/neo4j-jupyter/blob/master/scripts/vis.py)."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Relationships\n",
    "\n",
    "Create relationships between nodes with the `Relationship` class."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph-42c446ae-32a6-4e8a-8d82-d61c9820b317.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x1081876a0>"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Relationship\n",
    "\n",
    "graph.create(Relationship(nicole, \"LIKES\", cokezero))\n",
    "graph.create(Relationship(nicole, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(drew, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(coke, \"MAKES\", cokezero))\n",
    "graph.create(Relationship(pepsi, \"MAKES\", mtdew))\n",
    "\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Cypher\n",
    "\n",
    "Retrieve Cypher query results with `Graph.cypher.execute`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "('name': 'Drew', 'drink': 'Mountain Dew')\n",
      "('name': 'Nicole', 'drink': 'Mountain Dew')\n",
      "('name': 'Nicole', 'drink': 'Coke Zero')\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name AS name, drink.name AS drink\n",
    "\"\"\"\n",
    "\n",
    "data = graph.run(query)\n",
    "\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Parameterized Cypher\n",
    "\n",
    "Pass parameters to Cypher queries by passing additional key-value arguments to `Graph.cypher.execute.` Parameters in Cypher are named and are wrapped in curly braces."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "('name': 'Nicole', 'avg_calories': 4500.0)\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p:Person)-[:LIKES]->(drink:Drink)\n",
    "WHERE p.name = {name}\n",
    "RETURN p.name AS name, AVG(drink.calories) AS avg_calories\n",
    "\"\"\"\n",
    "\n",
    "data = graph.run(query, name=\"Nicole\")\n",
    "\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# ipython-cypher\n",
    "\n",
    "`ipython-cypher` exposes `%cypher` magic in Jupyter. Install `ipython-cypher` with `pip install ipython-cypher`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": true,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Cypher\n",
    "\n",
    "`%cypher` is intended for one-line Cypher queries and `%%cypher` is intended for multi-line Cypher queries. Placing `%%cypher` above a Cypher query will display that query's results."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>person.name</th>\n",
       "        <th>drink.name</th>\n",
       "        <th>drink.calories</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Drew</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Coke Zero</td>\n",
       "        <td>0</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Drew', 'Mountain Dew', 9000],\n",
       " ['Nicole', 'Mountain Dew', 9000],\n",
       " ['Nicole', 'Coke Zero', 0]]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name, drink.name, drink.calories"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Pandas Data Frames\n",
    "\n",
    "Cypher query results can be coerced to `pandas` data frames with the `get_dataframe` method. To assign Cypher query results to a variable, you need to use `%cypher` and separate lines with \\\\. You'll first need to install `pandas` with `pip install pandas`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Drew</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Coke Zero</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name         drink\n",
       "0    Drew  Mountain Dew\n",
       "1  Nicole  Mountain Dew\n",
       "2  Nicole     Coke Zero"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = %cypher MATCH (person:Person)-[:LIKES]->(drink:Drink) \\\n",
    "                  RETURN person.name AS name, drink.name AS drink\n",
    "    \n",
    "df = results.get_dataframe()\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "RangeIndex(start=0, stop=3, step=1)"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.index"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Coke Zero</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name      drink\n",
       "1  Nicole  Coke Zero"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.iloc[[1]]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0      Drew\n",
       "1    Nicole\n",
       "2    Nicole\n",
       "Name: name, dtype: object"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df[\"name\"]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## NetworkX Graphs\n",
    "\n",
    "Cypher query results can be coerced to `NetworkX` MultiDiGraphs, graphs that permit multiple edges between nodes, with the `get_graph` method. You'll first need to install `NetworkX` with `pip install networkx`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAeIAAAFBCAYAAACrYazjAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAHrZJREFUeJzt3XtwVfW99/HPjiC5EgKES7gk5Eqyk5AiUdsO1Y71UBBx\nsI5PRzDA06k99NQiczgg01pLvaRgWsQ6YlE0otRjW2+9QJ0eddByiiRWBJJASAIk3EwgmyQkO4Qk\n6/mjsh/StRGS7OS3L+/XTEdnzc7Kl15897f2Wr/lsCzLEgAAMCLM9AAAAIQyQgwAgEGEGAAAgwgx\nAAAGEWIAAAwixAAAGESIAQAwiBADAGAQIQYAwCBCDACAQYQYAACDCDEAAAYRYgAADCLEAAAYRIgB\nADCIEAMAYBAhBgDAIEIMAIBBhBgAAIMIMQAABhFiAAAMIsQAABhEiAEAMIgQAwBgECEGAMAgQgwA\ngEGEGAAAgwgxAAAGEWIAAAwixAAAGESIAQAwiBADAGAQIQYAwCBCDACAQYQYAACDCDEAAAYRYgAA\nDCLEAAAYRIgBADCIEAMAYBAhBgDAIEIMAIBBhBgAAIOGmB4gGNTX12tLcbEq9+7VuaYmRcfGKj03\nV4uWLFF8fLzp8QAAfsxhWZZleohAVVJSog2Fhfrz9u26U1J+e7tiJLVI2h0RoTctS7fNnq1lq1cr\nPz/f8LQAAH9EiPto08aNenjFCq1yu7XIshTn5TMuScUOh9ZFRGhNUZHuW7p0sMcEAPg5QtwHmzZu\n1NoVK/ROW5tSr+LzVZJmRUZqFTEGAPwLQtxLJSUlmnfzzfrwKiN8UZWkmZGR+uOOHZoxY8ZAjQcA\nCDDcNd1LGwoLtcrt7lWEJSlV0kq3WxsKCwdiLABAgGJF3Av19fXKSExUTXu71++Er6RRUkp4uCpr\na7mbGgAgiRVxr2wpLtZ8qU8RlqSRkuY7HNpSXOy7oQAAAY0Q90Ll3r26vr29X+fId7tVuW+fjyYC\nAAQ6QtwL55qaFNPPc8RIanG5fDEOACAIsLNWL0THxqqln+dokfSX//kf3XLLLXI6nXI6ncrKypLT\n6dTIkSN9MSYAIIAQ4l5Iz83V7tdf17/34/L07ogI/cfy5frqzJkqKyvT7t279eKLL6q8vFxRUVGe\nOF8a6Li4vn4rDQDwd9w13QsDede0ZVmqq6tTWVmZysrKVF5e7vlrTExMj0BfjPSIESN88ucCAJhD\niHtp4Z13asZbb+mBPvzbtt7h0D/mz9fLr79+1T/T3d192UDHxsZ6DXRsbGyvZwMAmEGIe8lfdtbq\n7u5WbW2tJ9AX41xRUaERI0Z4DfTw4cP7/XsBAL5FiPvAn/ea7u7u1tGjR3sEuqysTAcOHNCoUaM8\n3ztfGuiYmP7eCw4A6CtC3EcX37600u3W4su8falR/3z70hN+8Pal7u5uHTlyxGug4+PjvQY6Ojra\n2LwAECoIcT+UlpZqQ2Gh/rRtm+Y7HMp3uz3vIy75/H3Ec+fM0bLVq/32RQ9dXV1eA33w4EGNGTOm\nx93bTqdTmZmZBBoAfIgQ+0BDQ4O2FBerct8+tbhciomLU3pOjgoWLw7YPaW7urp0+PBhW6ArKys1\nduxYr4GOiooyPTYABBxCjF7p6upSTU2N10CPHz/e9gx0ZmamIiMjTY8NAH6LEMMnOjs7VV1d7Xm8\n6uK/Dh06pISEBNv3z5mZmYqIiDA9NgAYR4gxoDo7O1VVVWULdFVVlSZMmGB7zCojI4NAAwgphBhG\nXLhwQVVVVT02KSkrK1N1dbUmTpzoNdDh4eGmxwYAnyPE8CsXLlzQoUOHbIGuqanRpEmTvAZ62LBh\npscGgD4jxAgIHR0dnkBfGumamholJibaAp2enk6gAQQEQoyA1tHRocrKSlugjxw5oqSkJNtGJenp\n6br22mtNjw0AHoQYQen8+fM9An0x0kePHtWUKVNsgU5LSyPQAIwgxAgp58+f18GDB22Brq2tVXJy\nsm2jkrS0NA0dOtT02ACCGCEGJLW3t9sCXVZWpmPHjiklJcUW6NTUVAINwCcIMfAF3G6310AfP35c\nqampto1KUlNTNWTIENNjAwgghBjoA7fbrQMHDtgCfeLECaWlpdkCnZKSQqABeEWIAR9qa2vzGuhT\np07ZAu10OpWcnKxrrrnG9NgADCLEwCBobW31GujPPvtM6enptkBPmTKFQAMhghADBp07d04VFRW2\nvbjr6+uVkZHhNdBhYWGmxwbgQ4QY8EMtLS1eA3369GmvgU5KSiLQQIAixEAAaWlp8cT50kg3NjZq\n6tSpto1KEhMTCTTg5wgxEASam5u9BtrlcikzM9P2HPTkyZMJNOAnCDEQxJqamnqE+eLfNzU1XTbQ\nDofD9NhASCHEQAg6e/as10A3Nzf3CPPFv580aRKBBgYIIQbg4XK5bDeIlZeX69y5c7bvn7OysjRx\n4sQega6rq9OPf/zjHp/le2rgixFiAFfU2NjoNdBtbW09otvS0qKHH364x89GRUV5LoNfusrme2rg\nnwgxgD47c+ZMj0Bv27ZNNTU1V/WzUVFRXlfZfE+NUEOIAfjMvffeq1deeaVf54iOjrYF2ul02i6D\nA8GCEAPwmd27d2vXrl09bgBzuVw+OXdMTIzXQE+YMMF4oOvr67WluFiVe/fqXFOTomNjlZ6bq0VL\nlig+Pt7obPB/hBjAgLEsS6dOnbLtsX3xESpfGD58uNdAJyQkDHigS0pKtKGwUH/evl13Sspvb1eM\npBZJuyMi9KZl6bbZs7Vs9Wrl5+cP6CwIXIQYwKCzLEsnT570Gujm5maf/I7Y2Fjbc9JOp1Pjx4/3\nSaA3bdyoh1es0Cq3W4ssS3FePuOSVOxwaF1EhNYUFem+pUv7/XsRfAgxAL9hWZZOnDjhNdAtLS0+\n+R0jRoyw3cHtdDo1bty4qw70po0btXbFCr3T1qbUq/h8laRZkZFaRYzhBSEG4Pcsy9KxY8e8PkLl\nq0DHxcXZ7uB2Op0aO3Zsj0CXlJRo3s0368OrjPBFVZJmRkbqjzt2aMaMGT6ZGcGBEAMIWJZlqa6u\nzrbH9sVNSHxh5MiRPQL9x//+b33zf/9Xy/vwj871Dof+MX++Xn79dZ/MhuBAiAEEne7ubk+gL410\neXm5Wltb+3XucEknJK/fCV9Jo6SU8HBV1tZyNzU8CDGAkNHd3a3a2lqvgW5ra7vizzsk/R9Jr/Zj\nhv8bESHnmjX6z//6r36cBcFkiOkBAGCwhIWFKSkpSUlJSbrttts8x7u7u3X06FHbDWIVFRVyu92e\nz4VLuqmfM+S73dqzb18/z4JgQogBhLywsDBNmTJFU6ZM0dy5cz3Hu7u7deTIEU+YX3r6acUcP96v\n3xUjqcVHm5wgOBBiALiMsLAwJScnKzk5Wbfffrtq9u9Xy9at/Tpni6SYuL58w4xgxatPAOAqpefm\nand4eL/OURIRofScHB9NhGDAzVoAcJXq6+uVkZiomvZ27pqGz7AiBoCrNGbMGN02e7Ze6uMWmS85\nHJo7Zw4RRg+siAGgF9hZC77GihgAeiE/P19rioo0KzJSVVf5M1WSvuZwaOWaNUQYNoQYAHrpvqVL\ntaqoSDMjI7Xe4dDlHkZqlPSEpOsknbIs7dy1S1yExL/i0jQA9FFpaak2FBbqT9u2ab7DoXy32/M+\n4pKICP2uo0NdXV1yX/IzL7zwgpYsWWJoYvgjQgwA/dTQ0KAtxcWq3LdPLS6XYuLilJ6To2/fc4/u\nuOMOffzxx57PRkdH65NPPlFqam++YUYwI8QAMIAOHjyo6dOn99jL+oYbbtCHH36ooUOHGpwM/oLv\niAFgAGVkZGj9+vU9jn300Ud69NFHDU0Ef8OKGAAGmGVZmj9/vt5++23PsbCwMH3wwQf66le/anAy\n+ANCDACD4PTp08rJydGpU6c8x5KSkrRnzx7FxsYanAymcWkaAAbB6NGjVVxc3OPYkSNHdP/995sZ\nCH6DEAPAIJk1a5YeeOCBHsdefvllvfrqq4Ymgj/g0jQADKL29nZdf/312rdvn+dYbGysPv30UyUm\nJhqcDKawIgaAQRQeHq6tW7dq2LBhnmNNTU0qKChQV1eXwclgCiEGgEGWk5OjtWvX9jj2wQcfaN26\ndYYmgklcmgYAA7q7uzVnzhy98847nmNDhgzR3//+d14MEWIIMQAYcvLkSeXm5ur06dOeY2lpafrk\nk08UFRVlcDIMJi5NA4Ah48eP1+bNm3scO3TokJYvX25oIphAiAHAoHnz5ul73/tej2PPPfec3nrr\nLUMTYbBxaRoADGttbdV1112ngwcPeo6NGjVKe/fuVUJCgsHJMBhYEQOAYVFRUdq6dauGDBniOXbm\nzBktXrxY3d3dBifDYCDEAOAHrrvuOtsbmf7617/qqaeeMjQRBguXpgHAT3R1demWW27Rjh07PMeu\nvfZalZSUKDc31+BkGEiEGAD8SF1dnXJzc3X27FnPsezsbO3evVsREREGJ8NA4dI0APiRSZMm6de/\n/nWPY/v379eDDz5oaCIMNEIMAH7m7rvvVkFBQY9j7777rtra2gxNhIHEpWkA8EPNzc3Ky8vT4cOH\nFR4erh07duj66683PRYGACEGAD+1a9cuNTY2qqGhQUVFRXxPHKQIMQD4Ocuy9O1vf1vjxo3Thg0b\nTI8DHyPEABAAXC6Xpk2bpk2bNumb3/ym6XHgQ4QYAALE+++/r4ULF2rPnj2Kj483PQ58hBADQAB5\n8MEHVV5errffflsOh8P0OPABHl8CgADys5/9TMePH7c9a4zAxYoYAALMgQMHNHPmTH344YeaOnWq\n6XHQT6yIASDATJ06VY888ogWLFigjo4O0+Ogn1gRA0AAsixLd9xxh7KysvTzn//c9DjoB0IMAAGq\noaFBeXl5euWVV/T1r3/d9DjoIy5NA0CAio+P1+bNm7Vo0SK5XC7T46CPWBEDQIBbtmyZTp48qdde\ne41HmgIQK2IACHBr165VRUWFtmzZYnoU9AErYgAIAnv37tUtt9yiXbt2KSUlxfQ46AVWxAAQBHJz\nc/WjH/1ICxcuVGdnp+lx0AuEGACCxA9/+EPFxMTo0UcfNT0KeoFL0wAQRE6cOKHp06frjTfe0Fe+\n8hXT4+AqsCIGgCCSkJCgZ599VgsXLlRzc7PpcXAVWBEDQBC67777dP78eb300kumR8EVsCIGgCC0\nfv167dq1S6+99prpUXAFrIgBIEiVlpZqzpw5Ki0t1eTJk02Pg8tgRQwAQWrGjBlavny5CgoK1NXV\nZXocXAYhBoAgtnLlSlmWpaKiItOj4DK4NA0AQa62tlYzZszQ9u3bdd1115keB/+CFTEABLnJkyfr\nqaee0oIFC9Ta2mp6HPwLVsQAECIKCgoUGRmpZ5991vQouAQhBoAQ0dzcrGnTpunJJ5/UHXfcYXoc\nfI4QA0AI2blzp771rW/pk08+0fjx402PAxFiAAg5Dz/8sHbt2qXt27crLIxbhUzjPwEACDEPPfSQ\nmpqa9Ktf/cr0KBArYgAISdXV1brxxhv13nvvKScnx/Q4IY0VMQCEoJSUFK1bt0733HOP2tvbTY8T\n0lgRA0CIsixLd999tyZOnKj169ebHidkEWIACGGNjY2aNm2ann/+ec2aNcv0OCGJEANAiHvvvfd0\n7733as+ePYqPjzc9TsghxAAArVy5UpWVlXrzzTflcDhMjxNSuFkLAKBHHnlEtbW1eu6550yPEnJY\nEQMAJEkVFRWaOXOmdu7cqYyMDNPjhAxWxAAASVJmZqYeeeQRLViwQB0dHabHCRmsiAEAHpZlad68\necrOzlZhYaHpcUICIQYA9FBfX6+8vDy9+uqruummm0yPE/S4NA0A6GHMmDHavHmzCgoK5HK5TI8T\n9FgRAwC8uv/++9XQ0KBXX32VR5oGECtiAIBX69at0759+/TKK6+YHiWosSIGAFzWp59+qm984xv6\n6KOPlJycbHqcoMSKGABwWdOmTdPq1au1cOFCdXZ2mh4nKBFiAMAXeuCBBxQVFaXHH3/c9ChBiUvT\nAIArOnHihL70pS/p7bff1o033mh6nKDCihgAcEUJCQl69tlntWDBArW0tJgeJ6iwIgYAXLXvfve7\n6uzs1Isvvmh6lKDBihgAcNXWr1+vnTt36ne/+53pUYIGK2IAQK+UlJRo7ty5Ki0t1aRJk0yPE/BY\nEQMAeiU/P1/Lli1TQUGBurq6TI8T8AgxAKDXVq1apa6uLv3iF78wPUrA49I0AKBPjh49qvz8fP3l\nL3/R9OnTTY8TsFgRAwD6JDExUU8++aTuuecetbW1mR4nYLEiBgD0y8KFCzV8+HA988wzpkcJSIQY\nANAvTU1NysvL01NPPaXbb7/d9DgBhxADAPrtb3/7m+666y7t2bNH48aNMz1OQCHEAACfeOihh1Ra\nWqpt27bJ4XCYHidgcLMWAMAnfvKTn6ixsVFPP/206VECCitiAIDPVFVV6ctf/rLef/99ZWdnmx4n\nILAiBgD4TGpqqtauXasFCxaovb3d9DgBgRUxAMCnLMvSXXfdpcTERP3yl780PY7fI8QAAJ87c+aM\n8vLy9MILL+jWW281PY5fI8QAgAHx7rvvatGiRdqzZ49Gjx5tehy/RYgBAANmxYoVqq6u1htvvMEj\nTZfBzVoAgAHz2GOP6fDhw9q8ebPpUfwWK2IAwIAqLy/XTTfdpJ07dyo9Pd30OH6HFTEAYEBlZWXp\npz/9qRYsWKALFy6YHsfvsCIGAAw4y7I0d+5c5eXl6bHHHjM9jl8hxACAQfHZZ58pLy9Pr732mr72\nta+ZHsdvcGkaADAoxo4dq+eff14FBQU6e/as6XH8BitiAMCg+sEPfqAzZ87oN7/5DY80iRUxAGCQ\nPfHEE/r000+1detW06P4BVbEAIBBt2fPHt16663avXu3pkyZYnoco1gRAwAGXV5enh588EHde++9\n6uzsND2OUYQYAGDE8uXLFR4ersLCQtOjGMWlaQCAMcePH9f06dP1hz/8QTfccIPpcYxgRQwAMGbC\nhAl65plntGDBArW0tJgexwhWxAAA477zne9IUki+HIIVMQDAuA0bNuiDDz7Q73//e9OjDDpWxAAA\nv/DRRx9p3rx5+vjjjzVx4kRJUn19vbYUF6ty716da2pSdGys0nNztWjJEsXHxxue2DcIMQDAbzz6\n6KN6//339fjjj+tXa9fqz9u3605J+e3tipHUIml3RITetCzdNnu2lq1erfz8fMNT9w8hBgD4ja6u\nLmVmZMhVW6sfdXZqkWUpzsvnXJKKHQ6ti4jQmqIi3bd06WCP6jNDTA8AAMBFmzdtUufx4/r7hQtK\n/YLPxUlablm6va1Ns1askKSAjTErYgCAXygpKdG8m2/Wh21tXxjhf1UlaWZkpP64Y4dmzJgxUOMN\nGO6aBgD4hQ2FhVrldvcqwpKUKmml260NAbpDFytiAIBx9fX1ykhMVE17u9fvhK+kUVJKeLgqa2sD\n7m5qVsQAAOO2FBdrvtSnCEvSSEnzHQ5tKS723VCDhBADAIyr3LtX17e39+sc+W63Kvft89FEg4cQ\nAwCMc50+rZh+niNGUovL5YtxBhWPLwEABk1ra6vKy8tVVlam/fv3e/7adPKkbunnuVskxcT19eK2\nOYQYAOBzbrdbBw4c6BHcsrIynTp1ShkZGcrOzpbT6dT3v/99ZWdn6/e//a12//Sn+vd+XJ4uiYiQ\nMyfHh3+KwcFd0wCAPuvo6NDBgwdtwa2rq1NqaqqcTqcnutnZ2UpOTtY111xjO08o3zVNiAEAV3Th\nwgVVVVXZgnv48GElJSX1CK7T6VRaWpqGDh3aq9+x8M47NeOtt/RAH7K03uHQP+bP18uvv97rnzWN\nEAMAPLq6ulRTU2ML7qFDhzRx4kRbcDMyMjRs2DCf/O5Q3VmLEANACOru7tbRo0dtwT1w4IDGjh1r\nC+7UqVMVGRk54HNt2rhRa1es0DtXGeMqSbMiI7UqgF/8QIgBIIhZlqVjx455QnsxuhUVFRoxYoQn\ntBejm5WVpejoaKMzb9q4UQ+vWKGVbrcWX+btS43659uXngiCty8RYgAIApZl6dSpU7bglpWVKTIy\n0mtwR4wYYXrsyyotLdWGwkL9ads2zXc4lO92e95HXPL5+4jnzpmjZatXB+Tl6EsRYgAIMA0NDZ7I\nXhpdh8PR4w7li/EdNWqU6ZH7rKGhQVuKi1W5b59aXC7FxMUpPSdHBYsXB9zd0ZdDiAHAT7lcLq/B\n7ejosK1wnU6nxowZI4fDYXps9BIhBgDDmpubPbtNXRrclpYWZWVl2YKbkJBAcIMIIQaAQdLa2qqK\nigpbcE+fPq3MzEzbKnfy5MkENwQQYgDwsfb2ds/2jpcG9+TJk0pPT7cFNykpyetuUwgNhBgA+qij\no0OHDh3q8fKCsrIy1dbWKiUlxRbclJQUDRnCFv/oiRADwBV0dnaqurq6xyNB+/fvV01NjRITE23B\nTUtL07XXXmt6bAQIQgwAn+vu7tbhw4dtwT106JASEhJswc3IyFB4eLjpsRHgCDGAkGNZlmpra23B\nPXDggEaPHm17FjczM3NQtndEaCLEAIKWZVk6ceKELbjl5eUaPnx4j0eCsrOzlZWVpZiYGNNjI8QQ\nYgABz7Is1dfX24JbVlamYcOGeQ1uXFxf3noL+B4hBhBQzpw5Y9tLef/+/bIsy/YSeqfTqdGjR5se\nGfhChBiAX2pqavIaXLfbbdtpKjs7W2PHjmXzCwQkQgzAqHPnzqm8vNwW3LNnzyorK8sW3AkTJhBc\nBBVCDGBQuN1uz/aOl26AUV9fr6lTp9qCO3nyZIWFhZkeGxhwhBiAT50/f14HDx60XVY+duyY0tLS\nbMGdMmUK2zsipBFiAH1y4cIFHTp0yBbcI0eOaMqUKbbgpqamsr0j4AUhBvCFurq6VF1dbQtuVVWV\nJk2aZLtxKj09XcOGDTM9NhAwCDEASf/c3vHIkSO24B48eFDjxo2zBXfq1KmKiIgwPTYQ8AgxEEQs\ny9KxY8dUVlamqKgozZw50+tn6urqbBtfVFRUaOTIkbbgZmZmKjo62sCfBggNhBgIQJZl6dSpU7bV\na1lZmZqbmyVJ8+bN08aNG23BLS8vV1RUlC24WVlZio2NNfwnA0IPIQb8XENDgy2m+/fvl8vl+sKf\nCwsL06hRo2zBdTqdGjly5CBND+BKCDHgJ1wul9cVbn19fZ/O53A4dO7cOd4aBPg5niVA0Kuvr9eW\n4mJV7t2rc01Nio6NVXpurhYtWaL4+PhBn6e5udnrTlInT570yfljYmI8K+DW1lZCDPg5VsQIWiUl\nJdpQWKg/b9+uOyXlt7crRlKLpN0REXrTsnTb7Nlatnq18vPzff77W1tbve4kVVdX55PzR0ZG9rjc\nfDG+EydOZAtIIIAQYgSlTRs36uEVK7TK7dYiy5K3F965JBU7HFoXEaE1RUW6b+nSPv2u9vZ2HThw\nwHZJ+fDhw/LF/7yGDRumzMxM2wYZiYmJbAEJBAFCjKCzaeNGrV2xQu+0tSn1Kj5fJWlWZKRWXSHG\nHR0dqqystF1Srq6uVnd3d7/nHjp0qDIyMmzBTU5OZgtIIIgRYgSVkpISzbv5Zn14lRG+qErSzMhI\n/XHHDuXl5amqqsp241RlZaU6Ozv7PeM111yjtLQ027tzU1NTNXTo0H6fH0BgIcQIKgvvvFMz3npL\nD/Thv9a/kFQ0fLga29vV0dHR71kcDodSUlJsjw9lZGSwBSQAD0KMoFFfX6+MxETVtLd7/U74Shol\nTZDU3oefTUpK8roFJHcsA7gSHl9C0NhSXKz5Up8iLEkjJd0h6beSLvf/TidOnOh1Ryq2gATQV4QY\nQaNy715d396X9ez/d5OktyWN+PwlB5dGNysrSyNGjPDJrABwESFG0DjX1KSYfp4jRtJt//Zv+v07\n7/hiJAC4Ih5CRNCIjo1VSz/P0SJp1NixvhgHAK4KIUbQSM/N1e7w8H6doyQiQuk5OT6aCACujLum\nETR8cdd0Sni4KmtrjexBDSA0sSJG0BgzZoxumz1bL/Vxn+WXHA7NnTOHCAMYVKyIEVR8sbPWjBkz\nBmo8ALBhRYygkp+frzVFRZoVGamqq/yZi3tNrykqIsIABh0hRtC5b+lSrSoq0szISK13OOS6zOca\nJf3S4dDMq3jhAwAMFC5NI2iVlpZqQ2Gh/rRtm+Y7HMp3uz3vIy75/H3Ec+fM0bLVq1kJAzCGECPo\nNTQ0aEtxsSr37VOLy6WYuDil5+SoYPFibswCYBwhBgDAIL4jBgDAIEIMAIBBhBgAAIMIMQAABhFi\nAAAMIsQAABhEiAEAMIgQAwBgECEGAMAgQgwAgEGEGAAAgwgxAAAGEWIAAAwixAAAGESIAQAwiBAD\nAGAQIQYAwCBCDACAQYQYAACDCDEAAAYRYgAADCLEAAAYRIgBADCIEAMAYBAhBgDAIEIMAIBBhBgA\nAIMIMQAABhFiAAAMIsQAABhEiAEAMIgQAwBgECEGAMAgQgwAgEGEGAAAgwgxAAAGEWIAAAwixAAA\nGESIAQAwiBADAGAQIQYAwCBCDACAQYQYAACDCDEAAAYRYgAADCLEAAAYRIgBADCIEAMAYBAhBgDA\nIEIMAIBBhBgAAIP+H2glV36FSYjAAAAAAElFTkSuQmCC\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x10c64b2b0>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import networkx as nx\n",
    "%matplotlib inline\n",
    "\n",
    "results = %cypher MATCH p = (:Person)-[:LIKES]->(:Drink) RETURN p\n",
    "\n",
    "g = results.get_graph()\n",
    "\n",
    "nx.draw(g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('4013', {'age': 24, 'labels': ['Person'], 'name': 'Nicole'}),\n",
       " ('4011', {'calories': 9000, 'labels': ['Drink'], 'name': 'Mountain Dew'}),\n",
       " ('4012', {'calories': 0, 'labels': ['Drink'], 'name': 'Coke Zero'}),\n",
       " ('4010', {'age': 20, 'labels': ['Person'], 'name': 'Drew'})]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.nodes(data=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'4010': 1, '4011': 2, '4012': 1, '4013': 2}"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nx.degree(g)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# igraph\n",
    "\n",
    "Cypher query results can be imported into `igraph` with `py2neo`. You'll need to install `igraph` with `pip install python-igraph`. Query results should be returned as edgelists, as `igraph` has a method for building an `igraph` object from a list of tuples representing edges between nodes."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph as PGraph\n",
    "from igraph import Graph as IGraph\n",
    "\n",
    "neo4j = PGraph()\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name AS source, drink.name AS target\n",
    "\"\"\"\n",
    "\n",
    "data = neo4j.run(query)\n",
    "tups = []\n",
    "\n",
    "for d in data:\n",
    "    tups.append((d[\"source\"], d[\"target\"]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<igraph.Graph at 0x10c65ae58>"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ig = IGraph.TupleList(tups)\n",
    "\n",
    "ig"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Mountain Dew', 'Nicole']"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "best = ig.vs.select(_degree = ig.maxdegree())[\"name\"]\n",
    "best"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true,
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# jgraph\n",
    "\n",
    "`jgraph` will plot tuple lists as 3D graphs."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-be94aa82-45c2-46d8-b718-c149477901c0\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {jgraph: ['nbextensions/jgraph.min', 'https://rawgit.com/patrickfuller/jgraph/master/js/build/jgraph.min']}});\n",
       "           require(['jgraph'], function () {\n",
       "               var $d = $('#graph-be94aa82-45c2-46d8-b718-c149477901c0');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.jgraph = jQuery.extend({}, jgraph);\n",
       "               $d.jgraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true,\n",
       "                                     showSave: false});\n",
       "               $d.jgraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 1, \"target\": 2 },\n",
       "        { \"source\": 2, \"target\": 3 },\n",
       "        { \"source\": 3, \"target\": 4 },\n",
       "        { \"source\": 4, \"target\": 1 },\n",
       "        { \"source\": 4, \"target\": 5 },\n",
       "        { \"source\": 5, \"target\": 2 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"1\": { \"location\": [ -2.000, -2.000, -2.000 ] },\n",
       "        \"2\": { \"location\": [ -0.734, -1.093, -0.864 ] },\n",
       "        \"3\": { \"location\": [ 0.071, -0.301, -0.151 ] },\n",
       "        \"4\": { \"location\": [ 1.018, 0.904, 1.360 ] },\n",
       "        \"5\": { \"location\": [ 2.000, 2.000, 2.000 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.jgraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import jgraph\n",
    "\n",
    "jgraph.draw([(1, 2), (2, 3), (3, 4), (4, 1), (4, 5), (5, 2)])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-800ba9f2-587c-4705-b84f-50dc9732c53b\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {jgraph: ['nbextensions/jgraph.min', 'https://rawgit.com/patrickfuller/jgraph/master/js/build/jgraph.min']}});\n",
       "           require(['jgraph'], function () {\n",
       "               var $d = $('#graph-800ba9f2-587c-4705-b84f-50dc9732c53b');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.jgraph = jQuery.extend({}, jgraph);\n",
       "               $d.jgraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true,\n",
       "                                     showSave: false});\n",
       "               $d.jgraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 4010, \"target\": 4011 },\n",
       "        { \"source\": 4013, \"target\": 4011 },\n",
       "        { \"source\": 4013, \"target\": 4012 },\n",
       "        { \"source\": 4014, \"target\": 4012 },\n",
       "        { \"source\": 4015, \"target\": 4011 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"4010\": { \"location\": [ -2.000, -2.000, -2.000 ] },\n",
       "        \"4011\": { \"location\": [ -1.523, -1.512, -1.419 ] },\n",
       "        \"4012\": { \"location\": [ -0.185, -0.630, -0.443 ] },\n",
       "        \"4013\": { \"location\": [ 0.327, 0.510, 0.468 ] },\n",
       "        \"4014\": { \"location\": [ 1.460, 1.429, 1.237 ] },\n",
       "        \"4015\": { \"location\": [ 2.000, 2.000, 2.000 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.jgraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "data = graph.run(\"MATCH (n)-->(m) RETURN ID(n), ID(m)\")\n",
    "data = [tuple(x) for x in data]\n",
    "\n",
    "jgraph.draw(data)"
   ]
  }
 ],
 "metadata": {
  "celltoolbar": "Slideshow",
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.5.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
