{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# ipython-cypher\n",
    "\n",
    "`ipython-cypher` exposes `%cypher` magic in Jupyter. Install `ipython-cypher` with `pip install ipython-cypher`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Cypher\n",
    "\n",
    "`%cypher` is intended for one-line Cypher queries and `%%cypher` is intended for multi-line Cypher queries. Placing `%%cypher` above a Cypher query will display that query's results."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>person.name</th>\n",
       "        <th>drink.name</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Coke Zero</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Drew</td>\n",
       "        <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[u'Nicole', u'Mountain Dew'],\n",
       " [u'Nicole', u'Coke Zero'],\n",
       " [u'Drew', u'Mountain Dew']]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name, drink.name"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Pandas Data Frames\n",
    "\n",
    "Cypher query results can be coerced to `pandas` data frames with the `get_dataframe` method. To assign Cypher query results to a variable, you need to use `%cypher` and separate lines with \\\\. You'll first need to install `pandas` with `pip install pandas`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Drew</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Coke Zero</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name         drink\n",
       "0  Nicole  Mountain Dew\n",
       "1    Drew  Mountain Dew\n",
       "2  Nicole     Coke Zero"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = %cypher MATCH (person)-[:LIKES]->(drink:Drink) \\\n",
    "                  RETURN person.name AS name, drink.name AS drink\n",
    "    \n",
    "df = results.get_dataframe()\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Int64Index([0, 1, 2], dtype='int64')"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.index"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Drew</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   name         drink\n",
       "1  Drew  Mountain Dew"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.iloc[[1]]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0    Nicole\n",
       "1      Drew\n",
       "2    Nicole\n",
       "Name: name, dtype: object"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df[\"name\"]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# NetworkX Graphs\n",
    "\n",
    "Cypher query results can be coerced to `NetworkX` MultiDiGraphs, graphs that permit multiple edges between nodes, with the `get_graph` method. You'll first need to install `NetworkX` with `pip install networkx`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAeMAAAFBCAYAAABEo8fdAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAHhBJREFUeJzt3Xl0VFWCx/FfFrIUgbAHIrtAYlYCwmEfpNtt6CMIglu3\nrUgQYWwFgbiMiuMCCCpqG5EAIjgiS4s73aKNiDQ2IpBKCBAQiDQkAhIgIXtVzR+tGWMIJFWV3FTV\n9/Mfj/cePw7n8Mu97973/BwOh0MAAMAYf9MBAADwdZQxAACGUcYAABhGGQMAYBhlDACAYZQxAACG\nUcYAABhGGQMAYBhlDACAYZQxAACGUcYAABhGGQMAYBhlDACAYZQxAACGUcYAABhGGQMAYBhlDACA\nYZQxAACGUcYAABhGGQMAYBhlDACAYZQxAACGUcYAABhGGQMAYBhlDACAYZQxAACGUcYAABhGGQMA\nYBhlDACAYZQxAACGUcYAABhGGQMAYBhlDACAYZQxAACGUcYAABhGGQMAYBhlDACAYZQxAACGUcYA\nABhGGQMAYBhlDACAYZQxAACGUcYAABhGGQMAYBhlDACAYZQxAACGUcYAABhGGQMAYBhlDACAYZQx\nAACGUcYAABhGGQMAYBhlDACAYZQxAACGUcYAABhGGQMAYBhlDACAYZQxAACGUcYAABgWaDoAAMCz\n2O12bdy4UauWLlXe0aMqKy1Vi1atNPjaa3XnhAlq3bq16Ygex8/hcDhMhwAANH5lZWX688svK/X5\n59WssFB3Fxaqu6QgSaclfWSx6AO7XTeOGqWU2bMVHR1tOLHnoIwBAJd09uxZjb3uOgWkp2t2cbEG\nSPK7wHknJaX5+2thaKj+d/16XX311Q2c1DNRxgCAiyotLdW1Q4YoKiNDqaWlCqjFNV9Kusli0fpP\nP9XgwYPrO6LHo4wBABeV8sADOrB4sdYVF9dp1e9fJd0ZHq7vjh1T06ZN6yueV2A1NQCgRufPn9eS\ntDS9WMcilqTrJPWvqNCqVavqI5pXoYwBADV65513NNjPT12cvH7K+fN6de5cMQl7cZQxAKBGyxYu\n1OTz552+/hpJZ/PylJ6e7r5QXogyBgDU6Mi//qUEF673lxQXEKCcnBx3RfJKlDEAoEbnS0tlcfEe\nTe12nXdhdO0LKGMAQI2ah4bqnIv3OOvvr+bNm7slj7eijAEANYqPjdUWF64vkbSjrEwxMTHuiuSV\nKGMAQI3umTFDqc2aOX39WklJSUnq3r27+0J5IcoYAFCjkSNH6nhwsHY6eX1qs2aakpLi1kzeiDIG\nANQoICBAsx57THdbLCqo47ULAwJU2KaNRo4cWS/ZvAllDAC4qCn33af+N92kkRaLTtfymlR/fy0I\nD9dHmzYpMJCv9V4KZQwAuCg/Pz+99sYb6j9hghKDgvSSpLMXOM8h6QtJYy0WvRwZqS+/+UZdujj7\n7i7fwociAAC1kp+fr+7du2tgQoK2/fOfGuXvr+7FxQqWdDogQB+GhsqvVStNnTVLf7jjDjVzYeGX\nr6GMAQC1Mm3aNJWUlOi1115TXl6e1q1bp7zjx1VWUqIWbdpo8ODBGjZsmPz8LvSlY1wMZQwAuKT9\n+/dryJAhysrKUtu2bU3H8To8MwYAXNKMGTP00EMPUcT1hCVuAICL+vTTT7Vv3z795S9/MR3FazEy\nBgDUqKKiQtOnT9eCBQsUFBRkOo7XoowBADVavHixIiIidMMNN5iO4tVYwAUAuKD8/HxFR0dr48aN\nSkhw5avGuBTKGABwQdOnT9f58+f1+uuvm47i9ShjAEA12dnZGjRokLKystSuXTvTcbwez4wBANXM\nmDFDKSkpFHEDYWsTAKCKjRs3KisrS2vXrjUdxWcwMgYAVPrlVqbg4GDTcXwGZQwAqLRkyRK1bdtW\no0aNMh3Fp7CACwAgSTpz5oyio6P1t7/9TYmJiabj+BTKGAAg6d+Lts6dO6fFixebjuJzKGMAgA4c\nOKCBAwdqz549ioiIMB3H51DGAACNHj1agwYN0qxZs0xH8UlsbQIAH/f5558rIyNDq1evNh3FZ7Ga\nGgB8WEVFhR544AHNnz+frUwGUcYA4MOWLl2q1q1b68YbbzQdxafxzBgAfNTZs2cVFRWlDRs2KCkp\nyXQcn0YZA4CPmjlzps6cOaO0tDTTUXweZQwAPujgwYMaMGAAW5kaCZ4ZA4APmjlzpmbOnEkRNxJs\nbQIAH/P3v/9d6enpWrVqleko+AkjYwDwITabTdOmTdP8+fMVEhJiOg5+QhkDgA9ZtmyZWrRooTFj\nxpiOgl9gARcA+IizZ88qOjpaH3/8sfr06WM6Dn6BMgYAHzFr1iz9+OOPWrp0qeko+BXKGAB8wM9b\nmTIyMtShQwfTcfArlDEA+IAxY8aoX79+evjhh01HwQWwtQkAvNymTZu0a9cuvf3226ajoAaspgYA\nL8ZWJs9AGQOAF3vjjTfUvHlzjR071nQUXATPjAHAS507d05RUVH66KOP1LdvX9NxcBGUMQB4qYce\nekgnTpzQsmXLTEfBJVDGAOCFDh06pP79+7OVyUPwzBgAvNCsWbM0ffp0ithDsLUJALzM5s2btWPH\nDq1cudJ0FNQSI2MA8CI/b2V67rnnFBoaajoOaokyBgAvsnz5clksFo0bN850FNQBC7gAwEv8vJXp\nww8/1JVXXmk6DuqAMgYAL/Hwww8rNzdXy5cvNx0FdUQZA4AXOHz4sPr16yer1arIyEjTcVBHPDMG\nAC8wa9YsTZs2jSL2UIyMAcDDffnll7rjjju0d+9eVlB7KEbGAODBbDabHnjgAc2bN48i9mCUMQB4\nsBUrVig0NFTjx483HQUuYJoaADxUQUGBoqKi9P7776tfv36m48AFjIwBwEPNnTtXV199NUXsBRgZ\nA4AHOnLkiK688kqlp6frsssuMx0HLmJkDAAeKCUlRffffz9F7CUYGQOAh9myZYtuv/127du3TxaL\nxXQcuAEjYwDwIHa7vXIrE0XsPShjAPAgK1asUHBwsG655RbTUeBGTFMDgIcoLCxUVFSU1q9fr/79\n+5uOAzdiZAwAHmLu3Ln6zW9+QxF7IUbGAOABcnJy1KdPH6Wnp6tjx46m48DNKGMA8AC33HKLYmJi\n9Pjjj5uOgnpAGQNAI7d161bdeuutbGXyYjwzBoBG7OetTHPnzqWIvRhlDACN2FtvvaXAwEDdeuut\npqOgHjFNDQCNVGFhoaKjo7Vu3ToNGDDAdBzUI0bGANBIzZs3T8OHD6eIfQAjYwBoROx2u9LS0jR8\n+HANGjRIu3fvVqdOnUzHQj0LNB0AAPD/3nzzTU2ePFkWi0UjR45kT7GPYGQMAI1EQUGBevXqpby8\nvMpjTzzxhGbPnm0uFBoEz4wBoJGYO3dulSIODg7WXXfdZTARGgplDACNwOHDh/X8889XOTZjxgx1\n6dLFUCI0JKapAaARGD9+vNauXVv56w4dOig7O1thYWEGU6GhMDIGAMO2bNlSpYglac6cORSxD2Fk\nDAAG2e129evXTzt37qw81rdvX23fvl3+/oyXfAX/0gBg0IoVK6oUsSQtXLiQIvYxjIwBwJDCwkL1\n7Nmzygrq8ePHa/Xq1QZTwQR+9AIAQy60lWnevHkGE8EUyhgADMjJydGCBQuqHHvwwQfVtWtXM4Fg\nFNPUAGDALbfcUmU6un379srOzlazZs0MpoIpjIwBoIFt3bq12nPhZ599liL2YYyMAaAB2e129e/f\nX99++23lsaSkJO3YsYMV1D6Mf3kAaEArV66sUsQSW5nAyBgA6k1JSYny8/Pl7++vli1bqqysTL16\n9VJubm7lOTfddFO1t2/B91DGAOBGZWVlWr9+vVLnzdPXVqtaBgXJ5nDoXHm5enXqpMwjRyrPDQoK\n0r59+9StWzdzgdEoMC8CAG7y1ooV6tKunRYnJ+tPu3ap0GZTXnGxTpaU6LTNpvuPHNHlkpr+dP70\n6dMpYkiSAk0HAABvMO/pp7VozhxtKCpS7wv8flNJEyXdLelvksZLio6KasiIaMSYpgYAFy1bskTP\n3H+/vioqUodaXmOV9NvQUK355BMNHz68HtPBE1DGAOCCgoICdYmI0NbiYl1Rx2s/kjSrUyftycmR\nn59ffcSDh+CZMQC44K2VK3WVn1+di1iSRkryy8/X5s2b3R0LHoaRMQA4yeFwKKFbNy3MydFvnLzH\nq35+2nz99Vrz8cduzQbPQhkDgJMOHz6swbGxOlZcLGcnmc9KahcQoJLycqaqfRjT1ADgpFOnTiky\nKMjpIpakcEmBfn46f/68u2LBA1HGAOAkh8PhUhH/zM/PT3a73Q13gqeijAHASa1atVJeeblcedZ3\nXlKpzcYXm3wcZQwATurevbtCw8O1zYV7rJZ0/X/8B8+LfRxlDABO8vf3170PPqhUi8Wp6x2SXg0L\n05RZs9wbDB6H1dQA4IL8/Hx1j4zU7pISdanjtV9IujsiQgeOH+cTij6Of30AcEHLli312JNPaqTF\novw6XPedpNtCQ/XSkiUUMRgZA4CrHA6H+icm6lRGhj6X1P0S52+XdGNoqGa/8IKSJ09ugIRo7Phq\nEwC4aNu2bfo2M1N+kmIkjZA0U9JwqXLrU4WkDySlhoUpw99fi5Yv14033mgkLxofRsYA4ILS0lIl\nJSVp7969lcfatm6tNhaLTp48qXZBQbI5HMorLVVcdLSmpKRo7NixCg4ONpgajQ0jYwBwwdy5c6sU\nsSS9s2aNrrrqKuXm5ur06dMKCAhQmzZt1LZtW0Mp0dgxMgYAJ2VlZal3794qLy+vPDZhwgQtXbrU\nYCp4IsoYAJxgt9s1dOhQ/eMf/6g81q5dO+3du1etWrUymAyeiPX0AOCE119/vUoRS9Irr7xCEcMp\njIwBoI6OHTumK664QgUFBZXHfve73+mDDz7gtZZwCiNjAKgDh8OhqVOnVinisLAwpaamUsRwGmUM\nAHXw7rvv6v33369ybM6cOerUqZOhRPAGTFMDQC3l5+crJiZGeXl5lccGDhyoLVu2KCAgwGAyeDpG\nxgBQSykpKVWKuEmTJkpLS6OI4TLKGABqYfPmzUpLS6ty7KGHHlJsbKyhRPAmTFMDwCWUlJQoISFB\nBw4cqDwWHR2t3bt381pLuAUjYwC4hKeeeqpKEUtSWloaRQy3YWQMABdhtVrVt29fVVRUVB6bPHmy\nXnvtNYOp4G0oYwCogc1m08CBA/XNN99UHouMjFRWVpbCw8MNJoO3YZoaAGqwaNGiKkUsSa+++ipF\nDLejjAGgBuPHj9fw4cMrfz1mzBiNHj3aXCB4LcoYAGoQEhKi7777TnPmzFHv3r31yiuvmI4EL8Uz\nYwCowZ/+9CcVFBTojTfekMPh4N3TqDeBpgMAQGO0bds2rV27VpmZmZJEEaNeMU0NAL9SVlam5ORk\nvfjii2rdurXpOPABlDEA/Mq8efPUtWtX3XzzzaajwEfwzBgAfmHfvn0aMmSIdu7cqc6dO5uOAx/B\nyBgAfmK32zVp0iQ98cQTFDEaFGUMAD9JS0tTWVmZpkyZYjoKfAzT1AAg6fjx40pMTNSmTZsUFxdn\nOg58DGUMAPr327ViY2P11FNPmY4CH8Q+YwA+791331VWVpbefvtt01HgoxgZA/BpZ86cUVxcnFat\nWqWhQ4eajgMfRRkD8GmTJ0+W9O8vNAGmME0NwGd9+eWX+uijj7Rnzx7TUeDj2NoEwCeVlJRo0qRJ\nevnll/k+MYyjjAH4pGeeeUYxMTEaM2aM6SgAz4wB+J6MjAyNGDFC6enpioyMNB0HYGQMwLfYbDYl\nJyfr6aefpojRaFDGAHxKamqqgoKClJycbDoKUIlpagA+4/vvv1efPn301VdfKTo62nQcoBIjYwA+\nweFwaMqUKbr//vspYjQ67DMG4BPWrFmjI0eO6N133zUdBaiGaWoAXu/06dOKjY3V+vXrNWDAANNx\ngGooYwBeb8KECQoLC9PLL79sOgpwQUxTA/Bqn3/+uT777DNeeYlGjQVcALxWUVGR7rnnHqWmpqpZ\ns2am4wA1YpoagNdKSUlRTk6O3nnnHdNRgIuijAF4pV27dunaa69VRkaGIiIiTMcBLoppagBep6Ki\nQhMnTtS8efMoYngEyhiA13nppZfUokUL3XnnnaajALXCNDUAr3Lo0CH1799fX3/9tXr06GE6DlAr\njIzrWVZWlu6bNEmxnTopskULdWrVSn169NAz//M/+uGHH0zHA7yKw+HQ5MmTNXPmTIoYHoWRcT3Z\ntm2bHrnvPu3LytLE8nKNrahQW0k2SUclvRkSorWSrrvmGj335z+rU6dOZgMDXmDlypV64YUXtH37\ndjVp0sR0HKDWKON68Jd16zT5jjv0fHGxbpEUVMN5ZyS9GBCgZeHh+uSLLxQfH9+AKQHvcvLkScXF\nxemTTz5R3759TccB6oQydrPPPvtMt99wg/5aXKykWl7zv5JSWrbU1l271KVLl/qMB3it3//+92rf\nvr0WLFhgOgpQZ5SxG5WUlKhLRIRWnzun4XW8dm5AgL4YMEB//eqr+ogGeLUNGzZo6tSpysjIUNOm\nTU3HAeqMBVxutHbtWvW22+tcxJL0gM2mnd9+qwMHDrg7FuDVCgsLde+992rRokUUMTwWZexGqfPm\naUphoVPXhki6y2bTIr4qA9TJY489pmHDhumaa64xHQVwGtPUbnL48GENjI3VseJiBTh5j4OShjRv\nrryzZ90ZDfBa27dv1w033KDMzEy1adPGdBzAaYyM3SQ3N1fdgoKcLmJJ6ibpVEGB8vPz3RUL8Frl\n5eWaOHGinn/+eYoYHo/vGbtJaWmpgl28h78kORxq1aqVunTpooSEBCUmJiohIUEJCQnq0aOHAgJc\nqXvAeyxYsECRkZG67bbbTEcBXMY0tZvs2rVLfxw+XNZz55y+x3lJLSRV1PD7oaGhiouLq1LQCQkJ\natmypdN/JuCJsrOzNWjQIO3YsUNdu3Y1HQdwGWXsJkVFRercrp12nD+vrk7eY42kuyXVdQlYp06d\nqo2ie/bsqcBAJj7gfex2u0aMGKFRo0Zp2rRppuMAbkEZu9G0KVMUsmSJ5pSXO3V9/8BA5bZvr9zc\nXNlsNpeyhISEKDY2ttoounXr1i7dFzBtyZIlWrx4sbZt28ZjG3gNytiN9u/fr2FJSTpcXCxLHa+1\nSrquRQvlnDghu92urKwsWa1WWa1WpaenKz09XadOnXI542WXXVZlFJ2YmKhevXoxioZHyMvLU0JC\ngjZu3KjExETTcQC3oYzd7I/jxun8xx9rdR22OJ2WNNhi0QPz5+ueKVMueI7D4VBeXl6VgrZardq7\nd68qKmp6ylw7wcHBiomJqTKKTkxMZIUqGp3x48erR48eevbZZ01HAdyKMnaz0tJSXT9smNpmZOjN\n4mKFXOL845L+02LR1XffrflOvPCjrKxMe/furVLQ6enpOnHihFP5f6lDhw5VRtF9+/ZVdHS0y/cF\nnPHBBx/owQcflNVqVWhoqOk4gFtRxvWgpKREd44fr+1//7vuLS7WBLtdv35Se1DSoqAgLff314xH\nHlHKf/+3/Pz83Jbhhx9+qFLQVqtVWVlZKnfyebYkXX311fr000/dlhGorXPnzik2NlYrVqzQVVdd\nZToO4HaUcT1xOBz65ptvlLpggd7/8EMNCApSG7v9398z9vfXfrtdE5KTdc9996lbt24NkqmsrEz7\n9++vUtDp6enKy8ur1fXR0dH64x//WDlajoyMdOsPEEBNpk6dqtLSUi1ZssR0FKBeUMYN4Mcff9TW\nrVuVn5+vwMBAtW3bVsOGDVNIyKUmsRvGiRMnlJGRUWWaOysrS2VlZVXOS05OVvPmzSsXlNlstmqL\nwWJiYphChFtt3bpV48aN0549e9hTD69FGeOCysvLlZ2dXaWgFyxYoNjY2MpzLrSgLDs7W127dq22\nGKxjx46MolFnpaWlSkpK0pNPPqlx48aZjgPUG8oYblVWVqZ9+/ZVe15dWlpaZb9zYmKiYmNjZbHU\ndRMYfMmTTz6pnTt36r333uOHOXg1yhgN4sSJE9UKev/+/ercuXOVgk5ISFDnzp35jxfKysrSsGHD\ntHv3bnXs2NF0HKBeUcYwpry8XPv376+2LauoqKhaQcfFxfHheB9it9s1dOhQ3XbbbZo6darpOEC9\no4zR6Jw8ebLagrJ9+/apY8eO1Uq6a9eujKK9UGpqqt566y199dVX8vfnS6/wfpQxPEJFRUWVBWU/\nl3RBQYHi4+OrFHR8fLzCwsJMR4aT/vWvfykpKUmbN29WTEyM6ThAg6CM4dF+/PHHynL+5basyMjI\nal+y6tatG6OsRs7hcGj06NFKSkrS7NmzTccBGgxlDK9TUVGhgwcPVpnmtlqtys/PV3x8fJWCjo+P\nV/PmzU1Hxk/WrVunxx9/XLt27VJwcLDpOECDoYzhM/Lz86vti96zZ48iIiKqvbyke/fujKIbWH5+\nvuLi4rRmzRoNHjzYdBygQVHG8Gk2m00HDx6sVtKnTp1SXFxclYKOj49XeHi46cheKzk5WU2aNFFq\naqrpKECDo4yBCzhz5owyMjKqFHRmZqbatGlT7e1il19+OR+5d9EXX3yhP/zhD8rMzOQHHvgkyhio\nJbvdru+++67ay0tOnDih2NjYKgUdHx/Pe5Rrqbi4WImJiZo/f75GjRplOg5gBGUMuOjs2bPKzMys\nUtIZGRlq2bJllWnuhIQE9ezZk1H0rzz66KPKzs7W2rVrTUcBjKGMgXpgt9t1+PDham8Xy8vLU0xM\nTLVtV61atTId2Qir1arf/va3Sk9PV4cOHUzHAYyhjIEGVFBQoMzMzCrT3FarVeHh4dXeLtarVy8F\nBgaajlxvbDabBg4cqEmTJmnixImm4wBGUcaAYXa7XTk5OdXeLnbs2DFdccUV1UbRbdq0MR25VsrK\nyvT555/r+PHjKikpUXh4uPr3769evXpJkhYuXKj33ntPmzZt4pWm8HmUMdBIFRYWas+ePdVeXhIW\nFlatoKOiotSkSRPTkSVJR48e1eJXX9WSRYt0ucOhXjabQmw25QcGapPNpviEBN1011165JFHtG3b\ntspyBnwZZQx4EIfDoe+//75aQR89elRRUVHVtl21bdu2QfMtX7ZMD/7Xf+l2u12TS0v16zdLl0p6\nV9L8gADlt2qlbVar2rdv36AZgcaIMga8QFFRUbUV3VarVSEhIdXeLhYVFaWgoCC3Z3hl4UK9+Oij\n2lBUpKhLnOuQ9HRgoJa3aaOtu3ZRyPB5lDHgpRwOh44ePVqtoI8cOaJevXpVG0VHREQ4/Wdt2LBB\nE8eO1T+Ki9WlDtc9FRio93v00NcZGV69WA24FMoY8DFFRUXKysqqtu2qSZMm1Qo6Ojq6Vh9sGBgX\np1l79ujGOmZxSBocFqZZK1dq9OjRTv19AG9AGQOQw+HQsWPHqo2iDx06pJ49e1bbdtW+ffvKFdA7\nd+7UjUOH6lBRkZx5ncnbkpYPGKBPt21z698J8CSUMYAalZSUKCsrq9q2Kz8/v8piTv/6a4345z/1\nqN3u1J9RKqlzaKi27N7Nymr4LB7SAKhRSEiI+vTpoz59+lQeczgcys3NrSzofVar5jtZxJIULOmq\nwEDt2LGDMobP4oOtAOrEz89PkZGRuv7665WSkqImISFy9ZMYLSoqdObMGbfkAzwRZQzAJSHBwSpx\n8R4l/v4KDQ11Sx7AE1HGAFxyWYcO2u/iPbIDAhQZGemWPIAnoowBuOT3U6cqrWlTp6/PlJTj768R\nI0a4LxTgYShjAC65+eab9U9Jh528flFwsJKnTm0079YGTKCMAbjEYrHorgkT9GhIiOq6T3KvpFX+\n/kq+9976iAZ4DMoYgMuenDtXB7t310NNmtS6kA9L+k+LRS+mpuqyyy6rz3hAo0cZA3CZxWLRx198\noU09e+r2kBAdusi5FZL+ImlwaKhmzJmjO+68s2FCAo0Yb+AC4DZFRUWa/cgjemPpUvWTlFxYqJ6S\nQiSdkbQhIECLg4PVpUcPPfbcc7r22mvNBgYaCcoYgNsVFxdr9erVeis1Vbm5uSouLVWLZs3Ub8gQ\n3Tttmnr37m06ItCoUMYAABjGM2MAAAyjjAEAMIwyBgDAMMoYAADDKGMAAAyjjAEAMIwyBgDAMMoY\nAADDKGMAAAyjjAEAMIwyBgDAMMoYAADDKGMAAAyjjAEAMIwyBgDAMMoYAADDKGMAAAyjjAEAMIwy\nBgDAMMoYAADDKGMAAAyjjAEAMIwyBgDAMMoYAADDKGMAAAyjjAEAMIwyBgDAMMoYAADDKGMAAAyj\njAEAMIwyBgDAMMoYAADDKGMAAAyjjAEAMIwyBgDAMMoYAADDKGMAAAyjjAEAMIwyBgDAMMoYAADD\nKGMAAAyjjAEAMIwyBgDAsP8DCK7EO4PmEjkAAAAASUVORK5CYII=\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x10f207f90>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import networkx as nx\n",
    "%matplotlib inline\n",
    "\n",
    "results = %cypher MATCH p = (:Person)-[:LIKES]->(:Drink) RETURN p\n",
    "\n",
    "g = results.get_graph()\n",
    "\n",
    "nx.draw(g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[(u'319', {u'calories': 9000, 'labels': [u'Drink'], u'name': u'Mountain Dew'}),\n",
       " (u'318', {u'age': 20, 'labels': [u'Person'], u'name': u'Drew'}),\n",
       " (u'317', {u'age': 24, 'labels': [u'Person'], u'name': u'Nicole'}),\n",
       " (u'320', {u'calories': 0, 'labels': [u'Drink'], u'name': u'Coke Zero'})]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.nodes(data=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{u'317': 2, u'318': 1, u'319': 2, u'320': 1}"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nx.degree(g)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
