{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# ipython-cypher\n",
    "\n",
    "`ipython-cypher` exposes `%cypher` magic in Jupyter. Install `ipython-cypher` with `pip install ipython-cypher`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Cypher\n",
    "\n",
    "`%cypher` is intended for one-line Cypher queries and `%%cypher` is intended for multi-line Cypher queries. Placing `%%cypher` above a Cypher query will display that query's results."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>person.name</th>\n",
       "        <th>drink.name</th>\n",
       "        <th>drink.calories</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Coke Zero</td>\n",
       "        <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Drew</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[u'Nicole', u'Mountain Dew', 9000],\n",
       " [u'Nicole', u'Coke Zero', 0],\n",
       " [u'Drew', u'Mountain Dew', 9000]]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name, drink.name, drink.calories"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Pandas Data Frames\n",
    "\n",
    "Cypher query results can be coerced to `pandas` data frames with the `get_dataframe` method. To assign Cypher query results to a variable, you need to use `%cypher` and separate lines with \\\\. You'll first need to install `pandas` with `pip install pandas`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Drew</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Coke Zero</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name         drink\n",
       "0    Drew  Mountain Dew\n",
       "1  Nicole  Mountain Dew\n",
       "2  Nicole     Coke Zero"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = %cypher MATCH (person)-[:LIKES]->(drink:Drink) \\\n",
    "                  RETURN person.name AS name, drink.name AS drink\n",
    "    \n",
    "df = results.get_dataframe()\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Int64Index([0, 1, 2], dtype='int64')"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.index"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name         drink\n",
       "1  Nicole  Mountain Dew"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.iloc[[1]]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0      Drew\n",
       "1    Nicole\n",
       "2    Nicole\n",
       "Name: name, dtype: object"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df[\"name\"]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# NetworkX Graphs\n",
    "\n",
    "Cypher query results can be coerced to `NetworkX` MultiDiGraphs, graphs that permit multiple edges between nodes, with the `get_graph` method. You'll first need to install `NetworkX` with `pip install networkx`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAeAAAAFBCAYAAACvlHzeAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAHVxJREFUeJzt3Wl0VHW6tvE7lUqoVCAQAglgg4gMImIjILQMDeKQAI2g\nEiY5ynQYJIFGEcNZp/W1da0kTI0EAiKNIqAyCEETBm0cIA4MCihBFHCgGRMgQAAhqdQ+H1p5ARky\nVPJPVV2/T67K3sWTxVpc1rN3VQVYlmUJAACUK5vpAQAA8EcEGAAAAwgwAAAGEGAAAAwgwAAAGECA\nAQAwgAADAGAAAQYAwAACDACAAQQYAAADCDAAAAYQYAAADCDAAAAYQIABADCAAAMAYAABBgDAAAIM\nAIABBBgAAAMIMAAABhBgAAAMIMAAABhAgAEAMIAAAwBgAAEGAMAAAgwAgAEEGAAAAwgwAAAGEGAA\nAAwgwAAAGECAAQAwgAADAGAAAQYAwAACDACAAQQYAAADCDAAAAYQYAAADCDAAAAYQIABADCAAAMA\nYAABBgDAAAIMAIABBBgAAAMIMAAABthNDwAA3u7MmTM6dOiQzpw5oypVquimm26S0+k0PRYqOAIM\nACVgWZa2bNmi1KlTtXLVKkUGBSnUZlOe260ThYXq36+fRo0bp+bNm5seFRVUgGVZlukhAMCbHDx4\nUH27d9ehvXs18pdfNMTtVo1Lfy5pnt2uuUFBurN1ay1OS1P16tVNjYsKigADQDHs27dPXf70J408\neVITXC4FXufYAkkTg4OVUauWPtq0SbVq1SqvMeEFCDAAFNGJEyd0zx//qL8eOqRRbneRz/t/drsy\nGjXSJ1u3cm0YF3EXNAAUUco//qH2OTnFiq8kPe9yKfLnn/XGggVlNBm8Ea+AAaAICgoKVD8yUutO\nntQdJTh/vaRx9etrxw8/KCAgwNPjwQvxChgAimDVqlVqWFhYovhKUhdJ+Tk5yszM9ORY8GIEGACK\nYO2KFeqTl1fi8wMk9Tl7VutWr/bcUPBqBBgAiuBEdraiSvkcUZKOHz7siXHgAwgwABSBzWZTaW+Y\nsX59HkAiwABQJDVq19bBUj7HQZtNNW66ySPzwPsRYAAogp79+mlh5colfhVcKGmxw6GeDz/sybHg\nxQgwABRBdHS0cp1ObSnh+RmS6tSvr5YtW3pyLHgxAgwARWCz2TTqqaeUFBJS7FfBLklJlSpp1IQJ\nZTEavBQBBoAiejIuTv+uX1/P2+1FjrBb0jBJ3+Tn65ZbbinD6eBt+CQsACiGo0eP6r4//Un3Hjqk\npPx8hV7n2FOSBktaJ+mcpPDwcG3cuFHNmjUrl1lRsfEKGACKISoqSpnbtuno/ffrZodD44KD9d0V\nx2yXNMLhUF27XWv1n/hKUm5urqKjo7V///7yHRoVEgEGgGKqVq2almZk6Mvdu+UcO1Z/DgtTqN2u\nqJAQhdjt6lG9uuomJOj7f/9bCS+8cNm5Bw8eVHR0tI4fP25oelQUrKABoJQsy9LZs2eVl5ensLAw\nOZ3Oi1+4YFmW4uLilJqaetk5bdu21fr16xUaer0lNnwZAQaAMlZYWKh+/fpp+fLllz3erVs3paWl\nKSgoyNBkMIkVNACUscDAQC1atEj33nvvZY+vXr1aw4YNE6+D/BMBBoByUKlSJa1cuVItWrS47PE3\n3nhDzz77rKGpYBIraAAoR0eOHFG7du30448/Xvb4lClT9PTTTxuaCiYQYAAoZ3v37lW7du2Uk5Nz\n2eMLFy7UwIEDDU2F8kaAAcCAL7/8Up07d9aZM2cuPma32/Xee+8pJibG4GQoL1wDBgADWrVqpZUr\nV152B7TL5dLOnTsNToXyRIABwJD7779fixYtUkBAgGw2m6pWraqePXuaHgvlxG56AADwZ3369NHx\n48d100036ciRI4qJidGnn36qWrVqmR4NZYwAA4Bho0aNuvjfR48eVUxMjD755BNVrVrV4FQoa9yE\nBQAViGVZio+PV1ZWltasWSOHw2F6JJQRAgwAFUxhYaH69+8vt9utJUuWKDAw0PRIKAPchAUAFUxg\nYKAWLlyo3NxcxcXF8VGVPooAA0AF9NtHV37xxRd68cUXTY+DMsBNWABQQYWFhWnNmjXq0KGDoqKi\nNGLECNMjwYMIMABUYLVq1dK6devUsWNH1axZU4888ojpkeAhBBgAKrhbb71VGRkZio6OVkREhDp1\n6mR6JHgA14ABwAvcddddevvttxUbG6sdO3aYHgceQIABwEt06dJFM2fOVLdu3X73dYbwPqygAcCL\n9OnTRzk5OYqOjlZmZqYiIyNNj4QS4oM4AMALPffcc1qzZo0+/PBDValSxfQ4KAECDABeyLIsjRgx\nQj/++KMyMjIUHBxseiQUEwEGAC/lcrkUGxsrh8OhxYsXy2bjth5vwt8WAHgpu92uN998UwcPHtS4\nceP4yEovQ4ABwIuFhITo3Xff1UcffaTk5GTT46AYuAsaALxctWrVtHbtWrVv315RUVEaPHiw6ZFQ\nBAQYAHxAnTp1tG7dOnXq1Ek1atRQjx49TI+EG+AmLADwIZs3b1b37t2Vlpam9u3bmx4H18E1YADw\nIW3atNGiRYv0yCOPKCsry/Q4uA4CDAA+Jjo6WtOmTVNMTIz2799vehxcA9eAAcAHPfbYY5d9ZGVE\nRITpkXAFrgEDgA9LSEjQxx9/rPXr1ys0NNT0OLgEAQYAH2ZZlgYPHqzs7GytWrVKQUFBpkfCrwgw\nAPi4goICPfzww6pevbpef/11PrKyguBvAQB8XFBQkJYuXaq9e/cqISHB9Dj4FQEGAD/gdDqVnp6u\n9PR0TZ061fQ4EHdBA4DfqF69utatW6cOHTooKipKAwcOND2SXyPAAOBH6tatqzVr1ujee+9VRESE\nunbtanokv8VNWADghz7//HM99NBDSk9PV9u2bU2P45e4BgwAfuiee+7R66+/rp49e2r37t2mx/FL\nBBgA/FT37t2VnJysmJgYHTx40PQ4fodrwADgx5544gkdPXpUMTEx2rBhg8LDw02P5De4BgwAfs6y\nLD399NPasmWL3n//fYWEhJgeyS8QYACA3G63Hn/8ceXl5emdd96R3c6CtKxxDRgAIJvNpvnz5+vC\nhQsaOXKkeG1W9ggwAECSFBwcrOXLl+vrr7/W3/72N9Pj+Dx2DACAiypXrqyMjIyLn5YVHx9veiSf\nRYABAJepWbPmxY+sjIyMVN++fU2P5JMIMADgd+rXr6/Vq1frgQceUEREhO6//37TI/kc7oIGAFzT\nxo0b9eijj2rNmjVq1aqV6XF8CjdhAQCuqWPHjpo7d6569OihPXv2XPM4y7LkdrvLcTLvR4ABANfV\nq1cvvfDCC4qJidGRI0cuPr57926NHTlSN4WHq1JQkILsdlUPDVVst2768MMPeSvTDbCCBgAUyUsv\nvaTly5fr1VdfVUJcnLK++UbDCgo0yOVSXUmBko5LWiFpVuXKKqxWTZNSU9WjRw+zg1dQBBgAUCSW\nZSk2Nlbr0tKU6HZruGUp+FrHSlov6YmQEP3vpEkaFRdXjpN6BwIMACiS3bt3q1ObNnotL0/dinjO\nj5I6OZ2aNG+e+vXvX5bjeR0CDAAoks6tW6vPV1/pyWJm42tJnZ1O/XzkiKpUqVI2w3khbsICANxQ\nVlaWvtu1S8NK8JrtTkldAgK0aOFCzw/mxQgwAOCGZv/jH/rvgoJrXvO9kSfPnlXqpEncGX0JVtAA\ngBuKCgvT53l5alDC8y1Jt4SGas2WLWratKknR/NavAIGAFyX2+3WsTNnVK8UzxEgqa7druzsbE+N\n5fUIMADgun77hKvSBiNIUkFBQann8RUEGABwXXa7XaHBwTpZyuc5ZlkKDw/3yEy+gAADAG6oc7t2\nWlmK8/dIOmpZatasmadG8noEGABwXYWFhWrWtq0m2Wwq6V27c4KDNWT4cDkcDo/O5s0IMADgqi5c\nuKC5c+eqSZMm2rBhg86GhSmzBM9zWtICm00j+DjKyxBgAMBl8vLyNGXKFDVo0EBpaWl67bXX9Omn\nn2r63Ll6zOnUgWI8V76k3k6nBvzXf6l+/fplNLF3IsAAAEnSsWPH9Nxzz6lBgwb68ssvlZGRodWr\nV6tjx46SpN6xsfrr88/rz06nvi3C852W9BenU5U7dtS01NQynd0bEWAA8HP79+/X2LFj1bhxYx09\nelSff/653nrrLbVo0eJ3xz41YYKenzlT7UJCNMDpVKb0u+vC+yQ9ExSkWx0ONe7fX0vT02W328vj\nV/EqfBIWAPip3bt3Kzk5We+++66GDBmicePGqU6dOkU6Nzc3Vwtee02pU6fKfeqU6trtCtJ/3mr0\nb7dbg4cO1Yj4eN16661l+0t4MQIMAH5m69atSkxMVGZmpuLj4zV69OgSvz/X7XZr586dysnJkcvl\nUnh4uJo3b66QkBAPT+17CDAA+AHLsvThhx8qMTFR33//vcaPH6+hQ4cqNDTU9Gh+i6U8APgwt9ut\nVatWKTExUXl5eXr22Wc1YMAABQeX9HuN4CkEGAB8UEFBgd58800lJycrNDRUEydOVK9evWSzce9t\nRUGAAcCHnDt3TvPmzdPUqVPVqFEjpaSkqEuXLgoICDA9Gq5AgAHAB+Tm5mrWrFlKSUlR+/bttXz5\nct19992mx8J1sIsAAC92+PBhTZgwQQ0bNtTevXv18ccfa8WKFcTXCxBgAPBC+/bt04gRI9SsWTNd\nuHBB27Zt0+uvv66mTZuaHg1FRIABwIvs2LFD/fv3V9u2bRUZGanvvvtOL7/8surVq2d6NBQTAQYA\nL5CZmanu3bura9euatmypX744Qe9+OKLqlmzpunRUELchAUAFZRlWVq9erUSExN15MgRTZgwQe+8\n8w7fqesjCDAAVDAul0vLli1TUlKSAgIClJCQoN69e/OFBj6Gv00AqCDOnz+vBQsWaNKkSapTp44S\nExPVtWtX3sProwgwABh2+vRpzZkzR9OnT1fLli21YMECdejQwfRYKGMEGAAMycnJ0csvv6w5c+bo\nwQcf1Nq1a3XnnXeaHgvlhLugAaCc/fzzzxozZoyaNGmiY8eOadOmTXrzzTeJr58hwABQTnbt2qUn\nnnhCLVu2VEhIiLKysjRnzhy+tN5PsYIGgDK2efNmJSYm6rPPPtOYMWO0d+9ehYeHmx4LhhFgACgD\nlmVp/fr1SkxM1N69ezV+/HgtXrxYTqfT9GioIAgwAHiQ2+3WypUrlZSUpLNnzyohIUH9+/dXUFCQ\n6dFQwQRYlmWZHgIAvF1+fr4WL16s5ORkVa1aVRMnTtRDDz0km41bbXB1vAIGgFI4e/as5s2bp6lT\np6pJkyZKTU3Vvffey4dn4IYIMACUwIkTJzRz5kzNnDlTf/7zn7VixQq1bt3a9FjwIuxGAKAYDh06\npPHjx6thw4b66aeftGHDBi1fvpz4otgIMAAUwZ49ezR8+HDdcccdcrlc2rFjh+bPn6/bbrvN9Gjw\nUgQYAK5j+/bt6tu3r9q1a6fatWvr+++/1/Tp01W3bl3To8HLEWAAuIJlWdqwYYO6du2q7t27q02b\nNvrhhx/0wgsvqEaNGqbHg4/gJiwA+JVlWUpPT1dSUpKys7M1YcIEpaWlqVKlSqZHgw8iwAD8nsvl\n0pIlS5SUlCS73a6JEyfq0UcfVWBgoOnR4MMIMAC/df78eb322muaPHmy6tatq8mTJys6Opr38KJc\nEGAAfufUqVOaPXu2Xn75ZbVu3VqLFi1Su3btTI8FP0OAAfiN7OxsTZ8+XXPnzlVMTIzef/99NW/e\n3PRY8FPcBQ3A5/3000+Ki4vTbbfdppMnT2rz5s1atGgR8YVRBBiAz8rKytLjjz+uVq1aqXLlytq1\na5dSU1PVoEED06MBBBiA7/niiy/Us2dP3XfffWratKn27dunpKQk1apVy/RowEVcAwbgEyzL0gcf\nfKDExET9+OOPeuaZZ/T2228rJCTE9GjAVRFgAF6tsLBQK1asUFJSks6fP6+EhAT169dPQUFBpkcD\nrivAsizL9BAAUFz5+flauHChJk2apPDwcE2cOFE9evSQzcaVNXgHXgED8CpnzpzRq6++qmnTpun2\n22/XK6+8ok6dOvHhGfA6BBiAVzh+/LhSUlI0a9Ysde7cWWlpaWrVqpXpsYASY1cDoEJxu91asWKF\nPvvsM0nSwYMH9dRTT6lRo0Y6cOCAMjMztWzZMuILr8crYAAVQn5+vhYvXqzk5GR99913atOmjZo3\nb64VK1Zo0KBB+vrrr/WHP/zB9JiAxxBgAEadPXtW8+bN05QpU3TgwIGLj2/evFl33HGH9uzZo4iI\nCIMTAmWDAAMw4sSJE5o5c6ZmzJih48ePX/WYnJwc4gufRYABlKtDhw5p2rRpeuWVV3TmzJmrHhMY\nGKjHHntMEyZMKOfpgPJDgAGUiz179mjy5MlasGCB8vPzr3qMw+HQsGHDNH78eN18883lPCFQvggw\ngDK1fft2JSYmavny5XK73Vc9pmrVqho9erTGjh2ryMjIcp4QMIMAA/A4y7K0ceNGJSYmau3atdc8\nLioqSuPGjdOoUaMUFhZWjhMC5hFgAB5jWZbS09OVlJR08X28V3PLLbdowoQJGjRokBwORzlOCFQc\nBBhAqblcLi1ZskRJSUnauXPnNY9r3ry5EhIS1KdPH9nt/PMD/8YnYQF+7JtvvtGTQ4bopvBwOYKC\nFGy3q3a1ahrSv7+2bt16w/PPnz+v2bNnq3Hjxho4cOA149uuXTu999572rFjhwYMGEB8AfFtSIBf\n2rZtm8YOGaIfvv9ew/Pz9ZjLpTqSAiQdlbTEZtNsh0M169XTtFdfVYcOHS47/9SpU5o9e7amT5+u\no0ePXvPP6dq1qyZOnKiOHTuW6e8DeCMCDPiZDz74QAN69dKkc+c0UNK1vjW3UNJKSU+GhCh1wQL1\njo1Vdna2pk+frtTUVJ06deqq59lsNsXGxiohIUEtWrQoo98C8H4EGPAjW7duVddOnbTy3Dl1uPHh\nkqQdkh5wONQuOlrr1q3T+fPnr3pccHCwBg0apGeeeUYNGzb02MyAryLAgJ+wLEvNGzTQcz/9pD7F\nPHe9pB6SfrnKzypXrqyRI0dq3LhxqlOnTukHBfwEd0IAfmLjxo1yHzum2BKce5+kRpK+vuSxiIgI\njR07VqNHj1b16tU9MyTgRwgw4CdSJ0/Wk2fPKqCE5z8raYSk8Lp1NX78eA0dOlShoaEenBDwL6yg\nAT9QUFCgMKdTR1wuVS3hc1yQVMNu1/f796t27dqeHA/wS7wPGPADJ0+eVKjdXuL4SlIlSbVDQnT6\n9GlPjQX4NQIM+IGCggLZA0q6fP7/gqRrfpMRgOIhwIAfCAkJUe6FCyosxXNYko67XAoPD/fUWIBf\nI8CADzt8+LCef/553Xbbbarkduva30t0Y19Iqly1Km81AjyEu6ABH2NZljZt2qQZM2Zo2bJlcrlc\nF3+WLKl7CZ83NSREo556SjYb/98OeAJ3QQM+4sKFC1q2bJlmzJihLVu2XPUYh/7zyVaNi/nchyU1\ndTi078ABRURElHJSABKvgAGvd/jwYc2ZM0dz5sxRdnb2NY8LCwtTqxYt1GvLFn36yy8q6pXcc5J6\nOZ0a99e/El/Ag9glAV7Isix98cUXGjBggOrVq6e///3v14xvkyZNNHPmTB04cEAffvKJug0dqs5O\npw4U4c85Jun+0FA1e+ghPffSSx79HQB/xwoa8CJFWTP/pnv37oqPj9cDDzxw2XVby7I0OTFRiS++\nqL6SRp0/rz9ece5uSbODg7XIZtPIuDi9mJzMtV/Awwgw4AWKs2YePHiwRo8erUaNGt3wOefNmaNX\nUlJU3eVSbZvtP98H7HbrkKRhI0dq+OjRuvnmmz37ywCQRICBCut6dzNfqUmTJoqPj9fjjz+uKlWq\nFOvPcblc2rZtm44fPy63263q1avrrrvuUqVKlUr7KwC4DgIMVDCeWDMDqPi4CxqoIMpizQyg4iLA\ngEHltWYGUPEQYMCQ3NxcRUdHs2YG/BQBBgypVq2azp07d9WfsWYGfB8BBspZYWGhMjIyNGPGDB04\ncPnHYbBmBvwHd0ED5SQ3N1fz58/XrFmzVLNmTY0ZM0Y9evRQ48aN1bp1a9bMgJ8hwEAZ27Vrl1JS\nUvT2229fvJ7btm3biz8/ffq0wsLCDE4IwARW0EAZuHTNnJWVpZEjR+rbb79VrVq1fncs8QX8EwEG\nPOjSNXNkZKTi4+MVGxur4OBg06MBqGAIMOABV66Z33rrrcvWzABwJQIMlFBx1swAcCUCDBQTa2YA\nnkCAgSJizQzAkwgwcB2smQGUFQIMXAVrZgBljQADl8jKylJKSoqWLFnCmhlAmSLA8HuFhYVKT09X\nSkoKa2YA5YYAw2/9tmaeOXOmoqKiNGbMGPXu3Zs1M4ByQYDhdy5dM//lL3/RkiVL1KZNG9NjAfAz\nBBh+gTUzgIqGAMOnsWYGUFERYPgk1swAKjoCDJ9x6Zp5165dGjFiBGtmABUWAYbXY80MwBsRYHgt\n1swAvBkBhlf5bc08Y8YMffvtt6yZAXgtAgyvkJubq3/+85+aNWsWa2YAPoEAo0JjzQzAVxFgVDis\nmQH4AwKMCoM1MwB/QoBhHGtmAP6IAMOIK9fMfDYzAH9DgFGuLl0z16pVS/Hx8ayZAfglAoxywZoZ\nAC5HgFFmWDMDwLURYHgca2YAuDECDI9hzQwARUeAUSqsmQGgZAgwSoQ1MwCUDgFGsezcuVMpKSla\nunQpa2YAKAUC7GOys7OVnZ2tgoICVatWTfXq1VNgYGCpnrOwsFDvvfeeUlJSWDMDgIcQYB9QUFCg\ntLQ0pSYna/vOnapTqZKCJB13uWRzOjVy7FgNHT5ckZGRxXreK9fMY8aM0aOPPsqaGQA8IMCyLMv0\nECi5f/3rX3qiTx81dLk0Oi9PvSRdmscvJaU6HHrHsvRkXJxemjRJNpvtus956Zq5R48eio+P1913\n312WvwYA+B0C7MWWLV2quEGD9NYvv6jLDY7NkfRIaKjqPfigFi5f/rsIX23NPHz4cNbMAFBGCLCX\nyszM1CMPPqgPfvlFfyziOeclxTidaj1kiKakpEhizQwAphBgL9X29ts1/ttvFVvM83IlNXY49MaK\nFUpLS2PNDACGcBOWF9q6dauO/vyzHinBueGSBly4oAG9e2vcs89yNzMAGMIrYC80dMAANVqyRAlu\nd4nO3yvpntBQ7c/JUUhIiGeHAwAUyfVvh0WFtHbNGvUtYXwlqaGk+oGB+uqrrzw3FACgWAiwFzpx\n5oyK947e34uUdOLECU+MAwAoAQLshWwBASrtdQNLuuH7gQEAZYd/gb1QjbAwHSzlcxySFBER4Ylx\nAAAlQIC9UK/evbXIXvIb2L+WdCwwUK1bt/bcUACAYiHAXmjk2LGaFxSk/BKeP9vh0H+PHi17KSIO\nACgd3obkpbrcfbf6bd2q4cU874Ck5g6HsvbtU506dcpiNABAEfAK2Eu9PH++/jc0VB8V45xcSd2c\nTv3Pc88RXwAwjAB7qebNm2tperr6hoZqoaQbvSt4t6T2Tqdihg3T+ISEcpgQAHA9rKC93Pbt2zU4\nNlZnDh/WqHPnNMiyVP3XnxVKypCUWrmyvpL0QmKiRsXFmRsWAHARAfYBlmVp06ZNSp0yRctWrVKw\nzaYgm02n8vPVumlTjU5IUO/eveVwOEyPCgD4FQH2MW63W6dPn1Z+fr6qVavG1woCQAVFgAEAMICb\nsAAAMIAAAwBgAAEGAMAAAgwAgAEEGAAAAwgwAAAGEGAAAAwgwAAAGECAAQAwgAADAGAAAQYAwAAC\nDACAAQQYAAADCDAAAAYQYAAADCDAAAAYQIABADCAAAMAYAABBgDAAAIMAIABBBgAAAMIMAAABhBg\nAAAMIMAAABhAgAEAMIAAAwBgAAEGAMAAAgwAgAEEGAAAAwgwAAAGEGAAAAwgwAAAGECAAQAwgAAD\nAGAAAQYAwAACDACAAQQYAAADCDAAAAYQYAAADCDAAAAYQIABADCAAAMAYAABBgDAAAIMAIABBBgA\nAAMIMAAABhBgAAAMIMAAABhAgAEAMIAAAwBgAAEGAMAAAgwAgAEEGAAAAwgwAAAGEGAAAAwgwAAA\nGECAAQAw4P8AovP7gnujdywAAAAASUVORK5CYII=\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x10fa96fd0>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import networkx as nx\n",
    "%matplotlib inline\n",
    "\n",
    "results = %cypher MATCH p = (:Person)-[:LIKES]->(:Drink) RETURN p\n",
    "\n",
    "g = results.get_graph()\n",
    "\n",
    "nx.draw(g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[(u'367', {u'age': 24, 'labels': [u'Person'], u'name': u'Nicole'}),\n",
       " (u'370', {u'calories': 0, 'labels': [u'Drink'], u'name': u'Coke Zero'}),\n",
       " (u'368', {u'age': 20, 'labels': [u'Person'], u'name': u'Drew'}),\n",
       " (u'369', {u'calories': 9000, 'labels': [u'Drink'], u'name': u'Mountain Dew'})]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.nodes(data=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{u'367': 2, u'368': 1, u'369': 2, u'370': 1}"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nx.degree(g)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
