{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# Data Science with Python and Neo4j\n",
    "\n",
    "## Packages You'll Need\n",
    "\n",
    "```\n",
    "pip install py2neo\n",
    "pip install ipython-cypher\n",
    "pip install pandas\n",
    "pip install networkx\n",
    "pip install python-igraph\n",
    "```\n",
    "\n",
    "## Contents\n",
    "\n",
    "* py2neo\n",
    "* ipython-cypher\n",
    "  - pandas\n",
    "  - NetworkX\n",
    "* igraph\n",
    "* graph3d"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# py2neo\n",
    "\n",
    "`py2neo` is one of Neo4j's Python drivers. It offers a fully-featured interface for interacting with your data in Neo4j. Install `py2neo` with `pip install py2neo`.\n",
    "\n",
    "## Connect\n",
    "\n",
    "Connect to Neo4j with the `Graph` class."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "from scripts.vis import draw\n",
    "\n",
    "graph = Graph()\n",
    "\n",
    "graph.delete_all()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Nodes\n",
    "\n",
    "Create nodes with the `Node` class. The first argument is the node's label. The remaining arguments are an arbitrary amount of node properties or key-value pairs."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"500\"\n",
       "            height=\"300\"\n",
       "            src=\"figure/graph-687b56f2-a691-4d42-b667-37461e6315c7.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x11220cbd0>"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Node\n",
    "\n",
    "nicole = Node(\"Person\", name=\"Nicole\", age=24)\n",
    "drew = Node(\"Person\", name=\"Drew\", age=20)\n",
    "\n",
    "mtdew = Node(\"Drink\", name=\"Mountain Dew\", calories=9000)\n",
    "cokezero = Node(\"Drink\", name=\"Coke Zero\", calories=0)\n",
    "\n",
    "coke = Node(\"Manufacturer\", name=\"Coca Cola\")\n",
    "pepsi = Node(\"Manufacturer\", name=\"Pepsi\")\n",
    "\n",
    "graph.create(nicole, drew, mtdew, cokezero, coke, pepsi)\n",
    "\n",
    "options = {\"Person\": \"name\", \"Drink\": \"name\", \"Manufacturer\": \"name\"}\n",
    "\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Relationships\n",
    "\n",
    "Create relationships between nodes with the `Relationship` class."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"500\"\n",
       "            height=\"300\"\n",
       "            src=\"figure/graph-59e6c9e9-ef80-40d7-8201-6bec4649ef1b.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x112228490>"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Relationship\n",
    "\n",
    "graph.create(Relationship(nicole, \"LIKES\", cokezero))\n",
    "graph.create(Relationship(nicole, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(drew, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(coke, \"MAKES\", cokezero))\n",
    "graph.create(Relationship(pepsi, \"MAKES\", mtdew))\n",
    "\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Cypher\n",
    "\n",
    "Retrieve Cypher query results with `Graph.cypher.execute`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   | name   | drink       \n",
       "---+--------+--------------\n",
       " 1 | Nicole | Mountain Dew\n",
       " 2 | Nicole | Coke Zero   \n",
       " 3 | Drew   | Mountain Dew"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name AS name, drink.name AS drink\n",
    "\"\"\"\n",
    "\n",
    "data = graph.cypher.execute(query)\n",
    "\n",
    "data"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "source": [
    "Rows can be accessed by index."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       " name   | drink       \n",
       "--------+--------------\n",
       " Nicole | Mountain Dew"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "data[0]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "source": [
    "Columns can be accessed by key or attribute."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Nicole likes to drink Mountain Dew.\n",
      "Nicole likes to drink Coke Zero.\n",
      "Drew likes to drink Mountain Dew.\n"
     ]
    }
   ],
   "source": [
    "for row in data:\n",
    "    print \"{0} likes to drink {1}.\".format(row[\"name\"], row.drink)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Parameterized Cypher\n",
    "\n",
    "Pass parameters to Cypher queries by passing additional key-value arguments to `Graph.cypher.execute.` Parameters in Cypher are named and are wrapped in curly braces."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   | name   | avg_calories\n",
       "---+--------+--------------\n",
       " 1 | Nicole |       4500.0"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p:Person)-[:LIKES]->(drink:Drink)\n",
    "WHERE p.name = {name}\n",
    "RETURN p.name AS name, AVG(drink.calories) AS avg_calories\n",
    "\"\"\"\n",
    "\n",
    "data = graph.cypher.execute(query, name=\"Nicole\")\n",
    "\n",
    "data"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# ipython-cypher\n",
    "\n",
    "`ipython-cypher` exposes `%cypher` magic in Jupyter. Install `ipython-cypher` with `pip install ipython-cypher`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "collapsed": true,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Cypher\n",
    "\n",
    "`%cypher` is intended for one-line Cypher queries and `%%cypher` is intended for multi-line Cypher queries. Placing `%%cypher` above a Cypher query will display that query's results."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>person.name</th>\n",
       "        <th>drink.name</th>\n",
       "        <th>drink.calories</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Coke Zero</td>\n",
       "        <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Drew</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[u'Nicole', u'Mountain Dew', 9000],\n",
       " [u'Nicole', u'Coke Zero', 0],\n",
       " [u'Drew', u'Mountain Dew', 9000]]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name, drink.name, drink.calories"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Pandas Data Frames\n",
    "\n",
    "Cypher query results can be coerced to `pandas` data frames with the `get_dataframe` method. To assign Cypher query results to a variable, you need to use `%cypher` and separate lines with \\\\. You'll first need to install `pandas` with `pip install pandas`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Drew</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Coke Zero</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name         drink\n",
       "0    Drew  Mountain Dew\n",
       "1  Nicole  Mountain Dew\n",
       "2  Nicole     Coke Zero"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = %cypher MATCH (person)-[:LIKES]->(drink:Drink) \\\n",
    "                  RETURN person.name AS name, drink.name AS drink\n",
    "    \n",
    "df = results.get_dataframe()\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Int64Index([0, 1, 2], dtype='int64')"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.index"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name         drink\n",
       "1  Nicole  Mountain Dew"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.iloc[[1]]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0      Drew\n",
       "1    Nicole\n",
       "2    Nicole\n",
       "Name: name, dtype: object"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df[\"name\"]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# NetworkX Graphs\n",
    "\n",
    "Cypher query results can be coerced to `NetworkX` MultiDiGraphs, graphs that permit multiple edges between nodes, with the `get_graph` method. You'll first need to install `NetworkX` with `pip install networkx`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAeAAAAFBCAYAAACvlHzeAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAIABJREFUeJzt3X98z/X+//H7NrbZD5kfk58NkR9hG5sV5kdK5DhJP7CR\nvo6Fs8gRclTnW4c6U8nv/AxrM8RBIb/Nz8liyyokHZKQn9nMfr8+f9RxIRyzvbfn3u/drn+1vfZ8\n7T6Xy7rv8Xy/Xq+3k2VZlgAAQLFyNh0AAIDSiAIGAMAAChgAAAMoYAAADKCAAQAwgAIGAMAAChgA\nAAMoYAAADKCAAQAwgAIGAMAAChgAAAMoYAAADKCAAQAwgAIGAMAAChgAAAMoYAAADKCAAQAwgAIG\nAMAAChgAAAMoYAAADKCAAQAwgAIGAMAAChgAAAMoYAAADKCAAQAwgAIGAMAAChgAAAMoYAAADKCA\nAQAwgAIGAMAAChgAAAMoYAAADKCAAQAwgAIGAMAAChgAAAMoYAAADKCAAQAwgAIGAMAAChgAAAMo\nYAAADKCAAQAwgAIGAMAAChgAAAMoYAAADKCAAQAwgAIGAMAAChgAAAPKmA4AACg6p06d0vHjx3Xl\nyhWVL19e9erVU8WKFU3HgihgAHA4eXl5Wr9+vWZMmKDde/aonpubPCWlSjqamaluXbtqyCuvKCQk\nRE5OTqbjllpOlmVZpkMAAGzj8OHDevKxx+R54YL+mpam5yR5XHf8gqQFTk760MND1Rs21Cdr18rX\n19dQ2tKNAgYAB5GcnKzH27XT26mp+n93+F97nqT/X7asFlWurO1ffqnq1asXT0hcQwEDgAM4efKk\nQpo108QLF/TMXax7u0wZfVKnjnYlJ8vDw+POC2AzXAUNAA7g/bff1rOXL99V+UrSmJwc1Th5Uh9H\nRxdJLtweEzAA2Ln09HTV9vXVvitXdF8B1m+SNKJOHSUfPcpFWcWICRgA7NzixYv1sJNTgcpXkjpK\nyvjlF+3atcuWsXAHFDAA2LnNq1apZ1pagdc7S3oqPV1bNm+2XSjcEQUMAHbu4rlzqlzIc1SxLF04\nc8YmeZA/FDAA2DkXFxflFvIcuZLKlC1rizjIJwoYAOxclerV9WMhz/Fj2bKqwr3AxYoCBgA793S/\nflro7V3g9RmSlri46KmnnrJdKNwRBQwAdq5z5846X66cEgu4/hNJAQEBql+/vi1j4Q4oYACwcy4u\nLuo7cKDecHbW3T7Y4aqk9z09NXjUqKKIhv+BAgYAO7d161bNnT9fhypV0uiyZfNdwtmS+pYrp0ad\nOql79+5FGRG3QAEDgJ3KycnR66+/rrCwMH300Ufa+8032lSnjga6ueniHdb+JKmbh4cyQkK0YMkS\nOTtTB8WNf3EAsEPHjh1TaGio9u7dq6SkJHXu3FlVqlTR9n37lPfkk6rr7q4B7u5K1G+TrvTbxVab\nJD3l6alm5cop8MUXtXLDBrm5uZn7QUoxChgA7Mwnn3yi4OBgPfXUU/r8889VtWrVa8e8vLz00eLF\nOnz8uOq/9pr63HuvPJyd5ebiovIuLnqlbl099u67On7mjN6ZOFFlypQx+JOUbrwZAwDYifT0dL38\n8svasmWL4uLiFBQUlK91lmUpMzNTbm5uvNlCCcIEDAB24MCBA2rZsqXS09O1f//+fJevJDk5Ocnd\n3Z3yLWEoYAAowSzL0vTp0/XII49ozJgxiomJUfny5U3Hgg2w+Q8AJdT58+c1YMAAnThxQrt37+ZB\nGQ6GCRgASqBt27bJ399f9erVU0JCAuXrgJiAAaAEycnJ0VtvvaU5c+boo48+UpcuXUxHQhGhgAGg\nhDh+/LjCwsLk4eGhpKQk3XvvvaYjoQixBQ0AJcDy5csVFBSk7t27a926dZRvKcAEDAAGpaena/jw\n4dq0aZNWr16t4OBg05FQTJiAAcCQr7/+WsHBwUpNTVVSUhLlW8pQwABQzCzL0ocffqgOHTpo5MiR\nio2N5d7eUogtaAAoRhcuXNBf/vIXHTt2TDt37tQDDzxgOhIMYQIGgGKyfft2+fv7y8/PTwkJCZRv\nKccEDABFLCcnR+PGjdPMmTP10UcfqWvXrqYjoQSggAGgCJ04cUJhYWFydXVVUlKSqlWrZjoSSgi2\noAGgiKxYsUItW7ZU165dtWHDBsoXN2ACBgAbu3r1qkaMGKF169Zp1apVCgkJMR0JJRATMADY0Dff\nfKOgoCBduHBBSUlJlC9uiwIGABuwLEuzZs1S+/btNWLECMXFxemee+4xHQslGFvQAFBIFy5c0MCB\nA3X06FHt2LFDDRs2NB0JdoAJGAAKYefOnQoICFCtWrW0Z88eyhf5xgQMAAWQm5ur8ePHa8aMGZo7\nd666detmOhLsDAUMAHfpp59+UlhYmFxcXLR//35Vr17ddCTYIbagAeAurFq1Si1atFDnzp21ceNG\nyhcFxgQMAPlw9epVjRw5UmvWrNHKlSv10EMPmY4EO8cEDAB38O2336pVq1Y6e/askpKSKF/YBAUM\nALdhWZZmz56tdu3aadiwYVq8eLEqVKhgOhYcBFvQAHALFy9eVEREhL777jtt375djRo1Mh0JDoYJ\nGAD+YPfu3QoICFC1atX0xRdfUL4oEkzAAPC73NxcvfPOO5o6darmzJmj7t27m44EB0YBA4CkkydP\nKjw8XJK0f/9+1ahRw3AiODq2oAGUep9++qlatGihRx55RJs2baJ8USyYgAGUWhkZGRo5cqQ+++wz\nLV++XK1btzYdCaUIEzCAUungwYNq1aqVTp8+raSkJMoXxY4CBlCqWJalefPmKTQ0VJGRkVq6dKl8\nfHxMx0IpxBY0gFLj0qVLevHFF3Xw4EFt27ZNjRs3Nh0JpRgTMIBSISEhQQEBAapSpYq++OILyhfG\nMQEDcGi5ubmKiorS5MmTNWvWLD355JOmIwGSKGAADuznn39WeHi4cnNz9eWXX6pWrVqmIwHXsAUN\nwCGtXr1agYGB6tChg7Zs2UL5osRhAgbgUDIzMzVq1CitXLlSy5YtU5s2bUxHAm6JAgbgMA4fPqxe\nvXqpbt26SkpKUsWKFU1HAm6LLWgAds+yLM2fP19t2rTRoEGDtGzZMsoXJR4TMAC79uuvv2rQoEFK\nSUlRfHy8mjRpYjoSkC9MwADs1hdffKGAgAD5+PgoMTGR8oVdYQIGYHfy8vI0YcIEffDBB5o5c6Z6\n9OhhOhJw1yhgAHbl1KlT6tu3rzIzM5WYmKjatWubjgQUCFvQAOzG2rVrFRgYqDZt2mjr1q2UL+wa\nEzCAEi8zM1NjxozRsmXLtGTJEoWGhpqOBBQaBQygRPvuu+/Uq1cv3XfffUpOTub2IjgMtqABlEiW\nZWnBggVq3bq1Bg4cqH//+9+ULxwKEzCAEufy5csaPHiwkpOTtWXLFjVt2tR0JMDmmIABlCh79+5V\nQECAvL29lZiYSPnCYTEBAygR8vLy9N577+m9997TjBkz9PTTT5uOBBQpChiAcadPn1a/fv2Unp6u\nxMRE3XfffaYjAUWOLWgARn3++ecKCAhQSEiI4uPjKV+UGkzAAIzIysrSmDFjtHTpUsXFxal9+/am\nIwHFigIGUOyOHDmi3r17q2bNmkpOTlalSpVMRwKKHVvQAIpVdHS0Hn74Yb3wwgtasWIF5YtSiwkY\nQJHavHmzQkNDlZGRoSFDhmjfvn3avHmzmjVrZjoaYBQTMIAikZGRocjISHXq1EkREREKDAxUuXLl\nlJiYSPkCkpwsy7JMhwDgWL799lv16tVLKSkp1z73+uuv66233jKYCihZKGAANmNZlubOnathw4bp\n6tWrNxyrXbu2jhw5IldXV0PpgJKF14AB2MTFixcVERGhZcuW3XSsXr16iouLo3yB6/AaMIBC2717\nt/z9/W9ZvmFhYdq/f7+CgoIMJANKLgoYQIHl5uZq/PjxCg0N1Y8//njDMU9PTy1cuFAxMTEqX768\noYRAycUWNIACOXnypMLDwxUfH3/TscDAQMXFxalBgwbFHwywE0zAAO7ap59+qmbNmt2yfP/2t79p\n9+7dlC9wB0zAAPItIyNDI0eO1LRp0246VqVKFS1cuFBdunQxkAywPxQwgHw5ePCgevXqpQMHDtx0\nrFOnToqOjla1atUMJAPsE1vQAP4ny7I0b948tWzZ8qbyLVOmjKKiorR+/XrKF7hLTMAAbuvSpUt6\n8cUXtXTp0puO1alTR3FxcWrVqpWBZID9YwIGcEsJCQny9/e/Zfn27t1bSUlJlC9QCBQwgBvk5ubq\n7bffVtu2bXX8+PEbjnl6emr+/PmKjY3VPffcYygh4BjYggZwzcmTJ9W3b19t3br1pmMBAQGKi4vT\nAw88YCAZ4HgoYMBBZWdna+XKldq5ebMunT2rsq6uqlq7tnqFh6tp06Y3ff3q1avVv39/nT9//qZj\nL7/8sv71r3/Jzc2tOKIDpQLvhgQ4mF9++UXTJ0/WnBkz1CAnR93T0lRRUpak/7i4KNrVVXUbNNCQ\n0aP13HPPKSsrS6NHj9aUKVNuOlflypW1YMECPfHEE8X+cwCOjgIGHMiBAwfUrWNHdUlL09DMTDW5\nxddkS/pU0tuenqrWqpVOnDt3y3t7O3bsqI8//ljVq1cv6thAqUQBAw7i0KFDahccrEmpqeqdj6+/\nKqmnpPjf//u/XFxcNG7cOI0cOVIuLi5FERWAKGDAIWRnZ6uxn5/+fuqUXriLX+ksSe0k7dNvk7Gf\nn5/i4uIUEhJSREkB/Be3IQEOYNWqVaqemnpX5StJrpKi9dvVmE8//bSSk5MpX6CYUMCAA5gRFaUh\nqakFWltfUoi7u7p37869vUAxYgsasHPff/+92jRrph+vXpVrAc+xUtLE5s21PTnZltEA/A9MwICd\nO3LkiPxdXQtcvpIULOnIf/5jq0gA8oECBuxcamqqvPPyCnUOb0mXr16949cBsB0KGLBzXl5eSnUu\n3K9yqiTvcuVsEwhAvlDAgJ2rX7++vsrKUnYhzvGlpPp+fjZKBCA/KGDAztWvX1916tXTikKcY4aX\nlwaOGGGzTADujAIG7NySJUv01Q8/KKqA67+XtF/Ss88+a8NUAO6EAgbs1OXLl/X888+rV69eSk9P\n10FJC+7yHNmShnh4aHBkpNzd3W0fEsBtcR8wYIcSEhIUFham//zh1qFykuZLei4f58iU1NfdXekP\nPaSVGzaoTBnenRQoTkzAgB3JycnRm2++qbZt295Uvq6urhoyYoReqVhRka6uOny7c0haJSnU01NW\nx476ZM0ayhcwgAkYsBM//PCDwsPDlZCQcNOxJk2aKDY2Vs2bN9fp06c17YMPNHfmTD2Yl3fD+wEf\nc3bWAnd31axbV0NGj1afPn3kXMhbmAAUDAWcD/v27dPS2FidOXFCOdnZ8vH1VfvOndW9e3eVLVvW\ndDw4OMuy9PHHHysyMlKpt3je80svvaSoqCiV+8N9vFlZWVq+fLl2btyoi2fPytXdXVVr1VKvvn0V\nEBBQXPEB3AYFfBu5ubmKiYnRjKgonTl+XP0yMuSXl6cyks5JWuntraMuLoqIjNRfhw1T5cqVTUeG\nA7p48aIGDx6sJUuW3HTM19dX8+fPV9euXQ0kA1BYFPAtXLlyRb3//Ged27NHf79yRV0k3eptyVMk\nTXFz06Z77tGarVvVuHHjYk4KRxYfH69+/frpxIkTNx3r1q2b5s2bJ19fXwPJANgCBfwH2dnZeqJ9\ne1Xdv1/zMjLy9YD7aCcnjS5fXjv37VO9evWKPCMcW1ZWlv7xj38oKipKf/z1dHd318SJEzVo0CA5\nOTkZSgjAFrj08Q/Gjhght6Qkzc/IyPc/Tj/L0pXUVHV/5BEdOHpULi63mpeBOzt8+LDCwsK0b9++\nm475+/tr0aJFatSokYFkAGyNyx+vk5aWpnnz5unDq1fv+i+TwXl58rhwQevXry+SbHBslmVpzpw5\nCgwMvGX5jhw5Unv27KF8AQdCAV8nNiZG7ZycVLOA6wenpmrGhAk2zQTHd+7cOfXo0UMRERFKT0+/\n4ViNGjW0adMmTZgwQW5uboYSAigKvAZ8nRYNGuhfR47o0QKuT5dU291dyUeOqGbNgtY4SpMNGzbo\n+eef1+nTp2861rNnT82aNUuVKlUykAxAUWMCvs53P/6o4EKs95DU2M1NR48etVUkOKiMjAwNHz5c\nnTt3vql8PT09NW/ePH3yySeUL+DAuAjrd5ZlKS0zU16FPI+3dMuHJQD/9fXXX6tPnz5KSUm56Vhw\ncLBiY2N1//33G0gGoDgxAf/OyclJXm5uSivkeVIleXt72yISHIxlWZo6dapatmx5U/k6Ozvr9ddf\n186dOylfoJRgAr5Og9q1tbeQrwF/k5nJvcC4yenTp/XCCy9o3bp1Nx277777FBMTozZt2hhIBsAU\nJuDrRPztb/rQ07PA6xdLeqhVKy7Awg0+++wzNW3a9JblGxYWpq+++oryBUohCvg6YeHh2mZZ+qmA\n6z/09taQUaNsmgn2zbIsTZ8+XefOnbvh8+XLl1dsbKxiYmJ0zz33GEoHwCQK+DpeXl4aMGCABnt4\nKOcu137o7Kz0ihXVuXPnIskG+2RZloKCgm54bGSbNm301VdfqU+fPgaTATCNAv6D8e+/r0x/f73g\n7q6sfK5ZIOlNLy99unkzj6HENT/99JMeffRRxcfHa+bMmSpTpozGjRun+Ph4+fn5mY4HwDAK+A/K\nli2rFRs26HKbNmrv6anPJOXe5mtTJPWV9FdJHbp25eIrXLNs2TK1aNFCHTt2VHx8vCIiInTkyBGN\nHTuWP9IASOJJWLeVm5ur2NhYzYiK0uljx/R8RoZq5+WprKTzkpa4uSklM1OZ+q2gnZ2dtX//fjVv\n3txscBiVmpqqYcOGaceOHYqNjVVwcGEe7QLAkVHA+bBv3z4tXbRIv5w4oeysLPn4+qp1x4567bXX\nbnjqVdu2bbVt2zbeJq6U+uKLLxQWFqb27dtr0qRJ8vIq7GNdADgyCrgQ1qxZo27dut3wuUWLFql3\n796GEsGEnJwcvfPOO5o2bZpmzJihnj17mo4EwA5QwIX0xBNPaO3atdc+rlGjhg4dOsT0U0ocO3ZM\n4eHhcnNz08KFC7kHHEC+cRFWIU2aNElly5a99vHJkyf19ttvG0yE4hIbG6ugoCD16NFDGzdupHwB\n3BUmYBt49dVXFRUVde1jV1dXffPNNzzT10FdunRJQ4YMUXJysmJjYxUQEGA6EgA7xARsA2PHjlW1\natWufZyVlaXhw4cbTISismPHDvn7+8vHx0dffvkl5QugwChgG/D29ta77757w+dWr159w2vDsG/Z\n2dkaO3asnn32WU2bNk3Tp0+Xh4eH6VgA7Bhb0DZiWZbatm2rXbt2Xftc/fr1lZKSIjc3N4PJUFhH\njhxRWFiYKleurPnz56tq1aqmIwFwAEzANuLk5KSpU6fecA/wkSNHNHnyZIOpUBiWZWnevHl6+OGH\n1a9fP61Zs4byBWAzvB+wDQUEBCgiIkKzZs2S9NvWtK+vr+FUKIjz588rIiJC33//veLj49WkSRPT\nkQA4GCZgGxs3bpwqV66s7t27y8fHR7169TIdCXdp06ZNat68ufz8/LR3717KF0CR4DXgInD58mWV\nL19ePXv2VEBAgF577TXTkZAPmZmZGjt2rBYvXqz58+fr0UcfNR0JgAOjgIvQsWPH1LJlSyUlJalW\nrVqm4+B/+Pbbb9WnTx/VrVtXs2fPVuXKlU1HAuDg2IIuQn5+foqMjNQrr7xiOgpuw7IszZgxQ+3a\ntVNkZKSWL19O+QIoFkzARSw9PV2NGjXSwoUL1b59e9NxcJ0zZ85owIABOnPmjGJjY9WgQQPTkQCU\nIkzARczDw0Pvv/++hg4dqpycHNNx8Lu1a9cqICBAzZs31+7duylfAMWOCbgYWJalTp06qUePHoqM\njDQdp1S7evWqRo4cqc8++0zR0dFq166d6UgASikKuJh888036tChg7799lteYzQkOTlZYWFhatq0\nqWbOnKkKFSqYjgSgFGMLupg0adJEffr00dixY01HKXXy8vI0ceJEPfroo3r11VcVFxdH+QIwjgm4\nGF26dEkNGzbU2rVrFRgYaDpOqXDy5En1799f6enpiomJUZ06dUxHAgBJTMDFqkKFCho/frxeeukl\n8XdP0VuxYoUCAwMVGhqqbdu2Ub4AShQm4GKWl5enVq1aadiwYQoPDzcdxyGlpaVp+PDh2rJli2Jj\nYxUSEmI6EgDchAm4mDk7O2vq1KkaPXq0UlNTTcdxOImJiQoMDFROTo6Sk5MpXwAlFhOwIf3791fV\nqlUVFRVlOopDyM3NVVRUlCZPnqxp06bpmWeeMR0JAP4nCtiQ06dP68EHH9SuXbv0wAMPmI5j144f\nP66+ffvKxcVF0dHRPHcbgF1gC9qQe++9V2PGjNHLL7/MBVmFEBcXp6CgIHXr1k2bNm2ifAHYDSZg\ng7KystSsWTO9++67+tOf/mQ6jl359ddfFRkZqcTERC1atIjbugDYHSZgg1xdXTVlyhQNHz5cGRkZ\npuPYjV27dsnf319eXl7av38/5QvALlHAhj322GN68MEH9cEHH5iOUuJlZ2frjTfeUM+ePTV58mR9\n+OGH8vDwMB0LAAqELegS4IcfflBwcLCSk5NVs2ZN03FKpKNHjyosLEwVKlTQggULdO+995qOBACF\nwgRcAtStW1eDBw/WqFGjTEcpcSzL0oIFCxQSEqI+ffpo7dq1lC8Ah8AEXEJcuXJFjRo1UkxMjEJD\nQ03HKREuXLigQYMG6dChQ4qNjVXTpk1NRwIAm2ECLiE8PT313nvv6aWXXlJOTo7pOMZt3bpV/v7+\nqlGjhvbu3Uv5AnA4FHAJ8swzz6hixYqaPXu26SjGZGVlafTo0QoPD9ecOXP0wQcfyN3d3XQsALA5\ntqBLmJSUFD3yyCM6ePCgKlWqZDpOsTp06JDCwsJUs2ZNzZ07V1WqVDEdCQCKDBNwCdO0aVM999xz\neu2110xHKTaWZWnmzJlq27atIiIitHLlSsoXgMNjAi6BLl68qIYNG2rdunUKCAgwHadInT17VgMG\nDNDJkycVGxurhg0bmo4EAMWCCbgE8vHx0T//+U8NHTrUoZ8TvW7dOvn7+6tx48ZKSEigfAGUKkzA\nJVRubq6Cg4M1YsQI9enTx3Qcm8rIyNDo0aO1YsUKRUdHq3379qYjAUCxYwIuoVxcXDRlyhSNGjVK\naWlppuPYTEpKioKCgnTq1Cl99dVXlC+AUosCLsFat26tDh06aPz48aajFFpeXp4mT56sjh076pVX\nXtGSJUvk4+NjOhYAGMMWdAn3888/q1mzZkpISFD9+vVNxymQU6dOqX///rp8+bJiYmJUr14905EA\nwDgm4BKuevXqGjVqlIYPH246SoGsWrVKAQEBeuihh7Rjxw7KFwB+xwRsB7KystS0aVNNnDhRTzzx\nhOk4+XLlyhWNGDFCGzZsUExMjB5++GHTkQCgRGECtgOurq6aNGmSXn75ZWVmZpqOc0f79u1TYGCg\nrl69quTkZMoXAG6BArYTXbp0UcOGDTVp0iTTUW4rNzdXUVFR6tKli9566y0tXLhQ5cuXNx0LAEok\ntqDtyPfff6+QkBAdOHBA1atXNx3nBidOnFDfvn1lWZY+/vhj1a5d23QkACjRmIDtyP3336+IiAiN\nGjXKdJQbLF26VC1atNDjjz+uLVu2UL4AkA9MwHYmLS1NjRo10uLFi9W6dWujWS5fvqyhQ4dq9+7d\nWrRokVq2bGk0DwDYEyZgO+Pl5aUJEyYoMjJSubm5xnIkJCQoICBArq6uSkpKonwB4C5RwHaoV69e\n8vb21ty5c4v9e+fk5OjNN99Ujx499P7772v27Nny9PQs9hwAYO/YgrZTycnJ6ty5sw4ePKiKFSsW\ny/f84YcfFB4eLi8vLy1YsKDEXQgGAPaECdhO+fv7q2fPnnrjjTeK/HtZlqXo6GiFhITo2Wef1bp1\n6yhfACgkJmA7dv78eTVq1EgbN25U8+bNi+R7XLx4UYMHD9bXX3+tRYsWqVmzZkXyfQCgtGECtmOV\nKlXSm2++qaFDh6oo/o7atm2b/P395evrq8TERMoXAGyIArZzERER+vXXX7V06VKbnTMrK0tjxoxR\n7969NXPmTE2ZMkXlypWz2fkBAGxBO4QdO3YoLCxMBw8eLPQVyYcPH1ZYWJiqVaumefPmydfX10Yp\nAQDXYwJ2AG3btlXbtm31zjvv6PLly5oxfboeadlSzfz81KRWLbVp2lT/GDtWP/30023PYVmW5syZ\nozZt2mjAgAH69NNPKV8AKEJMwA4iJSVFbYKC5OzkpE4uLnr+yhXVkuQi6ayk5W5uWuTkpA7t2unN\n997Tgw8+eG3tuXPnNHDgQB07dkyLFi1So0aNTP0YAFBqMAE7gKNHj+qpxx9XeHa2vs7I0CdXrqib\npOaSHpTUQdK0zEwdz8hQ6Pr16hgSoo0bN0qSNmzYIH9/f9WvX1979uyhfAGgmDAB27kzZ87ooebN\n9crZsxqSl5evNTskPVWunDr9+c/auXOnFi5cqI4dOxZtUADADShgO9fjscfUZOtWjcvJuat1qyWF\nu7rq8I8/qmrVqkUTDgBwW2xB27Fjx45p+44d+vtdlq+k37ao3dy0fft22wcDANwRBWzHZk+frn55\nefIo4PohqamaERVl00wAgPxhC9qO1axYURsvXlRBL5vKklTD3V37Dh9W7dq1bRkNAHAHTMB2Ki8v\nT6cuXVKDQpzDVVJdNzf9/PPPtooFAMgnCthOZWVlqYyzs1wKeZ5yktLT020RCQBwFyhgO+Xm5iZJ\nulrI81yyLPn4+BQ+EADgrlDAdsrJyUktGzfWxkKc46SkH7Ozdf/999sqFgAgnyhgOzZ41CjN8PIq\n8Po5Li7q3bu3vL29bZgKAJAfXAVtxzIyMlS7ShXtTEu764uxsiTVKVdO6/fuveG50ACA4sEEbMfc\n3d01euxY9fHwUNpdrLMkDXJ3V0hoKOULAIYwAds5y7IU0bevDq1YoVXp6ap4h6/PkRTp5qb99epp\n6969hX6ncmFnAAAB7UlEQVT/YABAwTAB2zknJyfNio5WyIABaubhobddXHTmFl+XLmmepJZeXjoW\nHKzNe/ZQvgBgEBOwA0lKStKHEyfqk2XLFFq2rGplZcnFsnTO1VXrc3L08EMPacioUXrsscfk7Mzf\nXgBgEgXsgC5duqR169bp7NmzysnJkY+Pj9q3by8/Pz/T0QAAv6OAAQAwgH1IAAAMoIABADCAAgYA\nwAAKGAAAAyhgAAAMoIABADCAAgYAwAAKGAAAAyhgAAAMoIABADCAAgYAwAAKGAAAAyhgAAAMoIAB\nADCAAgYAwAAKGAAAAyhgAAAMoIABADCAAgYAwAAKGAAAAyhgAAAMoIABADCAAgYAwAAKGAAAAyhg\nAAAMoIABADCAAgYAwAAKGAAAAyhgAAAMoIABADCAAgYAwAAKGAAAAyhgAAAMoIABADCAAgYAwAAK\nGAAAAyhgAAAMoIABADCAAgYAwAAKGAAAAyhgAAAMoIABADCAAgYAwAAKGAAAAyhgAAAMoIABADCA\nAgYAwAAKGAAAAyhgAAAMoIABADCAAgYAwAAKGAAAAyhgAAAMoIABADCAAgYAwAAKGAAAAyhgAAAM\noIABADCAAgYAwAAKGAAAAyhgAAAMoIABADCAAgYAwAAKGAAAAyhgAAAMoIABADDg/wC+5UJRuC6b\nsAAAAABJRU5ErkJggg==\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x11469af50>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import networkx as nx\n",
    "%matplotlib inline\n",
    "\n",
    "results = %cypher MATCH p = (:Person)-[:LIKES]->(:Drink) RETURN p\n",
    "\n",
    "g = results.get_graph()\n",
    "\n",
    "nx.draw(g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[(u'13', {u'age': 20, 'labels': [u'Person'], u'name': u'Drew'}),\n",
       " (u'12', {u'age': 24, 'labels': [u'Person'], u'name': u'Nicole'}),\n",
       " (u'15', {u'calories': 0, 'labels': [u'Drink'], u'name': u'Coke Zero'}),\n",
       " (u'14', {u'calories': 9000, 'labels': [u'Drink'], u'name': u'Mountain Dew'})]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.nodes(data=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{u'12': 2, u'13': 1, u'14': 2, u'15': 1}"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nx.degree(g)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# igraph\n",
    "\n",
    "Cypher query results can be imported into `igraph` with `py2neo`. You'll need to install `igraph` with `pip install python-igraph`. Query results should be returned as edgelists, as `igraph` has a method for building an `igraph` object from a list of tuples representing edges between nodes."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   | person.name | drink.name  \n",
       "---+-------------+--------------\n",
       " 1 | Nicole      | Mountain Dew\n",
       " 2 | Nicole      | Coke Zero   \n",
       " 3 | Drew        | Mountain Dew"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Graph as PGraph\n",
    "from igraph import Graph as IGraph\n",
    "\n",
    "neo4j = PGraph()\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name, drink.name\n",
    "\"\"\"\n",
    "\n",
    "data = neo4j.cypher.execute(query)\n",
    "data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<igraph.Graph at 0x1147dd050>"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ig = IGraph.TupleList(data)\n",
    "\n",
    "ig"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[u'Nicole', u'Mountain Dew']"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "best = ig.vs.select(_degree = ig.maxdegree())[\"name\"]\n",
    "best"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true,
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## graph3d\n",
    "\n",
    "`graph3d`, originally named `igraph` but which I've renamed to avoid conflicts with the other `igraph`, will plot tuple lists as 3D graphs."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-11e32b52-43ac-4bcc-8fe9-5ff08464bd93\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {igraph: ['nbextensions/igraph.min', 'https://rawgit.com/patrickfuller/igraph/master/js/build/igraph.min']}});\n",
       "           require(['igraph'], function () {\n",
       "               var $d = $('#graph-11e32b52-43ac-4bcc-8fe9-5ff08464bd93');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.igraph = jQuery.extend({}, igraph);\n",
       "               $d.igraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true});\n",
       "               $d.igraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 1, \"target\": 2 },\n",
       "        { \"source\": 2, \"target\": 3 },\n",
       "        { \"source\": 3, \"target\": 4 },\n",
       "        { \"source\": 4, \"target\": 1 },\n",
       "        { \"source\": 4, \"target\": 5 },\n",
       "        { \"source\": 5, \"target\": 2 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"1\": { \"location\": [ -2.000, -2.000, -2.000 ] },\n",
       "        \"2\": { \"location\": [ -0.942, -1.025, -0.978 ] },\n",
       "        \"3\": { \"location\": [ -0.080, 0.461, 0.173 ] },\n",
       "        \"4\": { \"location\": [ 0.930, 0.944, 1.104 ] },\n",
       "        \"5\": { \"location\": [ 2.000, 2.000, 2.000 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.igraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import graph3d\n",
    "\n",
    "graph3d.draw([(1, 2), (2, 3), (3, 4), (4, 1), (4, 5), (5, 2)])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "We can visualize our Neo4j data by pulling out an edgelist with a Cypher query."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-1b42c583-5f01-40f5-8da1-13b654b44994\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {igraph: ['nbextensions/igraph.min', 'https://rawgit.com/patrickfuller/igraph/master/js/build/igraph.min']}});\n",
       "           require(['igraph'], function () {\n",
       "               var $d = $('#graph-1b42c583-5f01-40f5-8da1-13b654b44994');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.igraph = jQuery.extend({}, igraph);\n",
       "               $d.igraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true});\n",
       "               $d.igraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 12, \"target\": 14 },\n",
       "        { \"source\": 12, \"target\": 15 },\n",
       "        { \"source\": 13, \"target\": 14 },\n",
       "        { \"source\": 16, \"target\": 15 },\n",
       "        { \"source\": 17, \"target\": 14 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"12\": { \"location\": [ -2.000, -2.000, -2.000 ] },\n",
       "        \"13\": { \"location\": [ -1.542, -1.555, -1.749 ] },\n",
       "        \"14\": { \"location\": [ -0.439, -0.345, -1.058 ] },\n",
       "        \"15\": { \"location\": [ 0.435, 0.546, 0.420 ] },\n",
       "        \"16\": { \"location\": [ 2.000, 1.526, 1.718 ] },\n",
       "        \"17\": { \"location\": [ 2.000, 2.000, 2.000 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.igraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "from py2neo import Graph\n",
    "\n",
    "graph = Graph()\n",
    "\n",
    "data = graph.cypher.execute(\"MATCH (n)-->(m) RETURN ID(n), ID(m)\")\n",
    "data = [tuple(x) for x in data]\n",
    "\n",
    "graph3d.draw(data)"
   ]
  }
 ],
 "metadata": {
  "celltoolbar": "Slideshow",
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
